       IDENTIFICATION DIVISION.
       PROGRAM-ID. SFISERS611C.
      *    
      * 
      * Servicio Transaccional Simulacion de Venta (CAJA)
      *
       AUTHOR. Ripley.
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
                SELECT ARCHIVO ASSIGN TO "LOG611C.txt"
                       ORGANIZATION LINE SEQUENTIAL
                       FILE STATUS IS WS-FILE-STATUS.

       DATA DIVISION.
       FILE SECTION.

       FD  ARCHIVO.
       01  REG-ARCHIVO.
           05 LINEA-ARCHIVO              PIC X(7120).
       
       WORKING-STORAGE SECTION.
       01  WS-FILE-STATUS             PIC XX.
       01  WS-SWINDPLZ                PIC X(01) VALUE '0'.

       01  SW-INICIO                  PIC 99 VALUE ZEROS.
       
       01  WS-VARIABLES.
RDC        05  WS-DEPTO              PIC X(05) VALUE SPACES.
           05  WS-FEC1V              PIC 99 VALUE 1.
      *LRO-TECNOCOM-E&Y1-I                                                     
           05  WS-FECVCTO-CAE-1      PIC X(10) VALUE SPACES.
           05  WS-IND-VTO                   PIC 9(03) VALUE ZEROS.
           05  WS-IND-CAREN                 PIC 9(03) VALUE ZEROS.                  
           
           05  WS-TIPO-INTERES           PIC X(01)   VALUE SPACES.
           05  CT-RETORNO-OK             PIC X(02)   VALUE "00".
                      
      *LRO-TECNOCOM-E&Y1-F                                                                                                        
           05  WS-FECVCTO-CAE        PIC 9(08).
           05  WS-RFECVCTO-CAE REDEFINES WS-FECVCTO-CAE.
               10 WS-FECHA-A-CAE        PIC 9(04).
               10 WS-FECHA-M-CAE        PIC 9(02).
               10 WS-FECHA-D-CAE        PIC 9(02).
           05  IR                           PIC 99.
           05  POS-INI                      PIC 99.
           05  VAR-CODDEPTO                 PIC X(05).
           05  VAR-CODDEPTO-X               PIC X(05).
           05  LAR-CDD                      PIC 99.     
           05  VAR-CODTIPC                  PIC X(04).                 
       
           05  WS-TOTAL-COMISION      PIC 9(08) VALUE ZEROS.
           05  WS-MONTO-COMISION      PIC 9(08) VALUE ZEROS.
           05  WS-MENSAJE-ATOMICO     PIC X(300).
           05  WS-ART-ENT.
               06 WS-MONTO            PIC 9(12).
               06 WS-RESTO            PIC X(26).
           05  WS-OFI-04              PIC 9(04).
           05  WS-OFI-15              PIC 9(15).
           05  WS-MONTO-ENTERO        PIC 9(14).
           05  WS-ARR-TASAS-ARTICULOS PIC X(1080).
           05  WS-RED-ARR-TASAS-ARTICULOS 
                                REDEFINES WS-ARR-TASAS-ARTICULOS.
               10 WS-ARR-AUX-ARTICULOS OCCURS 40 TIMES.
                  20 ARR-ARTICULO PIC X(13).
                  20 ARR-TASA-COM PIC 9(2)V9999.
                  20 ARR-TASA-EFE PIC 9(2)V9999.
      *INI-NBV SATI: 448796 2013-03-11 provisorio.
           05  WS-EQUIV-SUCURSALES.
               07 WS-COD-SUC-1        PIC 9(08) VALUE  09670000.
               07 WS-COD-SUC-2        PIC 9(08) VALUE  02900003.  
               07 WS-COD-SUC-3        PIC 9(08) VALUE  06560004.
               07 WS-COD-SUC-4        PIC 9(08) VALUE  08390009.
               07 WS-COD-SUC-5        PIC 9(08) VALUE  05200011.
               07 WS-COD-SUC-6        PIC 9(08) VALUE  54130012.
               07 WS-COD-SUC-7        PIC 9(08) VALUE  05950014.
               07 WS-COD-SUC-8        PIC 9(08) VALUE  71100016.
               07 WS-COD-SUC-9        PIC 9(08) VALUE  08860017.
               07 WS-COD-SUC-10       PIC 9(08) VALUE  06980018.
               07 WS-COD-SUC-11       PIC 9(08) VALUE  06990022.
               07 WS-COD-SUC-12       PIC 9(08) VALUE  16460025.
               07 WS-COD-SUC-13       PIC 9(08) VALUE  05300026.
               07 WS-COD-SUC-14       PIC 9(08) VALUE  10680028.
               07 WS-COD-SUC-15       PIC 9(08) VALUE  05500030.
               07 WS-COD-SUC-16       PIC 9(08) VALUE  04900032.
               07 WS-COD-SUC-17       PIC 9(08) VALUE  13480037.
               07 WS-COD-SUC-18       PIC 9(08) VALUE  09790039.
               07 WS-COD-SUC-19       PIC 9(08) VALUE  32960046.
               07 WS-COD-SUC-20       PIC 9(08) VALUE  32420051. 
           05  WS-RED-EQUIV-SUCUR     REDEFINES 
                                      WS-EQUIV-SUCURSALES .
               07 ARRE-EQUIV-SUCURSALES OCCURS 20 TIMES.
                  10 ARR-SUC-DIREC    PIC 9(04).
                  10 ARR-SUC-SUC      PIC 9(04).
           05  II                     PIC 9(04).
           05  SW-ENCONTRAR           PIC X(01) VALUE 'N'.
      *FIN-NBV SATI: 448796 2013-03-11 provisorio.                

           05  WS-FF                     PIC 9(03)   VALUE 0.
           05  WS-DECIMALES              PIC 9(01)   VALUE ZEROS.
           05  CT-000000-ALF             PIC X(06)   VALUE "000000".
           05  CT-VALOR-00               PIC 9(02)   VALUE ZEROS.

           05  WS-CUOTA-COMISION      PIC 9(08) VALUE ZEROS.
           05  WS-VALOR-CUOTA-N       PIC 9(10) VALUE ZEROS.
           05  WS-LINEA          PIC X(004) VALUE SPACES.
           05  WS-LINEA-NUM REDEFINES WS-LINEA PIC 9(04).
           05  WS-BOTGEN-INI                PIC 9(03)  VALUE 1.
           05  WS-FIN-PAG-BOTGEN            PIC X(01)  VALUE 'N'. 
           05  WS-CONTA-BOTGEN              PIC 9(06)  VALUE 0.               
           05  WS-MESES-CARENCIA            PIC 9(02).
           05  WS-CONTA-ATPLANFI            PIC 9(06)  VALUE 1.               
           05  WS-TOPE-ART       PIC 9(04).
           05  WS-TOPE-VCTO      PIC 9(03).
           05  WS-IND-PV         PIC 9(01).
           05  WS-STRING-VCTOS   PIC X(800).
           05  WS-RED-STRING-VCTOS REDEFINES WS-STRING-VCTOS.
               10  WS-ARREGLO-VCTOS OCCURS 100.
                   15 WS-VCTO-FECHA  PIC 9(08).
           05  WS-FECHA-VCTO     PIC 9(08).
           05  WS-RFECHA-VCTO REDEFINES WS-FECHA-VCTO.
               10 WS-FECHA-A     PIC 9(04).
               10 WS-FECHA-M     PIC 9(02).
               10 WS-FECHA-D     PIC 9(02).
           05  VAR-IMPGESIC1           PIC S9(10)V99.
           05  WS-U                    PIC X  VALUE "U".
           05  WS-S                    PIC X  VALUE "S".
           05  WS-P                    PIC X  VALUE "P".
           05  WS-T                    PIC X  VALUE "T".                      
           05  WS-CONCRE               PIC X(15).
           05  WS-SIGUE                PIC X.
           05  WS-FIN                  PIC X.
           05  WS-I-CUO                PIC  9(03)   VALUE ZEROS.
           05  IND                     PIC  9(03)   VALUE ZEROS.
           05  I-IND                   PIC  9(03)   VALUE ZEROES.
           05  WS-IMP-TOT-TRX          PIC S9(15)V99.
           05  WS-ACUM-CAPITAL         PIC S9(15)V99.
           05  WS-SQLCODE              PIC S9(09)   VALUE ZEROES.
           05  WS-FEC-EDI-DMA.
               10  WS-DIA-EDI-DMA      PIC  X(02).
               10  WS-SL1-EDI-DMA      PIC  X(01).
               10  WS-MES-EDI-DMA      PIC  X(02).
               10  WS-SL2-EDI-DMA      PIC  X(01).
               10  WS-ANO-EDI-DMA      PIC  X(04).
           05  WS-FEC-EDI-AMD.
               10  WS-ANO-EDI-AMD      PIC  X(04).
               10  WS-SL2-EDI-AMD      PIC  X(01).
               10  WS-MES-EDI-AMD      PIC  X(02).
               10  WS-SL1-EDI-AMD      PIC  X(01).
               10  WS-DIA-EDI-AMD      PIC  X(02).
           05  WS-IND-FECHA            PIC  9(01).
           05  WS-VLR-CUOTA            PIC  9(12)V9(02) VALUE ZEROES.
           05  WS-TASA-EFEC            PIC  9(03)V9(04) VALUE ZEROES.
           05  WS-TASA-COMER           PIC  9(03)V9(04) VALUE ZEROES.
           05  WS-TASA-CAREN           PIC  9(03)V9(04) VALUE ZEROES.
           05  WS-TASA-GESIC1          PIC  9(03)V9(04) VALUE ZEROES.
           05  WS-CANT-MESES-CARENCIA  PIC  9(02) VALUE ZEROES.

      *==> ADDSYSTEM 09/05/2011 FVC-I

           05  WS-FEC-EDT.
               10 A                   PIC 9999.
               10 FILLER              PIC X.
               10 M                   PIC 99.
               10 FILLER              PIC X.
               10 D                   PIC 99.
           05  WS-DIF-AAAAMMDD.
                10 A                  PIC 9999.
                10 M                  PIC 99.
                10 D                  PIC 99.			   
           05  WS-PROD                PIC 9(04) VALUE ZEROS.
           05  WS-LIN                 PIC 9(04) VALUE ZEROS.
           05  WS-CANPROD             PIC 9(04) VALUE ZEROS.
           05  WS-CANLIN              PIC 9(04) VALUE ZEROS.
           05  WS-MD                  PIC 9(04) VALUE ZEROS.
           05  WS-CANTIPC             PIC 9(04) VALUE ZEROS.
           05  WS-CANTDIF             PIC 9(04) VALUE ZEROS.
           05  WS-DIF                 PIC 9(04) VALUE ZEROS.
           05  WS-FECAREN             PIC 9(04) VALUE ZEROS.
           05  WS-CAREVTO             PIC 9(04) VALUE ZEROS.                                                                                                                        
           05  IND-PROD               PIC 9(04) VALUE ZEROS.
           05  IND-LIN                PIC 9(04) VALUE ZEROS. 
           05  IND-TIPC               PIC 9(04) VALUE ZEROS.
              
           05  WS-CANMES              PIC 9(02) VALUE ZEROS.
           05 WS-IMPMINCOMCUO         PIC 9(15)V99.
           05 WS-IMPMAXCOMCUO         PIC 9(15)V99.
           05 WS-NUMMESMINCUO         PIC 99.
           05 WS-NUMMESMAXCUO         PIC 99.
           05  WS-FECAUTDIA.
               10 A                    PIC 9999.
               10 M                    PIC 99.
               10 D                    PIC 99.
           05  WS-P1                   PIC 9(02) VALUE ZEROS.
      *==> ADDSYSTEM 09/05/2011 FVC-F

   	       05  WS-HORA                 PIC  X(06).
           05  WS-HORA-SYS             PIC  9(08)   VALUE ZEROS.
           05  WS-FECHA.
                10 WS-ANO              PIC 99.
                10 WS-MES              PIC 99.
                10 WS-DIA              PIC 99.
           05  WS-FECHA-SYS.
               10  WS-ANO-SYS          PIC 9999.
               10  WS-GUION1           PIC X.
               10  WS-MES-SYS          PIC 99.
               10  WS-GUION2           PIC X.
               10  WS-DIA-SYS          PIC 99.
               10  WS-GUION3           PIC X.
           05  WS-FECH-TRX-DMA.
               10  D                   PIC XX.
               10  M                   PIC XX.
               10  A                   PIC X(04).
           05  WS-FECH-TRX-AMD.
               10  A                   PIC X(04).
               10  M                   PIC XX.
               10  D                   PIC XX.
           05  I                       PIC  9(04).
           05  J                       PIC  9(04).
           05  WS-NUM-SECUENCIA        PIC  9(04) VALUE ZEROES.
           05  WS-BLOQ-PERS            PIC  X(01) VALUE "N".
           05  WS-FECHA-COMPRA.
               10 WS-FECCOM-AAAA       PIC 9(04).
               10 WS-FECCOM-MM         PIC 99.
               10 WS-FECCOM-DD         PIC 99.
           05  WS-FECHA-EDITADA.
               10 WS-FECHA-EDT-AAAA    PIC 9999.
               10 FILLER               PIC X.
               10 WS-FECHA-EDT-MM      PIC 99.
               10 FILLER               PIC X.
               10 WS-FECHA-EDT-DD      PIC 99.
           05  WS-FECHA-OPERACION.
               10 WS-FECHA-OPE-AAAA    PIC 9999.
               10 WS-FECHA-OPE-MM      PIC 99.
               10 WS-FECHA-OPE-DD      PIC 99.
           05  WS-FECHA-OPE-GUION.
               10 WS-FECHA-OPE-AAAA-G  PIC 9999.
               10 WS-GUION1            PIC X(01) VALUE "-".
               10 WS-FECHA-OPE-MM-G    PIC 99.
               10 WS-GUION2            PIC X(01) VALUE "-".
               10 WS-FECHA-OPE-DD-G    PIC 99.
           05  WS-PRODSUBPROD.
               10 WS-PRODUCTO          PIC X(02).
               10 WS-SUBPRODU          PIC X(04).
           05  WS-MARCATIPO.
               10 WS-MARCA             PIC 99.
               10 WS-TIPO              PIC 99.
           05  WS-COD-MENSAJE          PIC 9(04)  VALUE ZEROS.
           05  WS-RET-MTO-PASE         PIC S9(12) VALUE ZEROS.
           05  WS-ENT-MTO-PASE         PIC S9(12) VALUE ZEROS.
           05  WS-IMP-TRX-L030A        PIC S9(12) VALUE ZEROS.
           05  VAR-CUO                 PIC 9(12).
           05  WS-VEZ                  PIC 9(01).
           05  VAR-INDCAPINTC          PIC X(01)   VALUE SPACES.
           05  WS-IMPBONIF-SIN           PIC 9(15)V99 VALUE ZEROS.
           05  WS-FECHA-AMD-VCTO       PIC X(10).
           05  WS-TAB-CARENCIA.
               10  WS-TABLA-CARENCIA OCCURS 100 TIMES.
                   15 WS-FECCAREN.
                      20 WS-CAREN-AAAA PIC X(04).
                      20 FILLER       PIC X.  
                      20 WS-CAREN-MM   PIC X(02).
                      20 FILLER       PIC X.
                      20 WS-CAREN-DD   PIC X(02).           
           05  WS-FECHA-A-M-D          PIC X(10).
           05  WS-FECHA-A-M-DR REDEFINES WS-FECHA-A-M-D.
               10 WS-FECHA-AMD-ANO     PIC 9(04).
               10 WS-FECHA-AMD-GUION1  PIC X.
               10 WS-FECHA-AMD-MES     PIC 99.
               10 WS-FECHA-AMD-GUION2  PIC X.
               10 WS-FECHA-AMD-DIA     PIC 99.
           05  WS-ANO-CARE             PIC 9(04).
           05  WS-SIMULACION           PIC X(01) VALUE SPACES.
           05  W-E                     PIC 9(03) VALUE ZEROS.
           05  W-P                     PIC 9(03) VALUE ZEROS.
           05  W-C                     PIC 9(03) VALUE ZEROS.
           05  W-F                     PIC 9(03) VALUE ZEROS.
           05  CANT-TAB                PIC 9(03) VALUE ZEROS.
           05  CANT-CUOTAS             PIC 9(03) VALUE ZEROS.
           05  WS-MONTO-TERCIO         PIC 9(10) VALUE ZEROS.
           05  WS-MONTO-TOTAL          PIC 9(10) VALUE ZEROS.
           05  WS-ITE                  PIC 9(12)V99.         
           05  WS-VTO-CUOTA            PIC X(10).
           05  WOE-TASA_EFECTIVA       PIC 999,9999.
           05  WOE-TASA_COMERCIAL      PIC 999,9999.
           05  WOE-TASA_CARENCIA       PIC 999,9999.
           05  WOE-G1                  PIC 999,9999.
           05  WOE-G2                  PIC 9(08).
           05  WOE-G3                  PIC 9(08).
           05  WOS-TASA_EFECTIVA       PIC X(08).
           05  WOS-TASA_COMERCIAL      PIC X(08).
           05  WOS-TASA_CARENCIA       PIC X(08).
           05  WOS-G1                  PIC X(08).
           05  WOS-G2                  PIC X(08).
           05  WOS-G3                  PIC X(08).
           05  WS-CODENT-ADQ           PIC 9(04).
           05  WS-COD-ID-ADQ           PIC 9(11).
           05  WS-IO                   PIC 9(02) VALUE 0.
           05  WS-INDDEBCRE            PIC 9(01) VALUE 1.
           05  WS-SWITCH-MARCA-TIPO    PIC 9(01) VALUE 0.
           05  WS-ENCONTRO-OPERATIVIDAD PIC X(01) VALUE SPACES.
           05  WS-ARREGLO-ARTICULOS-TASAS.
               10 WS-AAT                        PIC 9(02) VALUE 0.
               10 WSAAT-CANT-ARTICULOS          PIC 9(02).
               10 WSAAT-ARTICULOS-ENTRADA.
                  20 WSAAT-ARREGLO-ARTICULOS    OCCURS 40 TIMES.  
                     30 WSAAT-MONTO-CAPITAL     PIC 9(12)V9(02). 
                     30 WSAAT-COD-DEPTO         PIC X(05). 
                     30 WSAAT-COD-LINEA         PIC X(06). 
                     30 WSAAT-COD-ARTICULO      PIC 9(13).
SCT        05 WS-TASA_COMERCIAL  PIC 9(02)V9(04).    
SCT        05 WS-G1              PIC 9(02)V9(04).  
SCT        05 WS-TASA_CARENCIA   PIC 9(02)V9(04).  
SCT        05 WS-G2              PIC 9(08).   
SCT        05 WS-GRUPO-COMISION  PIC X(05).   
SCT        05 WS-IND-PLAZO       PIC X(01).
SCT        05 SW-ERROR-DISPONIBLE PIC X(01).     
SCT        05 WS-IMPCUOTA        PIC 9(15)V9(02).
           05 WS-IMPTOTAL        PIC 9(15)V9(02).
SCT        05 WS-NUM-CUOTA       PIC 9(02) VALUE 0.
SCT   *     05 WS-IMPTOTAL        PIC 9(12)V99.
SCT        05 WS-IMPUESTO        PIC  9(12)V99.

           05  WS-COMISION-ONLINE         PIC 9(15)V99 VALUE ZEROS.
           05  WS-COMISION                PIC 9(15)V99 VALUE ZEROS.
      *     05  WS-COMISION-CUO            PIC 9(15)V99 VALUE ZEROS.
           05  WS-ATPLANFI-IMP-CAPITAL    PIC S9(15)V99.


                     
AS0812     05  WS-CTO-TOTAL       PIC 9(12)V99.
AS0812     05  WS-IMPTO-CRED      PIC 9(12)V9(04). 
AS0812     05  WS-PLAZO           PIC 9(04).             
AS0812     05  SF-NUM-CUO         PIC 9(02)V9(04).
AS0812     05  SF-MTO-CAP         PIC 9(12)V9(04).
AS0812     05  SF-MTO-CUO         PIC 9(12)V9(02).
           05  WS-INICIO                 PIC 9(04)   VALUE ZEROS.

       01  CT-CONSTANTES.
           05  CT-INTERES         PIC X(10) VALUE 'CT-INTERES'.
           05  CT-TIPO-INTERES    PIC X(15) VALUE 'CT-TIPO-INTERES'.
AS0812     05  CT-VALOR-30             PIC 9(02) VALUE 30.
RDC        05  CT-VALOR-90             PIC 9(03) VALUE 90.
AS0812     05  CT-VALOR-100            PIC 9(03) VALUE 100.
           05  CT-LARGO-FIJO           PIC 9(03) VALUE 605.
           05  CT-38                   PIC 9(02) VALUE 38.
           05  CT-3                    PIC 9     VALUE 3.
           05  CT-14                   PIC 9(02) VALUE 14.
           05  CT-COD-MENSAJE          PIC 9(04).
               88 CODIGO-MENSAJE                 VALUE 1100,
                                                       1200,
                                                       1300,
                                                       1120,
                                                       1220,
                                                       1420,
                                                       1220,
                                                       1224,
                                                       1320,
                                                       1520,
                                                       1800.
           05  CT-SERVICIO             PIC X(11) VALUE "SFISERS610C".
SCT        05  CT-SFISERS470C          PIC X(11) VALUE "SFISERS470C".                      
           05  CT-SFISERSERR           PIC X(10) VALUE "SFISERSERR".
           05  CT-APLICACION           PIC X(02) VALUE "MP".
MLG
MLG        05  WX-COMERCIO             PIC X(15) VALUE 
MLG 		                           "000000000000001".
MLG        05  WX-SUCURSAL             PIC X(04) VALUE "0100".
MLG        05  CT-ATPC049              PIC X(07) VALUE "ATPC049".           
MLG        05  CT-ATPC053              PIC X(07) VALUE "ATPC053". 
MLG        05  CT-E                    PIC X(01) VALUE "E". 
MLG        05  WS-IND                  PIC 9(03) VALUE ZEROS.
MLG        05  CT-100                  PIC 9(03) VALUE 100.
MLG        05  CT-MQCOPY-CORRECTO      PIC X(02) VALUE "00".
MLG        05  CT-MQCOPY-INFOR         PIC X(02) VALUE "10".
MLG        05  CT-ERROR-53             PIC X(70) VALUE
MLG            "ERROR EN SERVICIO ATPC053                         ".
MLG        05  CT-ERROR-49             PIC X(70) VALUE
MLG            "ERROR EN SERVICIO ATPC049                         ".
MLG
           
           05  CT-ATD405               PIC X(07) VALUE "ATD405 ".
           05  CT-ATE470               PIC X(07) VALUE "ATE470 ".
           05  CT-ISER070              PIC X(07) VALUE "ISER070".
           05  CT-ISER310              PIC X(07) VALUE "ISER310".
RDC        05  CT-ISER311              PIC X(07) VALUE "ISER311".
           05  CT-ATD544               PIC X(07) VALUE "ATD544 ".

           05  CT-ATD466               PIC X(07) VALUE "ATD466 ".

      *     05  CT-ATPC021              PIC X(07) VALUE "ATPC021".
           05  CT-ATPC025              PIC X(07) VALUE "ATPC025".
           05  CT-ATPC042              PIC X(07) VALUE "ATPC042".
           05  CT-ATPC043              PIC X(07) VALUE "ATPC043".
      *     05  CT-ATPC044              PIC X(07) VALUE "ATPC044".
           05  CT-ATPC201              PIC X(07) VALUE "ATPC201".
           05  CT-ATE568               PIC X(07) VALUE "ATE568 ".
           05  CT-ATR022               PIC X(07) VALUE "ATR022 ".
           05  CT-ATR056               PIC X(07) VALUE "ATR056 ".
           05  CT-ATR069               PIC X(07) VALUE "ATR069 ".
           05  CT-ATR034               PIC X(07) VALUE "ATR034 ".
           05  CT-ATR610               PIC X(07) VALUE "ATR610 ".
           05  CT-ATR740               PIC X(08) VALUE "ATR740 ".
           05  CT-ATPC085              PIC X(07) VALUE "ATPC085".
           05  CT-ATE856               PIC X(07) VALUE "ATE856 ".                      
           05  CT-PL-BOPERS            PIC X(22) VALUE  SPACES.
           05  CT-ATR524               PIC X(07) VALUE "ATR524 ".
           05  CT-ATR545               PIC X(08) VALUE "ATR545 ".
           05  CT-ATE950               PIC X(07) VALUE "ATE950 ".
           05  CT-ISER325              PIC X(07) VALUE "ISER325".
           05  CT-ISER413              PIC X(07) VALUE "ISER413". 
           05  CT-ATR100               PIC X(07) VALUE "ATR100 ".
           05  CT-ATR541               PIC X(07) VALUE "ATR541 ".
           05  CT-ATR543               PIC X(07) VALUE "ATR543 ".
           05  CT-PL-CANALES           PIC X(22) VALUE 
                                       "BOTGEN_PRC_ENC_PAR_DOM".
           05  CT-PL-TASAS             PIC X(22) VALUE 
                                       "SFTASA_PRC_TSA".
           05  CT-RUTINA               PIC X(11) VALUE
                                       "SFISERS610C".
           05  CT-TABLA-CAG-SVC        PIC X(20) VALUE
                                       "SFISER_MAE_CAG_SVC".
           05  CT-MP                   PIC X(24) VALUE
                                                  "NOMBRE DE LA BD".
           05  CT-CODIGO-SERVICIO      PIC X(04) VALUE "0034".
           05  CT-OPEN                 PIC X(09) VALUE "OPEN  ".
           05  CT-FETCH                PIC X(09) VALUE "FECTH ".
           05  CT-CLOSE                PIC X(09) VALUE "CLOSE ".
           05  CT-UPDATE               PIC X(06) VALUE "UPDATE".
           05  CT-VALOR-MAS            PIC X(01) VALUE '/'.
           05  CT-VALOR-FIN            PIC X(01) VALUE '@'.
           05  CT-TABLA-LOG            PIC X(18) VALUE 
                                       "SFISER_LOG_RTI_SAT".
           05  CT-EXECUTE              PIC X(07) VALUE "EXECUTE".
           05  CT-SELECCION            PIC X(06) VALUE "SELECT".
           05  CT-INSERTAR             PIC X(06) VALUE "INSERT".
           05  CT-ERROR-DB2            PIC 9(10) VALUE 30.
           05  CT-CORRECTO-COMMIT      PIC 9(10) VALUE ZEROS.
           05  CT-INFOR-COMMIT         PIC 9(10) VALUE 10.
           05  CT-ROLLBACK             PIC 9(10) VALUE 40.
           05  CT-CORRECTO             PIC X(02) VALUE "00".
           05  CT-CORRECTO-OK          PIC 9(02) VALUE ZEROES.
           05  CT-INFOR-BD             PIC 9(02) VALUE 02.
SCT        05  CT-INFOR-OK             PIC 9(10)  VALUE 10.           
           05  CT-CORRECTO-AUTORIZ     PIC X(04) VALUE "0000".
           05  CT-INFOR                PIC X(02) VALUE "10". 
           05  CT-AVISO                PIC X(02) VALUE "20". 
           05  CT-ERROR                PIC X(04) VALUE "0020".
           05  CT-SI                   PIC X(01) VALUE "S".
           05  CT-D                    PIC X(01) VALUE 'D'.
           05  CT-LARGO-MENSAJE        PIC 9(04) VALUE 3000.
           05  CT-ERROR-3              PIC X(07) VALUE 'MPE0003'.
           05  CT-ERROR-4              PIC X(07) VALUE 'MPE0004'.
           05  CT-ERROR-6              PIC X(07) VALUE 'MPE0006'.
           05  CT-ERROR-7              PIC X(07) VALUE 'MPE0007'.
           05  CT-ERROR-8              PIC X(07) VALUE 'MPE0008'.
           05  CT-ERROR-CC             PIC 9(10) VALUE 810.
           05  CT-LARGO-MENSAJE-20     PIC 9(04) VALUE 34.
           05  CT-LARGO-MENSAJE-10     PIC 9(04) VALUE 70.
           05  CT-LARGO-MENSAJE-30     PIC 9(04) VALUE 34.
           05  CT-LARGO-MENSAJE-60     PIC 9(04) VALUE 60.
           05  CT-LARGO-MENSAJE-80     PIC 9(04) VALUE 80.
           05  CT-LARGO-MENSAJE-90     PIC 9(04) VALUE 90.
           05  CT-LARGO-MENSAJE-102    PIC 9(04) VALUE 50.
           05  CT-LARGO-MENSAJE-103    PIC 9(04) VALUE 30.
           05  CT-ERROR803-DESC        PIC X(30) VALUE
               "CODIGO DE MENSAJE INVALIDO    ".
           05  CT-ERROR802-DESC        PIC X(50) VALUE
           "ERROR EN AUTORIZADOR - TASAS PARA FINANCIAMIENTO  ".
           05  CT-ERROR60-DESC         PIC X(100) VALUE
           "PROBLEMA DE BD (OPEN, FETCH, CLOSE, SELECT) MODELO SFISER".
           05  CT-ERROR20-DESC         PIC X(34) VALUE 
           "RUTINA INACTIVA DE USO OBLIGATORIO". 
           05  CT-ERROR30-DESC         PIC X(34) VALUE
           "RESPUESTA DEL SERVICIO CON ERROR  ".
           05  CT-AVISO-CUENTA         PIC X(70) 
               VALUE "EL CAMPO CUENTA ES OBLIGATORIO              ".
           05  CT-AVISO-USUARIO        PIC X(70) 
               VALUE "EL CAMPO USUARIO ES OBLIGATORIO             ".
           05  CT-AVISO-CENTALTA       PIC X(70) 
               VALUE "EL CAMPO CENTRO DE ALTA ES OBLIGATORIO      ".
           05  CT-AVISO-CODENT         PIC X(70) 
               VALUE "EL CAMPO ENTIDAD ES OBLIGATORIO             ".
           05  CT-AVISO-NO-EXISTE      PIC X(100) VALUE
               "EL REGISTRO NO EXISTE EN LA BD".
           05  CT-AVISO-FECHA          PIC X(34) VALUE
               "ERROR EN EL CAMPO FECHA ".
           05  CT-AVISO-COD-MSJ        PIC X(34) VALUE
               "ERROR EN EL CAMPO CODIGO MENSAJE ".
           05  CT-AVISO-COD-PROCESO    PIC X(34) VALUE
               "ERROR EN EL CAMPO CODIGO PROCESO ".
           05  CT-AVISO-PAIS           PIC X(34) VALUE
               "ERROR EN EL CAMPO PAIS ".
           05  CT-AVISO-TERMINAL       PIC X(34) VALUE
               "ERROR EN EL CAMPO TERMINAL ".
           05  CT-AVISO-IDEN-MSJ       PIC X(44) VALUE
               "ERROR EN EL CAMPO IDENTIFICACION MENSAJE ".
           05  CT-AVISO-SIA            PIC X(34) VALUE
               "ERROR EN EL CAMPO SIA        ".
           05  CT-AVISO-PAN            PIC X(34) VALUE
               "ERROR EN EL CAMPO PAN        ".
           05  CT-AVISO-COD-TRX        PIC X(34) VALUE
               "ERROR EN EL CAMPO CODIGO TRX ".
           05  CT-AVISO-TIPO-TRX       PIC X(34) VALUE
               "ERROR EN EL CAMPO TIPO TRX ".
           05  CT-AVISO-BLOQ-SIT       PIC X(34) VALUE
               "ERROR EN SITUACION DE BLOQUE ".
           05  CT-AVISO-LINEA-CRE      PIC X(34) VALUE
               "ERROR EN LINEA DE CREDITO    ".
           05  CT-AVISO-PRODUCTO       PIC X(70) VALUE
               "CODIGO PRODUCTO DEBE VENIR INFORMADO              ".
           05  CT-AVISO-SUBPRODU       PIC X(70) VALUE
               "CODIGO SUBPRODUCTO DEBE VENIR INFORMADO           ".
           05  CT-AVISO-MARCA          PIC X(70) VALUE
               "MARCA TARJETA DEBE VENIR INFORMADO                ".
           05  CT-AVISO-TIPO           PIC X(70) VALUE
               "TIPO  TARJETA DEBE VENIR INFORMADO                ".
           05  CT-AVISO-GRUPOLIQ       PIC X(70) VALUE
               "GRUPO LIQUIDACION  DEBE VENIR INFORMADO           ".
           05  CT-AVISO-LINEA          PIC X(70) VALUE
               "CODIGO LINEA  DEBE VENIR INFORMADO                ".
           05  CT-AVISO-CARENCIA       PIC X(70) VALUE
               "VALOR CAMPO MESES CARENCIA DEBE SER ENTRE 0 Y 12  ".

           05  CT-AVISO-COD-MONEDA     PIC X(70) VALUE
               "CODIGO MONEDA DEBE VENIR INFORMADO                ".
           05  CT-AVISO-IMP-TRX        PIC X(70) VALUE
               "IMPORTE  DEBE VENIR INFORMADO                     ".
           05  CT-ERROR-TIPO-CC        PIC X(70) VALUE 
               "ERROR AL CALCULAR TIPO DE COMPRA EN CUOTA         ".
           05  CT-ERROR-NC             PIC X(70) VALUE 
               "ERROR, NO EXISTEN CUOTAS PARA SIMULACION          ".
           05  CT-AVISO-CONT-PAN       PIC X(70) VALUE
               "ERROR - DEBE INGRESAR PAN O CONTRATO              ".
           05  CT-ERROR-TC               PIC X(50)   VALUE
               "No encontro tipo compra en cuotas         ".
           05  CT-ERROR-VC               PIC X(50)   VALUE
               "Error en c�lculo valor cuota.             ".
               
           05  CT-BLANCOS              PIC X(30) VALUE SPACES.
           05  CT-TIPO-COMPRA          PIC 9(02) VALUE ZEROES.
           05  CT-SAT1                 PIC X(03) VALUE "SAT".
           05  CT-P                    PIC X(01) VALUE "P".
           05  CT-I014                 PIC X(04) VALUE "0000".
           05  CT-I018                 PIC X(04) VALUE "0000".
           05  CT-I059                 PIC X(40) VALUE SPACES.
           05  CT-6                    PIC 9(01) VALUE 6.
           05  CT-5                    PIC 9(01) VALUE 5.
           05  CT-I048-LONG            PIC X(03) VALUE "135".
           05  CT-I039                 PIC 9(03) VALUE ZEROES.
           05  CT-I064                 PIC X(08) VALUE SPACES.
           05  CT-01                   PIC 9(04) VALUE 1.
           05  CT-0                    PIC 9(01) VALUE 0.
           05  CT-N                    PIC X(01) VALUE "N".
           05  CT-S                    PIC X(01) VALUE "S".
           05  CT-115                  PIC 9(04) VALUE 115.
           05  CT-ZEROS                PIC 9(10) VALUE ZEROS.
           05  CT-FECHA-NULA           PIC X(10) VALUE "0001-01-01".
           05  CT-BD-TASAS             PIC X(12) VALUE "SFTASA".
           05  CT-8                    PIC 9(01) VALUE 8.
           05  CT-CODPRO-LIQ           PIC 9(02) VALUE 01.
           05  CT-PRIMER-VTO           PIC X(01) VALUE "V".
      *LRO-TECNOCOM-DESFASE-INI                      
           05  CT-PRIMER-VTO-DES       PIC X(01) VALUE "W".
      *LRO-TECNOCOM-DESFASE-INI                      
           05  CT-COD-RESPUESTA-OK     PIC X(02) VALUE "00".
           05  CT-TIPO-CC-0001         PIC X(04) VALUE "0001".  
           05  CT-U                    PIC X(01) VALUE "U".  
           05  CT-LARGO-PAN            PIC X(02) VALUE "19".  
           05  CT-132                  PIC 9(03) VALUE 132.
           05  CT-05                   PIC X(02) VALUE "05". 
           05  CT-03                   PIC X(02) VALUE "03".    
           05  CT-FINAL                PIC X(01) VALUE "@".
           05  CT-TOPE-ATE568          PIC 9(03) VALUE 100. 
           05  CT-ERROR100-DESC        PIC X(40) VALUE
               "NO SE HA ESTABLECIDO UN TIPO DE FACTURA ".
           05  CT-NO                   PIC XX VALUE "NO".
      *ADDSYSTEM0001-I
           05  CT-ESPACIOS             PIC X(01)   VALUE SPACES.
           05  CT-ZEROES               PIC 9(02)   VALUE 0.
           05  CT-CERO                 PIC X(01)   VALUE '0'.
           05  CT-ONLINE               PIC X(01)   VALUE 'O'.
           05  CT-1                    PIC 9(01)   VALUE 1.
           05  CT-2                    PIC 9(01)   VALUE 2.
           05  CT-152                  PIC 9(03)   VALUE 152.
           05  CT-11                   PIC 9(02)   VALUE 11.
PRCF       05  CT-0088                 PIC X(04)   VALUE "0088".
PRCF       05  CT-0050                 PIC X(04)   VALUE "0050".                      
           05  CT-3000                 PIC 9(04)   VALUE 3000.
           05  CT-110                  PIC 9(04)   VALUE 110.
           05  CT-20                   PIC 9(02)   VALUE 20.
           05  CT-62                   PIC 9(02)   VALUE 62.
           05  CT-798                  PIC 9(03)   VALUE 798.
           05  CT-801                  PIC 9(03)   VALUE 801.
           05  CT-805                  PIC 9(03)   VALUE 805.
           05  CT-831                  PIC 9(03)   VALUE 831.
           05  CT-BYTEI                PIC X(05)   VALUE "BYTEI".
           05  CT-BYTEF                PIC X(05)   VALUE "BYTEF".
           05  CT-0110                 PIC X(04)   VALUE "0110".
           05  CT-0210                 PIC X(04)   VALUE "0210".
           05  CT-00800                PIC X(05)   VALUE "00800".
           05  CT-00831                PIC X(05)   VALUE "00831".
           05  CT-ERROR30-INDBLQOPE    PIC X(70)   VALUE
                  "CONTRATO BLOQUEADO POR OPERATIVIDAD".
           05  CT-CUOTIZADA            PIC 9(01)   VALUE 1.
      *ADDSYSTEM0001-F
  
      *==> ADDSYSTEM 09/05/2011 FVC-I     

           05  CT-LINEA                PIC  X(04)  VALUE SPACES.
           05  CT-ATPC029              PIC  X(07)  VALUE "ATPC029".
           05  CT-0000                 PIC  X(04)   VALUE "0000".

           05  CT-NOSIGUE              PIC  X(01)   VALUE '@'.
           05  CT-ERROR-PRODUCTOS      PIC X(70)  VALUE
               "ENTIDAD NO REGISTRA PRODUCTOS ASOCIADOS       ".
           05  CT-ERROR-BUSCAR-PROD    PIC X(70) VALUE
               "ERROR AL BUSCAR PRODUCTO-SUBPRODUCTO  ".
           05  CT-ERROR-BUSCAR-LINEA   PIC X(70) VALUE
               "LINEA NO VALIDA PARA EL CONTRATO ".
RDC        05  CT-ERROR-NRO-CUOTAS     PIC X(70) VALUE
RDC            "NRO DE CUOTAS DEBE SER IGUAL A 1 ".
           05  CT-ERROR-BUSCAR-TIPOCC  PIC X(70) VALUE
               "ERROR AL BUSCAR CODIGO TIPO COMPRA EN CUOTA ".
           05  CT-ERROR-DPF              PIC X(50)   VALUE
               "Error en desarrollo plan de financiación  ".

AS0812     05  CT-IMPTO-CRED      PIC 9(01)V9(04) VALUE 0,0005.
AS0812     05  CT-NUM-CUO-MAX     PIC 9(02) VALUE 12.
			   
      *==> ADDSYSTEM 09/05/2011 FVC-F  


      *+-----------------------------------------------------------+
      *                     SWITCHES DEL PROGRAMA
      *+-----------------------------------------------------------+
       01  WS-SWITCH                   PIC  9(01)    VALUE ZEROS.
       01  SW-TIPO-COMPRA              PIC  9(01).
           88  REVOLVING                             VALUE 0.
           88  COMPRA-EN-CUOTA                       VALUE 1 THRU 99.

       01  SW-ENCONTRO-LINEA           PIC  X(01)    VALUE "N".
           88  SI-ENCONTRO-LINEA                     VALUE "S".
           88  NO-ENCONTRO-LINEA                     VALUE "N".

       01  WS-SWITCH-BOTGEN-ENC-PAR-DOM PIC 9(01) VALUE 0.           
       
       01  SW-FIN-CURSOR               PIC  X(01).
           88  SI-FIN-CURSOR                         VALUE "S".
           88  NO-FIN-CURSOR                         VALUE "N".

       01  SW-PERSONA-BLOQUEADA        PIC  X(01).
           88  SI-PERSONA-BLOQUEADA                  VALUE "S".
           88  NO-PERSONA-BLOQUEADA                  VALUE "N".

       01  SW-ENCONTRO-FECVEN           PIC X(01).
           88  SI-ENCONTRO-FECVEN    VALUE "S".
           88  NO-ENCONTRO-FECVEN    VALUE "N".

       01  SW-FIN-MPM0085               PIC X(01).
           88  SI-FIN-MPM0085   VALUE "S".
           88  NO-FIN-MPM0085   VALUE "N".

       01  SW-PASE-COMPRA              PIC X(01).
           88  SI-PASE-COMPRA                        VALUE "S".
           88  NO-PASE-COMPRA                        VALUE "N".


       01  SW-ERROR-TAB                PIC X(01).
           88  SI-ERROR                              VALUE "S".
           88  NO-ERROR                              VALUE "N".

       01  SW-CARGA-TABLAS             PIC X(01)     VALUE "S".
           88  SI-CARGA-TABLAS                       VALUE "S".
           88  NO-CARGA-TABLAS                       VALUE "N".
 
       01  SW-FIN-E                    PIC X(01).
           88  SI-FIN-E                              VALUE "S".
           88  NO-FIN-E                              VALUE "N".

       01  SW-FIN-P                    PIC X(01).
           88  SI-FIN-P                              VALUE "S".
           88  NO-FIN-P                              VALUE "N".

       01  SW-FIN-C                    PIC X(01).
           88  SI-FIN-C                              VALUE "S".
           88  NO-FIN-C                              VALUE "N".
       01  SW-IR                       PIC  X(01).
           88 SI-FIN-IR                       VALUE 'S'.
           88 NO-FIN-IR                       VALUE 'N'.

      *==> ADDSYSTEM 09/05/2011 FVC-I 

	   01  SW-ENCONTRO-DIF             PIC X(01).
           88 SI-ENCONTRO-DIF       VALUE "S".
           88 NO-ENCONTRO-DIF       VALUE "N".
		   
       01  SW-FIN-LINEA                 PIC X(01).
       	   88 SI-FIN-LINEA          VALUE "S".
           88 NO-FIN-LINEA          VALUE "N".		   

       01  SW-FIN-PROD                  PIC X(01).
           88 SI-FIN-PROD           VALUE "S".
       	   88 NO-FIN-PROD           VALUE "N".

       01  SW-ENCONTRO               PIC  X(01).
           88 SI-ENCONTRO                        VALUE 'S'.
           88 NO-ENCONTRO                        VALUE 'N'.

       01 SWLIGHT.
          05 SW-LIGHT                  PIC X(01).

PRCF   01 SWLIGHT-PASO.
PRCF      05 SW-LIGHT-PASO             PIC X(01) VALUE '0'.  
RDC       05 SW-0088                   PIC X(04) VALUE SPACES.          


       01  SW-ENCONTRO-CC              PIC  X(01).
           88  SI-ENCONTRO-CC                    VALUE "S".
           88  NO-ENCONTRO-CC                    VALUE "N".

      * Consulta de diferidos
       01  SW-PROCESAR-ATE568          PIC  X(01).
           88  SI-PROCESAR-ATE568                VALUE "S".
           88  NO-PROCESAR-ATE568                VALUE "N".

      * Calculo de desfase
       01  SW-PROCESAR-ISER325         PIC  X(01).
           88  SI-PROCESAR-ISER325               VALUE "S".
           88  NO-PROCESAR-ISER325               VALUE "N".
           
      * Consulta FECHAS DE LIQUIDACION, VENCIMIENTO,    *
      *    MESES DE CARENCIA O FECHA DE PRIMERA CUOTA TRAS CARENCIA     
       01  SW-PROCESAR-ATR541          PIC  X(01).
           88  SI-PROCESAR-ATR541                VALUE "S".
           88  NO-PROCESAR-ATR541                VALUE "N".

      * Consulta INFORMACION BASICA DE UN PARAMETRO
       01  SW-PROCESAR-ATR100         PIC  X(01).
           88  SI-PROCESAR-ATR100               VALUE "S".
           88  NO-PROCESAR-ATR100               VALUE "N".

      *==> ADDSYSTEM 09/05/2011 FVC-F
  
       01  WS-BLOQUEO-TARJETA          PIC 9(02)     VALUE 00.

       01  WS-SITUACION-TARJETA        PIC 9(02)     VALUE ZEROES.
       01  WS-ERROR-RIESGO             PIC 9(02)     VALUE ZEROES.
       01  WS-INDCREDITO               PIC 9(02)     VALUE ZEROES.
    
       01  TB-CANT-CUOTAS-ARR    PIC 9(02).
       01  TB-ARREGLO-CUOTAS.
           05 TB-TAB-CUOTAS      OCCURS 50 TIMES.
RDC           10 TB-NRO-CAREN    PIC 9(02).
              10 TB-NRO-CUOTA    PIC 9(02).
              10 TB-MTO-CUOTA    PIC 9(12)V99.
       
       01  TB-CANT-BOTGEN-ARR    PIC 9(02) VALUE ZEROES.              
       01  TB-ARREGLO-BOTGEN.
       	   05 TB-TAB-BOTGEN            OCCURS 50 TIMES.
              10 TB-TGMPA-COD-PAI            PIC  9(03).
              10 TB-TGMPA-GLS-PAI            PIC  X(60).
              10 TB-TGMMD-COD-MAC-DOM        PIC  9(05).
              10 TB-TGMMD-GLS-MAC-DOM        PIC  X(60).
              10 TB-TGMDO-COD-DOM            PIC  9(04).
              10 TB-TGMDO-COC-DOM            PIC  X(04).
              10 TB-TGMDO-GLS-DOM            PIC  X(80).
              10 TB-TGMDO-MRC-VIG            PIC  X(01).
           
      *+-----------------------------------------------------------+
      *        COPY DE ENTRADA Y SALIDA RUTINAS SAT
      *+-----------------------------------------------------------+

       01  WS-ENTRADA.
           05  WS-CODENT                    PIC X(04).
           05  WS-TIPFRAN                   PIC 9(04).
           05  WS-TIPFRAN-ALF REDEFINES WS-TIPFRAN PIC X(04).
           05  WS-TIPOMSGON                 PIC X(04).
           05  WS-CODPROON                  PIC 9(06).
           05  WS-CODPROON-ALF REDEFINES WS-CODPROON PIC X(06).
           05  WS-CAMPO1                    PIC X(15).
           05  WS-CAMPO2                    PIC X(15).
           05  WS-CAMPO3                    PIC X(15).
           05  WS-CAMPO4                    PIC X(15).
           05  WS-CAMPO5                    PIC X(15).
           05  WS-CAMPO6                    PIC X(15).
           05  WS-CAMPO7                    PIC X(15).
           05  WS-CAMPO8                    PIC X(15).
           05  WS-CAMPO9                    PIC X(15).
           05  WS-CAMPO10                   PIC X(15).
           05  WS-CAMPO11                   PIC X(15).
           05  FILLER                       PIC X(1862).

       01  WS-SALIDA.
           05  WS-TIPO-FAC-SAL              PIC 9(04).
           05  WS-INDNORCOR                 PIC 9(01).
           
      *==> ADDSYSTEM 09/05/2011 FVC-I 
      *+-----------------------------------------------------------*
      * TABLA MEMORIA PRODUCTOS-LINEA-DIFERIDOS
      *-------------------------------------------------------------
       01  TABLA-PRODUCTOS.
           05 TB-CANTPROD           PIC 9(02).
           05 TAB-PRODUCTOS OCCURS 100 TIMES.
               10 TB-PRODUCTO       PIC X(02).
               10 TB-SUBPRODU       PIC X(04).
               10 TB-CANTLIN        PIC 9(02).
               10 TAB-LINEAS OCCURS 20 TIMES.
                  15 TB-LINEA       PIC X(04).
                  15 TB-LIMMAXDIA   PIC S9(10)V99.
                  15 TB-CANTCC      PIC 9(02).
                  15 TAB-CCUOTAS OCCURS 20 TIMES.
                    20 TB-CODTIPC     PIC X(04).
                    20 TB-MTOMIN      PIC S9(10)V99.
                    20 TB-MTOMAX      PIC S9(10)V99.
                    20 TB-PZOMIN      PIC 99.
                    20 TB-PZOMAX      PIC 99.
                    20 TB-CANTDIF     PIC 99.
RDC                 20 TAB-DIFERIDOS OCCURS 300 TIMES.
                       25 TB-CANMESDIF PIC 99.
                     
RDC   * 01 TABLA-DIFERIDOS.
RDC   *    05 TAB-DIFERIDOS  OCCURS 10 TIMES.
RDC   *       10 TB-CANTMESDIF      PIC 99.

      *==> ADDSYSTEM 09/05/2011 FVC-F
  
  SCT    01 TABLA-TASAS.
          05 TAB-TASAS  OCCURS 10 TIMES.
             10 TB-NUM-CUOTAS      PIC 99.
             10 TB-TASA_COMERCIAL  PIC 9(02)V9(04).    
             10 TB-G1              PIC 9(02)V9(04).  
             10 TB-TASA_CARENCIA   PIC 9(02)V9(04).  
             10 TB-G2              PIC 9(08).   
             10 TB-GRUPO-COMISION  PIC X(05).   
             10 TB-IND-PLAZO       PIC X(01).

      *+-----------------------------------------------------------+
      *        COPY LIBRERIA SERVICIO AUTORIZADOR COMPUESTO
      *+-----------------------------------------------------------+
               COPY "LIB611C".
      *+-----------------------------------------------------------+
      *        COPY 
      *+-----------------------------------------------------------+
       01  WS-LIB325R.
           COPY LIB325R.
      *+-----------------------------------------------------------+
      *        COPY LIBRERIA SERVICIO: GENERA DESARROLLO CREDITO
      *+-----------------------------------------------------------+
       01  WS-LIB470C.
           COPY LIB470C.             
      *+-----------------------------------------------------------+
      *        COPY  SERVICIO CONSULTA PRODUCTOS X ENTIDAD
      *+-----------------------------------------------------------+
       01  WS-MPML043.
           COPY "MPML043".
      *+-----------------------------------------------------------+
      *        COPY 
      *+-----------------------------------------------------------+
       01  WS-MPM0473.
           COPY "MPM0473".           
      *+-----------------------------------------------------------+
      *        COPY 
      *+-----------------------------------------------------------+
       01  WS-MPM0201.
           COPY "MPM0201".
      *+-----------------------------------------------------------+
      *        COPY DE ENTRADA DATOS POR PAN
      *+-----------------------------------------------------------+
      *01  WS-MPM0405.
      *    COPY "MPM0405".
      *+-----------------------------------------------------------+
      *        COPY CONSULTA CONTRATO 
      *+-----------------------------------------------------------+
       01  WS-LIB070R.
           COPY "LIB070R".
      *+-----------------------------------------------------------+
      *        COPY CONSULTA CONTRATO DE TARJETA
      *+-----------------------------------------------------------+
       01  WS-ATDATTAS.
           COPY "ATDATTAS".
      *+-----------------------------------------------------------+
      *        COPY DE ENTRADA DATOS POR PAN
      *+-----------------------------------------------------------+
       01  WS-MPM0085.
           COPY "MPM0085".
      *+-----------------------------------------------------------+
      *    COPY SERVICIO COMPUESTO CALCULO DE CAE
      *+-----------------------------------------------------------+
       01  WS-LIB413R.
           COPY "LIB413R".
      *+-----------------------------------------------------------+

RDC   *+---------------------------------------------------------------+
      *  COPY RUTINA DE PARAMETROS DEL CORE SAT (MPDT099)
      *+---------------------------------------------------------------+
       01  WS-ATRUTPAR.
           COPY ATRUTPAR.

      * -------------------------------------------------------------*
      *   COPY  DE CALCULO DEL PLAN DE FINANCIACION                  *
      * -------------------------------------------------------------*
       01  WS-ATCUOTAS.
           COPY ATCUOTAS.
      
MLG   *+-----------------------------------------------------------+
MLG   *        COPY SERVICIO INDICADOR RIESGO             
MLG   *+-----------------------------------------------------------+
MLG    01  WS-MPML049.
MLG        COPY "MPML049". 
MLG    01  WS-MPM0053.
MLG        COPY "MPM0053".	      
      *        COPY SIMULACION ALTA EN CUOTA 
      *+-----------------------------------------------------------+
       01  WS-MPM0544.
           COPY "MPM0544".
      *+-----------------------------------------------------------+
      *        COPY DE ENTRADA PARA AUTORIZACION
      *+-----------------------------------------------------------+
       01  WS-MPM0751.
           COPY "MPM0751".
      *+-----------------------------------------------------------+
      *        COPY DE ENTRADA PRIMER VENCIMIENTO
      *+-----------------------------------------------------------+
       01  WS-ATVTODIF.
           COPY "ATVTODIF".
      *+-----------------------------------------------------------+
      *        COPY 
      *+-----------------------------------------------------------+
       01  WS-ATPLANFI.
            COPY  ATPLANFI.
RDC   *+---------------------------------------------------------------+
      *  COPY RUTINA IMPUESTO ITE
      *+---------------------------------------------------------------+
       01 WS-ATRUTITE.
           COPY ATRUTITE.

      *+-----------------------------------------------------------+
      *        COPY PARA OBTENER LINEA A PARTIR DEL TIPO DE FACTURA
      *+-----------------------------------------------------------+
       01  WS-LIB310R.
            COPY LIB310R.
RDC    01  WS-LIB311R.
RDC         COPY LIB311R.
      *+-----------------------------------------------------------+
      *       COPY PARA OBTENER TIPO COMPRA EN CUOTA A PARTIR DE FAC
      *+-----------------------------------------------------------
       01  WS-ATRUTTCC.
            COPY ATRUTTCC.
            
      *+-----------------------------------------------------------+
      *        COPYS DE LAS TABLAS CORPORATIVAS
      *+-----------------------------------------------------------+
       01  WS-TBSQLERR.
           COPY "ATSQLERR".

      *+-----------------------------------------------------------+
      *        COPY DE RUTINAS MQCOPY
      *+-----------------------------------------------------------+
       01  WS-MQCOPY.
           COPY "ATCMQCOP".
       01  WS-ATUSCOM.
           COPY "ATUSCOM".
      *+-----------------------------------------------------------+
      *        COPY DE CONSULTA COMERCIOS
      *+-----------------------------------------------------------+
       01  WS-MPM0856.
           COPY "MPM0856".
      *+-----------------------------------------------------------+
      *        COPY DE CONSULTA MARCA-TIPO
      *+-----------------------------------------------------------+
       01  WS-MPM0025.
           COPY "MPM0025".
      *+-----------------------------------------------------------+
      *        COPY DE LIBRERIA ERRORES LIBERR
      *------------------------------------------------------------+
       01  WS-LIBERR.
           COPY "LIBERR".

      *==> ADDSYSTEM 09/05/2011 FVC-I
      *+-----------------------------------------------------------+
      *        COPY SERVICIO CONSULTA LINEAS POR CONTRATO
      *+-----------------------------------------------------------+
       01  WS-MPM0556.
           COPY "MPM0556".
   
      *+-----------------------------------------------------------+
      *        COPY SERVICIO CONSULTA LINEAS
      *+-----------------------------------------------------------+
       01  WS-MPM0029.
           COPY "MPM0029".
       01  WS-MPML029.
           COPY "MPML029".


       01  WS-MONDEC.
           COPY "ATMONDEC".
       01  WS-ATVTOCAR.
           COPY "ATVTOCAR".

       01  WS-ATRUTCAM.
           COPY "ATRUTCAM".

      *+-----------------------------------------------------------+
      *        COPY CALCULO DE COMISIONES
      *+-----------------------------------------------------------+
       01  WS-ATRUTCOM.
           COPY "ATRUTCOM".

       01  WS-ATVALTOP.
           COPY "ATVALTOP".

       01  WS-MPM0466.
           COPY "MPM0466".

           COPY "ATPC021-WS.cpy".
           COPY "ATPC044-WS.cpy".
           COPY "ATPC052-WS.cpy".
           COPY "ATPC059-WS.cpy".

   
      *==> ADDSYSTEM 09/05/2011 FVC-F
  
           EXEC SQL BEGIN DECLARE SECTION END-EXEC.

      *--------------------------------------------------------------
      *       DEFINICIONES ADICIONALES DEL PROGRAMA
      *--------------------------------------------------------------
       01  SW-LOGGEA-SERVICIO          PIC  X(01).
           88  SI-LOGGEA-SERVICIO                    VALUE "S".
           88  NO-LOGGEA-SERVICIO                    VALUE "N".
           88  SI-LOGGEA-ENTSAL                      VALUE "R".
           88  SI-LOGGEA-ERROR                       VALUE "E".
       01  FECHCOM                 PIC 9(08).

       01  FECHCOMR REDEFINES FECHCOM.
               10 WS-FEC-COM-AAAA      PIC 9999.
               10 WS-FEC-COM-MM        PIC 99.
               10 WS-FEC-COM-DD        PIC 99.

       01  FECHVTO                 PIC 9(08).

       01  FECHVTOR REDEFINES FECHVTO.
               10 WS-FEC-VTO-AAAA      PIC 9999.
               10 WS-FEC-VTO-MM        PIC 99.
               10 WS-FEC-VTO-DD        PIC 99.

       01  DIASDESFASE                         PIC  9(3) VALUE ZEROES.

       01  WO-AC.
           05  WO-ISPUS_COD_RTI                PIC 9(04).
           05  WO-ISPUS_SWT_USO                PIC X(01).
           05  WO-ISMCR_NOM_RTI                PIC X(07).
           05  WO-ISMCS_COD_SRV                PIC X(04).
           05  WO-ISLRS_COD_RTI                PIC 9(04).

           05  WO-ENTSAL-TASAS.
             08 WO-ENT-TASAS.                  
               10  WO-IDENTIFICADOR            PIC 9(16).
               10  WO-PAIS                     PIC 9(03).
new            10  WO-CONTRATO                 PIC X(20).
               10  WO-OPERACION                PIC 9(04).
               10  WO-FECHA-OPERACION          PIC 9(08).
               10  WO-HORA-OPERACION           PIC 9(06).
               10  WO-FECHA-TRANSACCION        PIC 9(08).
               10  WO-HORA-TRANSACCION         PIC 9(06).
               10  WO-ENTIDAD                  PIC X(04).
               10  WO-PRODUCTO-SUBP            PIC X(06).
               10  WO-MARCA-TIPO               PIC 9(04).
new            10  WO-COD-TRX                  PIC 9(04).
      *        10  WO-LINEA-CREDITO            PIC X(04).
      *        10  WO-TIPO-OPERACION           PIC 9(04).
               10  WO-INDUSTRIA                PIC X(10).
               10  WO-RUBRO                    PIC X(10).
               10  WO-MARCA-COMERCIAL          PIC X(10).
               10  WO-COMERCIO                 PIC X(15).
               10  WO-SUCURSAL                 PIC X(04).
               10  WO-GRUPO-PLAZO              PIC X(02).
               10  WO-CUOTAS                   PIC 9(03).
               10  WO-CARENCIA                 PIC 9(02).
               10  WO-MONEDA                   PIC 9(03).
               10  WO-DESFASE                  PIC 9(02).
               10  WO-FECHAS_VENCIMIENTO       PIC X(800).
               10  WO-OCURRENCIAS              PIC 9(04).
               10  WO-ARTICULOS_ENTRADA        PIC X(1520).
             08 WO-SAL-TASAS.
               10  WO-IDENTIFICADOR_SAL        PIC 9(16).
               10  WO-TASA_EFECTIVA            PIC 9(02)V9(04).
               10  WO-TASA_COMERCIAL           PIC 9(02)V9(04).
               10  WO-TASA_CARENCIA            PIC 9(02)V9(04).
               10  WO-G1                       PIC 9(02)V9(04).
               10  WO-G2                       PIC 9(08).
               10  WO-G3                       PIC 9(08).
               10  WO-CAPITAL                  PIC 9(12)V9(02).
RDC            10  WO-TASAS_ARTICULOS          PIC X(1520).       
               10  WO-STATUS-CODIGO            PIC 9(02).
RDC            10  WO-STATUS-GLOSA             PIC X(2000).
               10  WO-NIVEL                    PIC 9(04).
               10  WO-TIEMPO-SEG               PIC 9(04)V9(02).
               10  WO-FLAG_TMC                 PIC X(01).
               10  WO-GRUPO-COMISION           PIC X(05).
               10  WO-IND-PLAZO                PIC X(01).

       01  WP-AC.
           05  WP-ENT-PRODUCTO                 PIC X(02).
           05  WP-ENT-SUBPRODU                 PIC X(04).
           05  WP-ENT-ENTIDAD                  PIC X(04).
           05  WP-ENT-SUCURSAL                 PIC X(04).
           05  WP-ENT-CUENTA                   PIC X(12).
           05  WP-ENT-LINEA-CRED               PIC X(04).
           05  WP-ENT-COD-MONEDA               PIC 9(03).
           05  WP-ENT-FECHA-PASE               PIC X(08).
           05  WP-RET-MTO-PASE                 PIC S9(09).
           05  WP-RET-MTO-VENTA                PIC S9(09).
           05  WP-RET-CAN-VENTA                PIC 9(02).
           05  WP-RET-AUTOR-PASE               PIC X(08).
           05  WP-RET-COND-PASE                PIC 9(04).
           05  WP-RET-GLS-RESP                 PIC X(200).
           05  WP-RET-COD-RESP                 PIC S9(05).
           05  WP-ENT-MTO-PASE                 PIC S9(09).
           05  WP-ENT-MTO-VENTA                PIC S9(09).
           05  WP-ENT-CAN-VENTA                PIC 9(02).

           EXEC SQL INCLUDE SQLCA END-EXEC.

      *+-----------------------------------------------------------+
      *        COPY DE LOGUEO DE TRANSACCION
      *+-----------------------------------------------------------+

           EXEC SQL INCLUDE MPMLOG END-EXEC.

      *--------------------------------------------------------------
      *       ESQUEMA DE BOTGEN_PRC_ENC_PAR_DOM
      *--------------------------------------------------------------
       01  PARAM-MACDOM.
           05  ENTRADA-MCD.
               10  MCD_ENUM_COD_PAI         PIC  9(03).
               10  MCD_ENUM_COD_MAC_DOM     PIC  9(05).
               10  MCD_ENUM_COD_MOV_DOM     PIC  9(05).
               10  MCD_EVC2_GLS_MOV_DOM     PIC  X(200).
               10  MCD_ENUM_COD_APP         PIC  9(05).
               10  MCD_ENUM_COD_PRO_APP     PIC  9(05).
               10  MCD_EVC2_NOM_RSP         PIC  X(60).
               10  MCD_ENUM_TIP_SAL         PIC  9(01).
               10  MCD_ENUM_NRO_REG_INC     PIC  9(05).
               10  MCD_ENUM_TOT_REG_PGN     PIC  9(05).
           05  SALIDA-MCD.
               10  MCD_SAL_NRO_MSJ          PIC S9(05).
               10  MCD_SAL_GLS_MSJ          PIC X(200).
       01  WO_SCLB_VAR_MCD                  SQL-CLOB.
       01  WS-SCLB-VAR-MCD                  PIC  X(200)  VARYING.
       01  LARGO-TEXT-MCD                   PIC S9(9)    COMP.
       01  SCUR_CUR_MCD                     SQL-CURSOR.
       01  RECIBE-CUR-MCD.
           05  MCD_TGMPA_COD_PAI            PIC  9(03).
           05  MCD_TGMPA_GLS_PAI            PIC  X(60).
           05  MCD_TGMMD_COD_MAC_DOM        PIC  9(05).
           05  MCD_TGMMD_GLS_MAC_DOM        PIC  X(60).
           05  MCD_TGMDO_COD_DOM            PIC  9(05).
           05  MCD_TGMDO_COC_DOM            PIC  X(05).
           05  MCD_TGMDO_GLS_DOM            PIC  X(80).
           05  MCD_TGMDO_MRC_VIG            PIC  X(01).
                      

           EXEC SQL END DECLARE SECTION END-EXEC.

      *==> ADDSYSTEM 09/05/2011 FVC-I

        01  DFHCOMMAREA.
           COPY "STCOPY".

      *==> ADDSYSTEM 09/05/2011 FVC-I
      *--------------------------------------------------------------           
SCT     01  WS-STCOPY1.
            10  STCOPY1.                        
                15 STCOPY1-CONECTOR.
                   20 STCOPY1-COD-RESPUESTA         PIC 9(10).
                   20 STCOPY1-NOMBRE-SERVICIO       PIC X(50).
                   20 STCOPY1-LARGO-MENSAJE         PIC 9(09).
                15 STCOPY1-CABECERA.
                   20 STCOPY1-COD-ENTIDAD           PIC X(04).
                   20 STCOPY1-TIPO-TERMINAL         PIC X(06).
                   20 STCOPY1-COD-USUARIO           PIC X(08).
                   20 STCOPY1-COD-OFICINA           PIC X(04).
                   20 STCOPY1-TERM-FISICO           PIC X(04).
                   20 STCOPY1-FECHA-CONTA           PIC X(10).
                   20 STCOPY1-COD-APLICACION        PIC X(02).
                   20 STCOPY1-COD-PAIS              PIC X(02).
                   20 STCOPY1-IND-COMMIT            PIC X(01).
                15 STCOPY1-PAGINACION.
                   20 STCOPY1-IND-PAGINACION        PIC X(01).
                      88 STCOPY1-SIGUIENTE          VALUE "S". 
                      88 STCOPY1-ANTERIOR           VALUE "A".
                      88 STCOPY1-UNITARIA           VALUE "U". 
                      88 STCOPY1-RESTO              VALUE " ". 
                   20 STCOPY1-CLAVE-INICIO          PIC X(200).
                   20 STCOPY1-CLAVE-FIN             PIC X(200).
                   20 STCOPY1-PANTALLA-PAG          PIC 9(03).
                   20 STCOPY1-IND-MAS-DATOS         PIC X(01).
                   20 STCOPY1-OTROS-DATOS           PIC X(90).
                15 STCOPY1-ENTRADA-SALIDA.
                   20 STCOPY1-MENSAJE               PIC X(6300).
                15 FILLER                          PIC X(151).
            
SCT     01  REGISTRO-INVOCACION1.
           05 INV-COD-RETORNO1            PIC 9(10).
           05 INV-NOMBRE-SERVICIO1        PIC X(50).
           05 INV-LARGO-MENSAJE1          PIC 9(09).
           05 INV-PARAMETROS1             PIC X(6987).           
 
       LINKAGE SECTION.
      *----------------
       01  REGISTRO-INVOCACION.
           05  INV-COD-RETORNO                PIC 9(10).
           05  INV-NOMBRE-SERVICIO            PIC X(50).
           05  INV-LARGO-MENSAJE              PIC 9(9).
           05  INV-PARAMETROS                 PIC X(6987).

       PROCEDURE DIVISION  USING REGISTRO-INVOCACION.
       COMIENZO-SFISER610C.
      *-------------------
           INITIALIZE LIB611C.
           MOVE INV-PARAMETROS     TO LIB611C.
           PERFORM 100000-INICIO
           PERFORM 200000-PROCESO
           PERFORM 300000-FINAL.
 
       100000-INICIO.
      *--------------
           MOVE SPACES TO VAR-CODTIPC.
           MOVE 0 TO WS-NUM-SECUENCIA.
           ACCEPT WS-FECHA FROM DATE.
           MOVE "-" TO WS-GUION1 OF WS-FECHA-SYS
                       WS-GUION2 OF WS-FECHA-SYS
           ADD 2000, WS-ANO  GIVING WS-ANO-SYS
           MOVE WS-MES                    TO WS-MES-SYS
           MOVE WS-DIA                    TO WS-DIA-SYS.
           MOVE WS-FECHA-SYS TO FECHA_TRANSACCION OF MPMLOG

           ACCEPT WS-HORA FROM TIME.
           MOVE WS-HORA TO HORA_TRANSACCION OF MPMLOG.
           MOVE CT-CODIGO-SERVICIO TO WO-ISMCS_COD_SRV.

           DISPLAY "SWINDPLZ" UPON ENVIRONMENT-NAME
           ACCEPT WS-SWINDPLZ FROM ENVIRONMENT-VALUE
           
      *Ini SCT version light
           DISPLAY "SWLIGHT" UPON ENVIRONMENT-NAME
           ACCEPT SW-LIGHT FROM ENVIRONMENT-VALUE
      *Fin SCT version light         
           
           EXEC SQL
               SELECT ISMCS_SWT_LOG
               INTO  :SW-LOGGEA-SERVICIO
               FROM   SFISER_MAE_CAG_SVC 
               WHERE  ISMCS_COD_SRV_K = :WO-ISMCS_COD_SRV
           END-EXEC.

           MOVE SQLCODE                TO  ATSQLERR   WS-SQLCODE

           IF WS-SQLCODE NOT = 0
                 SET NO-LOGGEA-SERVICIO TO TRUE
                 IF WS-SQLCODE NOT = 100
SCT                 PERFORM 300000-FINAL-STOP
                 END-IF
           END-IF.

           IF SI-LOGGEA-SERVICIO OR 
              SI-LOGGEA-ENTSAL   OR 
              SI-LOGGEA-ERROR
              OPEN EXTEND ARCHIVO
              IF WS-FILE-STATUS NOT = "00"
                 SET NO-LOGGEA-SERVICIO TO TRUE
              END-IF
           END-IF.

           IF SI-LOGGEA-SERVICIO OR SI-LOGGEA-ENTSAL
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-SERVICIO         TO  CODIGO_RUTINA OF MPMLOG
              MOVE INV-PARAMETROS      TO  MENSAJE_COPY OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

RDC        MOVE LIB610-FECHA-HORA-TRX(1:4) TO WS-FECHA-SYS(1:4).
RDC        MOVE LIB610-FECHA-HORA-TRX(5:2) TO WS-FECHA-SYS(6:2).
RDC        MOVE LIB610-FECHA-HORA-TRX(7:2) TO WS-FECHA-SYS(9:2).
           
       LLAMAR-ATPC043.
      *---------------
           INITIALIZE MPML043.
           MOVE LIB610-ENTIDAD     TO ML043-CODENT
           MOVE CT-ATPC043         TO MQCOPY-PROGRAMA-REAL
           MOVE CT-MQCOPY-CORRECTO TO MQCOPY-RETORNO.
           MOVE " " TO IND-PAGINACION
           MOVE MPML043 TO MQCOPY-MENSAJE

           IF SI-LOGGEA-SERVICIO
              MOVE "I"                    TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC043             TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY                 TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATPC043 USING WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                    TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC043              TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY                 TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           EVALUATE MQCOPY-RETORNO
              WHEN  CT-MQCOPY-CORRECTO
                    CONTINUE
              WHEN  CT-MQCOPY-INFOR
                    CONTINUE
              WHEN OTHER
                 MOVE 0132                TO  LIB610-CODIGO-RETORNO
                 MOVE CT-ERROR-PRODUCTOS  TO  LIB610-ERROR
                 PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE

           MOVE MQCOPY-MENSAJE         TO MPML043.
           
           SET NO-FIN-PROD TO TRUE
           MOVE 0 TO WS-CANPROD
           PERFORM VARYING WS-PROD FROM 1 BY 1 UNTIL WS-PROD > 62
                           OR SI-FIN-PROD
               ADD 1 TO WS-CANPROD
               INITIALIZE MPML029
           
               MOVE ML043-CODENT            TO ML029-CODENT
               MOVE ML043-PRODUCTO(WS-PROD) TO ML029-PRODUCTOF
                                 TB-PRODUCTO(WS-CANPROD) 
               MOVE ML043-SUBPRODU(WS-PROD) TO ML029-SUBPRODUF
                                  TB-SUBPRODU(WS-CANPROD)
               MOVE "0000"                  TO ML029-LINEAF
               MOVE 0                       TO ML029-CLAMONF
               MOVE CT-ATPC029         TO MQCOPY-PROGRAMA-REAL
               MOVE CT-MQCOPY-CORRECTO TO MQCOPY-RETORNO
               MOVE " " TO IND-PAGINACION
               PERFORM LLAMAR-ATPC029
               IF ML043-INDCONTINUAR(WS-PROD) = CT-NOSIGUE
                  SET SI-FIN-PROD TO TRUE
               END-IF
           END-PERFORM.     

       LLAMAR-ATPC029.
      *---------------
           MOVE MPML029 TO MQCOPY-MENSAJE

           IF SI-LOGGEA-SERVICIO
              MOVE "I"                    TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC029             TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY                 TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATPC029 USING WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                    TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC029              TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY                 TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           IF MQCOPY-RETORNO = CT-MQCOPY-CORRECTO  OR
              MQCOPY-RETORNO = CT-MQCOPY-INFOR
                               
              MOVE MQCOPY-MENSAJE TO MPML029
              MOVE 0 TO WS-CANLIN
              SET NO-FIN-LINEA TO TRUE 
              PERFORM VARYING WS-LIN FROM 1 BY 1 UNTIL WS-LIN > 55
                                   OR SI-FIN-LINEA
                  ADD 1 TO WS-CANLIN
                  MOVE WS-CANLIN TO TB-CANTLIN(WS-CANPROD)

                  MOVE ML029-CODENT      TO MP029-CODENT
                  MOVE ML029-PRODUCTO(WS-LIN) TO MP029-PRODUCTO
                  MOVE ML029-SUBPRODU(WS-LIN) TO MP029-SUBPRODU
                  MOVE ML029-LINEA(WS-LIN)    TO MP029-LINEA
                         TB-LINEA(WS-CANPROD, WS-CANLIN)

                  MOVE ML029-CLAMON(WS-LIN)   TO MP029-CLAMON
                  PERFORM LLAMAR-ATPC029-UNITARIO
                
                  INITIALIZE MPM0201
                  MOVE ML029-CODENT           TO MP201-CODENT
                  MOVE ML029-PRODUCTO(WS-LIN) TO MP201-PRODUCTO
                  MOVE ML029-SUBPRODU(WS-LIN) TO MP201-SUBPRODU
                  MOVE ML029-LINEA (WS-LIN)   TO MP201-LINEA(1)
                  MOVE " "                    TO IND-PAGINACION
                  MOVE CT-ATPC201             TO MQCOPY-PROGRAMA-REAL
                  MOVE CT-MQCOPY-CORRECTO     TO MQCOPY-RETORNO
                  PERFORM LLAMAR-ATPC201
                  IF ML029-INDCONTINUAR(WS-LIN) = CT-NOSIGUE
                    SET SI-FIN-LINEA TO TRUE
                  END-IF
              END-PERFORM
           END-IF.
           
       LLAMAR-ATPC029-UNITARIO.
           MOVE "U" TO IND-PAGINACION
           MOVE CT-ATPC029         TO MQCOPY-PROGRAMA-REAL
           MOVE CT-MQCOPY-CORRECTO TO MQCOPY-RETORNO
           MOVE MPM0029            TO MQCOPY-MENSAJE
           IF SI-LOGGEA-SERVICIO
              MOVE "I"             TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC029      TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY          TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATPC029 USING WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"             TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC029      TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY          TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           MOVE MQCOPY-MENSAJE     TO MPM0029

           IF MQCOPY-RETORNO = CT-MQCOPY-CORRECTO  OR
              MQCOPY-RETORNO = CT-MQCOPY-INFOR
              MOVE MP029-LIMMAXDIALNA 
                        TO TB-LIMMAXDIA(WS-CANPROD, WS-CANLIN)
           ELSE
              MOVE 0    TO TB-LIMMAXDIA(WS-CANPROD, WS-CANLIN)
           END-IF.
       
                     
       LLAMAR-ATPC201.
      *---------------
          
           MOVE MPM0201            TO MQCOPY-MENSAJE
           IF SI-LOGGEA-SERVICIO
              MOVE "I"             TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC201      TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY          TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATPC201 USING WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"             TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC201      TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY          TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           MOVE MQCOPY-MENSAJE     TO MPM0201

           MOVE 0 TO WS-CANTIPC
           IF MQCOPY-RETORNO = CT-MQCOPY-CORRECTO  OR
              MQCOPY-RETORNO = CT-MQCOPY-INFOR
              MOVE 1 TO WS-IND
              PERFORM UNTIL WS-IND > 19
               IF MP201-LINEA(WS-IND) NOT EQUAL SPACES
                  ADD 1 TO WS-CANTIPC
                  MOVE MP201-CODTIPC(WS-IND) 
                     TO TB-CODTIPC(WS-CANPROD, WS-CANLIN, WS-CANTIPC)
                  MOVE MP201-IMPMINCOMCUO(WS-IND) 
                     TO TB-MTOMIN (WS-CANPROD, WS-CANLIN, WS-CANTIPC)
                  MOVE MP201-IMPMAXCOMCUO(WS-IND) 
                     TO TB-MTOMAX (WS-CANPROD, WS-CANLIN, WS-CANTIPC)
                  MOVE MP201-NUMMESMINCUO(WS-IND) 
                     TO TB-PZOMIN (WS-CANPROD, WS-CANLIN, WS-CANTIPC)
                  MOVE MP201-NUMMESMAXCUO(WS-IND)
                     TO TB-PZOMAX (WS-CANPROD, WS-CANLIN, WS-CANTIPC)
                  MOVE 0 TO 
                     TB-CANTDIF(WS-CANPROD, WS-CANLIN, WS-CANTIPC)
                  MOVE 0 TO WS-CANTDIF
                  PERFORM VARYING WS-DIF FROM 
                             MP201-MESMINCARCUO(WS-IND) BY 1 
                          UNTIL WS-DIF > MP201-MESMAXCARCUO(WS-IND)
                          OR WS-DIF > 299
                      IF WS-DIF > 0 
                         ADD 1 TO WS-CANTDIF
                         MOVE WS-DIF TO 
           TB-CANMESDIF(WS-CANPROD, WS-CANLIN, WS-CANTIPC, WS-CANTDIF)
                      END-IF
                  END-PERFORM
                  MOVE WS-CANTDIF TO 
                         TB-CANTDIF(WS-CANPROD, WS-CANLIN, WS-CANTIPC)
                  IF MP201-INDCONTINUAR(WS-IND) = CT-NOSIGUE
                    MOVE 20 TO WS-IND
                  END-IF
                  ADD 1 TO WS-IND
               ELSE
                  MOVE 20 TO WS-IND
               END-IF
              END-PERFORM
              MOVE WS-CANTIPC TO TB-CANTCC(WS-CANPROD, WS-CANLIN)
           END-IF.
              
       200000-PROCESO.
      *---------------
           INITIALIZE LIB610-ENTRADA-SALIDA
           PERFORM VALIDAR-CAMPOS-COMUNES.

           IF SW-INICIO = 0

              PERFORM LLENAR-MQCOPY

              INITIALIZE WS-ATPC021

              MOVE LIB610-ENTIDAD TO WS-ATPC021-CODENT
              PERFORM ATPC021-CARGAR-ARREGLO
              IF WS-ATPC021-RETORNO-ERROR
                 MOVE "ERROR al cargar datos del ATPC021"
                   TO LIB610-DESCRIP-ERROR
                 PERFORM 999999-ERROR-PROGRAMA
              END-IF
              INITIALIZE WS-ATPC021
              MOVE LIB610-ENTIDAD        TO WS-ATPC021-CODENT
              PERFORM ATPC021-BUSCAR-EN-ARREGLO
              IF WS-ATPC021-RETORNO-ERROR
                 MOVE WS-ATPC021-RETORNO-DESC
                   TO LIB610-DESCRIP-ERROR
                 PERFORM 999999-ERROR-PROGRAMA
              END-IF


              INITIALIZE WS-ATPC044
              MOVE LIB610-ENTIDAD TO WS-ATPC044-CODENT
      *        MOVE SPACE          TO WS-ATPC044-TIPOFAC-ALF
              MOVE SPACE          TO WS-ATPC044-INDNORCOR-ALF
              PERFORM ATPC044-CARGAR-ARREGLO
              IF WS-ATPC044-RETORNO-ERROR
                 MOVE "ERROR al cargar datos del ATPC044"
                   TO LIB610-DESCRIP-ERROR
                 PERFORM 999999-ERROR-PROGRAMA
              END-IF

              INITIALIZE WS-ATPC052
              MOVE LIB610-ENTIDAD   TO WS-ATPC052-CODENT
              MOVE "E"              TO WS-ATPC052-INDVERT
              MOVE "TA"             TO WS-ATPC052-INDNIVAPL
              PERFORM ATPC052-CARGAR-ARREGLO
              IF WS-ATPC052-RETORNO-ERROR
                 MOVE "ERROR al cargar datos del ATPC052"
                   TO LIB610-DESCRIP-ERROR
                 PERFORM 999999-ERROR-PROGRAMA
              END-IF

              INITIALIZE WS-ATPC059
              MOVE LIB610-ENTIDAD TO WS-ATPC059-CODENT
              PERFORM ATPC059-CARGAR-ARREGLO
              IF WS-ATPC059-RETORNO-ERROR
                 MOVE "ERROR al cargar datos del ATPC059"
                   TO LIB610-DESCRIP-ERROR
                 PERFORM 999999-ERROR-PROGRAMA
              END-IF

              PERFORM LLAMAR-ATPC043
              MOVE WS-CANPROD TO TB-CANTPROD
              IF SI-LOGGEA-SERVICIO
                 MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
                 MOVE "PROD 1  "          TO  CODIGO_RUTINA OF MPMLOG
                 MOVE TAB-PRODUCTOS(1)    TO  MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
                 MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
                 MOVE "PROD 2  "          TO  CODIGO_RUTINA OF MPMLOG
                 MOVE TAB-PRODUCTOS(2)    TO  MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
                 MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
                 MOVE "PROD 3  "          TO  CODIGO_RUTINA OF MPMLOG
                 MOVE TAB-PRODUCTOS(3)    TO  MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
                 MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
                 MOVE "PROD 4  "          TO  CODIGO_RUTINA OF MPMLOG
                 MOVE TAB-PRODUCTOS(4)    TO  MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
                 MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
                 MOVE "PROD 5  "          TO  CODIGO_RUTINA OF MPMLOG
                 MOVE TAB-PRODUCTOS(5)    TO  MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
              END-IF
              MOVE 1 TO SW-INICIO
           END-IF.

           INITIALIZE WS-MQCOPY.
           PERFORM LLENAR-MQCOPY.
           
           INITIALIZE WO-ENTSAL-TASAS.
           
           PERFORM CONSULTA-TARJETA-CONTRATO.                     
           
           IF WS-SWITCH-MARCA-TIPO = 0
              PERFORM CARGAR-MARCA-TIPO
              MOVE 1  TO WS-SWITCH-MARCA-TIPO
           END-IF
           
           IF WS-SWITCH-BOTGEN-ENC-PAR-DOM = 0
              PERFORM CARGAR-BOTGEN-ENC-PAR-DOM
              MOVE 1  TO WS-SWITCH-BOTGEN-ENC-PAR-DOM
           END-IF
           

      *NBV         
      *    IF LIB070R-INDBLQOPE = "S"
      *       MOVE 107              TO  LIB610-CODIGO-RETORNO
      *       MOVE SPACES           TO  WS-MENSAJE-ATOMICO
      *       PERFORM 999999-ERROR-PROGRAMA
      *    END-IF.                      

           MOVE SPACES              TO WS-LINEA
           PERFORM BUSCAR-TRANSAC-BOTGEN
           IF WS-LINEA = SPACES OR "9999"
              PERFORM LLAMAR-OBTENER-TIPOFAC-LINEA
           END-IF
           
           MOVE WS-LINEA-NUM TO LIB610-LINEA
           
           IF  LIB610-NRO-CUOTAS = 0
               PERFORM BUSCAR-DESDE-PARAMETROS
               MOVE 'N'                TO WS-SIMULACION
           ELSE
               MOVE LIB610-NRO-CUOTAS  TO TB-NRO-CUOTA(1)
               MOVE ZEROS              TO TB-MTO-CUOTA(1)
               MOVE 1                  TO TB-CANT-CUOTAS-ARR
               MOVE 'S'                TO WS-SIMULACION
           END-IF

      *LRO-TECNOCOM-E&Y1-I         
      *     IF LIB610-MESES-CARENCIA > 0
      *        PERFORM CALCULAR-MESES-CARENCIA
      *     END-IF.
      *LRO-TECNOCOM-E&Y1-F     
           PERFORM LLENAR-MQCOPY
SCT        PERFORM MOVER-A-STCOPY1

SCT        INITIALIZE TABLA-TASAS 
           PERFORM LLAMADA-SIMULACION-CC VARYING I FROM 1 BY 1
                           UNTIL I > TB-CANT-CUOTAS-ARR OR I > 10.

      *LRO-TECNOCOM-E&Y1-I                           
      *     IF LIB610-MESES-CARENCIA > 0
      *        PERFORM CALCULAR-MESES-CARENCIA
      *     END-IF.
      *LRO-TECNOCOM-E&Y1-F                             

           IF LIB610-NRO-CUOTAS = 0 
	           PERFORM BUSCAR-IND-RIESGO
           END-IF

	  
           IF TB-CANT-CUOTAS-ARR = 0
RDC           MOVE 0                    TO LIB610-CODIGO-RETORNO
           ELSE
              PERFORM MOVER-SALIDA
           END-IF.
       
       CARGAR-MARCA-TIPO.
      *------------------
           INITIALIZE MPM0025.
           MOVE ATDATTAS-CODENT-SAL    TO  MP025-CODENT

           MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA.
           MOVE MPM0025                TO  MQCOPY-MENSAJE.
           MOVE "00"                   TO  MQCOPY-RETORNO.
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC025          TO  CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATPC025            USING  WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATPC025          TO  CODIGO_RUTINA OF MPMLOG 
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           MOVE MQCOPY-MENSAJE         TO  MPM0025.

      
       VALIDAR-CAMPOS-COMUNES.
      *-----------------------
           PERFORM VALIDAR-COD-ENTIDAD.
           PERFORM VALIDAR-COD-OFICINA.
           PERFORM VALIDAR-COD-USUARIO.
           PERFORM VALIDAR-COD-PAIS.
           PERFORM VALIDAR-CODIGO-CANAL.
           PERFORM VALIDAR-PAN-CONTRATO
RDC        PERFORM VALIDAR-NRO-CUOTAS
RDC        PERFORM VALIDAR-LINEA
           PERFORM VALIDAR-COD-MONEDA
           PERFORM VALIDAR-IMP-TRX.
           PERFORM VALIDAR-MESES-CARENCIA.
           PERFORM VALIDAR-ARTICULOS-PARA-TASAS.

       VALIDAR-PAN-CONTRATO.
      *---------------------
           IF  (LIB610-PAN      = SPACES OR LOW-VALUES OR ZEROS)
           AND (LIB610-CODENT   = SPACES OR LOW-VALUES OR ZEROS)
           AND (LIB610-CENTALTA = SPACES OR LOW-VALUES OR ZEROS)
           AND (LIB610-CUENTA   = SPACES OR LOW-VALUES OR ZEROS)
                MOVE 179                TO  LIB610-CODIGO-RETORNO
                MOVE SPACES           TO  WS-MENSAJE-ATOMICO
                PERFORM 999999-ERROR-PROGRAMA           
           END-IF.
           
       VALIDAR-COD-ENTIDAD.
      *--------------------
           IF LIB610-ENTIDAD = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 31                    TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
           
       VALIDAR-COD-OFICINA.
      *--------------------
      *INI-NBV SATI: 448796 2013-03-11 provisorio.
      *    IF LIB610-COD-OFICINA = SPACES  OR  LOW-VALUES  OR  ZEROS
      *       MOVE 33               TO  LIB610-CODIGO-RETORNO
      *       MOVE SPACES           TO  WS-MENSAJE-ATOMICO
      *       PERFORM 999999-ERROR-PROGRAMA
      *    END-IF.
             
      *CAMBIO Definitivo es por CANAL de CAJA.         
           MOVE 'N' TO SW-ENCONTRAR
 
           PERFORM VARYING II FROM 1 BY 1 UNTIL II > 20 OR
                                      SW-ENCONTRAR = 'S'
              IF LIB610-COD-OFICINA = ARR-SUC-DIREC(II)
                 MOVE ARR-SUC-SUC(II)  TO LIB610-COD-OFICINA
                 MOVE 'S'              TO SW-ENCONTRAR 
              END-IF
           END-PERFORM. 
      *FIN-NBV SATI: 448796 2013-03-11 provisorio.
           
       VALIDAR-COD-USUARIO.
      *--------------------
           IF LIB610-COD-USUARIO = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 54               TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-COD-PAIS.
      *-----------------
           IF LIB610-DOMINIO-PAIS = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 25               TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
           
       VALIDAR-CODIGO-CANAL.
      *---------------------- 
           IF LIB610-CODIGO-CANAL = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 48               TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-CODENT.
      *----------------
           IF LIB610-CODENT = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 31               TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-CENTALTA.
      *-----------------
           IF LIB610-CENTALTA = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 63               TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
          
       VALIDAR-CUENTA.
      *---------------
           IF LIB610-CUENTA = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 03                    TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
 
       VALIDAR-PRODUCTO.
      *-----------------
           IF LIB610-PRODUCTO = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 64                    TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-SUBPRODU.
      *-----------------
           IF LIB610-SUBPRODU = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 65                  TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-MARCA.
      *---------------
           IF LIB610-MARCA = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 82                   TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-TIPO.
      *--------------
           IF LIB610-TIPO = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 81                   TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-GRUPOLIQ.
      *-----------------
           IF LIB610-GRUPOLIQ = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 57                  TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-LINEA.
      *--------------      
RDC        MOVE SPACES        TO SW-0088      
PRCF       IF LIB610-LINEA  = CT-0088
PRCF          MOVE  CT-0050   TO LIB610-LINEA
PRCF          MOVE  SW-LIGHT  TO SW-LIGHT-PASO
RDC           MOVE  CT-0088   TO SW-0088
PRCF          MOVE  CT-1      TO SW-LIGHT   
PRCF       END-IF   
      
RDC        IF LIB610-LINEA = SPACES  OR  LOW-VALUES  OR  ZEROS
RDC           MOVE  CT-0050   TO LIB610-LINEA
RDC        END-IF.   


       VALIDAR-COD-MONEDA.
      *-------------------
           IF LIB610-COD-MONEDA = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 12                  TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       VALIDAR-IMP-TRX.
      *----------------
           IF LIB610-IMP-TRX = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 11                TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

           
       VALIDAR-PAN.
      *------------
           IF LIB610-PAN = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 04                  TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
           
       VALIDAR-LINEA-CREDITO.
      *----------------------
           IF LIB610-LINEA = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE 30                    TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

RDC    VALIDAR-NRO-CUOTAS.
      *-------------------
           IF LIB610-LINEA  = CT-0088 AND 
             LIB610-NRO-CUOTAS > 1
              MOVE CT-ERROR-NRO-CUOTAS  TO WS-MENSAJE-ATOMICO
              MOVE 99999                TO LIB610-CODIGO-RETORNO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
           
       VALIDAR-MESES-CARENCIA.
      *-----------------------
           IF LIB610-MESES-CARENCIA = SPACES OR LOW-VALUES OR > 12
              MOVE 134                  TO  LIB610-CODIGO-RETORNO
              MOVE SPACES           TO  WS-MENSAJE-ATOMICO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
           
       VALIDAR-ARTICULOS-PARA-TASAS.
      *-----------------------------
           INITIALIZE                WSAAT-ARTICULOS-ENTRADA.
           MOVE 0                 TO WS-AAT.
           MOVE 0                 TO WSAAT-CANT-ARTICULOS.
           IF LIB610-CANT-ARTICULOS > 0
              PERFORM VARYING WS-AAT FROM 1 BY 1 UNTIL WS-AAT > 40
                                  OR WS-AAT > LIB610-CANT-ARTICULOS
                 IF LIB610-MONTO-CAPITAL(WS-AAT) > 0
RDC                 MOVE SPACES TO WS-DEPTO
RDC                 MOVE LIB610-COD-DEPTO (WS-AAT) TO WS-DEPTO
RDC                 IF WS-DEPTO(1:1) = "0"
                       PERFORM CORRIGE-CODDEPTO
RDC                 END-IF
                    ADD 1         TO WSAAT-CANT-ARTICULOS
                    MOVE LIB610-TAB-ARTICULOS(WS-AAT) TO
                         WSAAT-ARREGLO-ARTICULOS(WSAAT-CANT-ARTICULOS)
                 END-IF
              END-PERFORM
           END-IF.
 
       CORRIGE-CODDEPTO.
      *----------------
           SET NO-FIN-IR TO TRUE
           MOVE 0 TO POS-INI
           MOVE LIB610-COD-DEPTO  (WS-AAT) TO  VAR-CODDEPTO-X 
           MOVE SPACES TO VAR-CODDEPTO
           PERFORM VARYING IR FROM 1 BY 1 UNTIL IR > 5 
                            OR SI-FIN-IR
            IF VAR-CODDEPTO-X(IR:1) NOT = "0"
               SET SI-FIN-IR TO TRUE
               MOVE IR TO POS-INI
            END-IF
           END-PERFORM
           IF POS-INI > 0
              SUBTRACT POS-INI FROM 6 GIVING 
                                        LAR-CDD
              MOVE VAR-CODDEPTO-X(POS-INI:LAR-CDD)
                               TO VAR-CODDEPTO(2:LAR-CDD)
              MOVE "D"         TO VAR-CODDEPTO(1:1)
           END-IF.
           MOVE VAR-CODDEPTO   TO LIB610-COD-DEPTO(WS-AAT). 

       CALCULAR-MESES-CARENCIA.
      *------------------------
      *     SET NO-ENCONTRO-FECVEN TO TRUE
      *     SET NO-FIN-MPM0085 TO TRUE
      *     MOVE CT-0 TO WS-VEZ
      *     PERFORM BUSCAR-FECHA-VENCIMIENTO
      *                  UNTIL SI-ENCONTRO-FECVEN OR
      *                        SI-FIN-MPM0085
      *LRO-TECNOCOM-E&Y1-I                                               
                                              
           PERFORM CALCULA-CARENCIA.
      *LRO-TECNOCOM-E&Y1-F                                    
                                    
                                    
      *LRO-TECNOCOM-E&Y1-I 
      * BUSCAR-FECHA-VENCIMIENTO.
      **-------------------------
      *     MOVE LIB610-CODENT    TO  MP085-CODENT.
      *
      *     MOVE CT-1             TO MP085-CODPROCESO
      **     MOVE LIB070R-GRUPOLIQ TO MP085-CODGRUPO
      *     MOVE ATDATTAS-GRUPOLIQ-SAL TO MP085-CODGRUPO
      *     MOVE CT-2             TO MP085-TIPFECHA
      *     IF LIB610-MESES-CARENCIA NOT < WS-MES-SYS
      *        STRING LIB610-FECHA-HORA-TRX(1:4)
      *               "-" 
      *               LIB610-MESES-CARENCIA
      *               "-"
      *               "01" DELIMITED BY SIZE
      *                  INTO MP085-FECHA(1)
      *
      *        END-STRING
      *     ELSE
      *        MOVE LIB610-FECHA-HORA-TRX(1:4) TO WS-ANO-CARE
      *        ADD 1 TO WS-ANO-CARE
      *        STRING WS-ANO-CARE
      *               "-" 
      *               LIB610-MESES-CARENCIA
      *               "-"
      *               "01" DELIMITED BY SIZE
      *                  INTO MP085-FECHA(1)
      *
      *        END-STRING
      *
      *     END-IF.                
      *
      *     MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA
      *     MOVE MPM0085                TO  MQCOPY-MENSAJE
      *     IF WS-VEZ = CT-0
      *        MOVE "S"                   TO  IND-PAGINACION
      *        MOVE MP085-CODENT TO MQCOPY-CLAVE-FIN(14:4)
      *        MOVE MP085-CODPROCESO TO MQCOPY-CLAVE-FIN(19:2)
      *        MOVE MP085-CODGRUPO   TO MQCOPY-CLAVE-FIN(22:2)
      *        MOVE MP085-TIPFECHA   TO MQCOPY-CLAVE-FIN(25:1)
      *        MOVE 01                   TO MQCOPY-CLAVE-FIN(35:02)
      *        MOVE LIB610-MESES-CARENCIA TO MQCOPY-CLAVE-FIN(32:2)
      *        MOVE WS-ANO-SYS           TO MQCOPY-CLAVE-FIN(27:4)
      *        MOVE "-"                  TO MQCOPY-CLAVE-FIN(31:01)
      *        MOVE "-"                  TO MQCOPY-CLAVE-FIN(34:1)
      *        MOVE CT-1 TO WS-VEZ
      *     ELSE
      *        MOVE "S"                 TO IND-PAGINACION
      *        MOVE MP085-CODENT TO MQCOPY-CLAVE-FIN(14:4)
      *        MOVE MP085-CODPROCESO TO MQCOPY-CLAVE-FIN(19:2)
      *        MOVE MP085-CODGRUPO   TO MQCOPY-CLAVE-FIN(22:2)
      *        MOVE MP085-TIPFECHA   TO MQCOPY-CLAVE-FIN(25:1)
      *        MOVE MP085-FECHA(CT-115) TO MQCOPY-CLAVE-FIN(27:10)
      *     END-IF
      *
      *     MOVE "00"                   TO  MQCOPY-RETORNO
      *     
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC085          TO  CODIGO_RUTINA OF MPMLOG
      *        MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF
      *
      *     CALL  CT-ATPC085  USING WS-MQCOPY.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC085          TO  CODIGO_RUTINA OF MPMLOG
      *        MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF
      *
      *     MOVE MQCOPY-MENSAJE         TO  MPM0085
      *
      *     EVALUATE MQCOPY-RETORNO
      *        WHEN  CT-CORRECTO
      *              CONTINUE
      *
      *        WHEN  CT-INFOR
      *              CONTINUE
      *              
      *        WHEN CT-AVISO 
      *             MOVE 127    TO  LIB610-CODIGO-RETORNO
      *             MOVE SPACES TO WS-MENSAJE-ATOMICO
      *             PERFORM 999999-ERROR-PROGRAMA
      *             
      *        WHEN OTHER
      *             MOVE 127    TO  LIB610-CODIGO-RETORNO
      *             MOVE SPACES TO WS-MENSAJE-ATOMICO
      *             PERFORM 999999-ERROR-PROGRAMA
      *
      *     END-EVALUATE.
      *
      *     PERFORM VARYING W-F FROM 1 BY 1 UNTIL W-F > 115 OR
      *                  SI-ENCONTRO-FECVEN 
      *          MOVE MP085-FECHA(W-F) TO WS-FECHA-A-M-D
      *          IF WS-FECHA-AMD-MES = LIB610-MESES-CARENCIA AND 
      *             MP085-INDPROC(W-F) = CT-N AND 
      *             MP085-TIPFECHA = CT-2
      *             MOVE MP085-FECHA(W-F) TO WS-FECHA-AMD-VCTO
      *             SET SI-ENCONTRO-FECVEN TO TRUE
      *          END-IF
      *     END-PERFORM
      *
      *     IF SI-ENCONTRO-FECVEN 
      *        SET SI-FIN-MPM0085 TO TRUE
      *     ELSE
      *         IF MQCOPY-IND-MAS-DATOS NOT = CT-S
      *            SET SI-FIN-MPM0085 TO TRUE
      *         END-IF
      *     END-IF.
      *LRO-TECNOCOM-E&Y1-F 
       CALCULA-CARENCIA.
      *----------------
      *     INITIALIZE WS-ATVTODIF
      *                
      *     MOVE ATDATTAS-CODENT-SAL    TO  ATVTODIF-CODENT
      *     MOVE ATDATTAS-CENTALTA-SAL  TO  ATVTODIF-CENTALTA
      *     MOVE ATDATTAS-CUENTA-SAL    TO  ATVTODIF-CUENTA
      *     MOVE WS-FECHA-SYS           TO  ATVTODIF-FECHCOM.
      **LRO-TECNOCOM-E&Y1-I                                                              
RDC   *      MOVE WS-FECHA-AMD-VCTO      TO  ATVTODIF-FECHVTO.
      **     MOVE ATVTODIF-LIQ-CUOTA(1)  TO  ATVTODIF-FECHVTO. 
      *LRO-TECNOCOM-E&Y1-F                                                                                                                          
      *     MOVE WS-LINEA-NUM           TO  ATVTODIF-LINEA.
      *     MOVE 'C'                    TO  ATVTODIF-INDLIQCAR. 
      *     MOVE 0                      TO  ATVTODIF-MES-CAREN.
      *
      *
      *
      *     MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA
      *     MOVE WS-ATVTODIF            TO  MQCOPY-MENSAJE
      *     MOVE "00"                   TO  MQCOPY-RETORNO
      *     
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATE568           TO  CODIGO_RUTINA OF MPMLOG 
      *        MOVE WS-ATVTODIF         TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF
      *
      *     CALL  CT-ATE568   USING  ATVTODIF.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATE568           TO  CODIGO_RUTINA OF MPMLOG 
      *        MOVE WS-ATVTODIF         TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF
      *
      *                
      *     EVALUATE ATVTODIF-CODRET
      *        WHEN CT-CORRECTO-OK
      *             CONTINUE
      *
      *        WHEN CT-INFOR-BD
      *             CONTINUE
      *
      *        WHEN OTHER
      *             MOVE 173                 TO  LIB610-CODIGO-RETORNO
      *             MOVE SPACES TO WS-MENSAJE-ATOMICO
      *             PERFORM 999999-ERROR-PROGRAMA
      *             
      *
      *     END-EVALUATE.
      *
      *     MOVE ATVTODIF-MES-CAREN TO LIB610-MESES-CARENCIA.
             
           PERFORM VARYING WS-IND-CAREN FROM 1 BY 1
                     UNTIL WS-IND-CAREN > 85
              IF LIB610-MESES-CARENCIA = 
                            WS-CAREN-MM(WS-IND-CAREN)
                 MOVE WS-IND-CAREN TO 
                              LIB610-MESES-CARENCIA
                 MOVE 90 TO  WS-IND-CAREN                               
              END-IF
           END-PERFORM.                               
      *LRO-TECNOCOM-E&Y1-F       
      *==> ADDSYSTEM 09/05/2011 FVC-I
       OBT-DIFERIDOS.
      *--------------
           PERFORM BUSCAR-INDICES-TABLAS
           MOVE TB-PZOMIN(IND-PROD, IND-LIN, IND-TIPC) TO 
                           LIB610-PLAZO-MIN
           MOVE TB-PZOMAX(IND-PROD, IND-LIN, IND-TIPC) TO 
                           LIB610-PLAZO-MAX
    
           MOVE TB-CANTDIF(IND-PROD, IND-LIN, IND-TIPC) 
                                TO LIB610-CANT-DIFERIDO
           DISPLAY "RECORRE EL PERFORM WS-DIF"
           PERFORM VARYING WS-DIF FROM 1 BY 1 UNTIL
                WS-DIF > TB-CANTDIF(IND-PROD, IND-LIN, IND-TIPC)
RDC             OR WS-DIF > 10
           DISPLAY "MUEVE LIB610-DIF-MESES"
           MOVE TB-CANMESDIF(IND-PROD, IND-LIN, IND-TIPC, WS-DIF)
                      TO    LIB610-DIF-MESES(WS-DIF)
                               WS-CANMES
      *     PERFORM BUSCAR-VENCIMIENTO-DIF
           MOVE  WS-FECCAREN(WS-DIF)        TO WS-FEC-EDT
           MOVE CORRESPONDING WS-FEC-EDT TO WS-DIF-AAAAMMDD
           MOVE WS-DIF-AAAAMMDD    TO 
                                 LIB610-DIF-AAAAMMDD (WS-DIF)
           END-PERFORM.

       BUSCAR-INDICES-TABLAS.
      *----------------------
           DISPLAY "BUSCAR INDICES"
           SET NO-ENCONTRO TO TRUE
           MOVE 0 TO IND-PROD IND-LIN IND-TIPC
           PERFORM VARYING WS-P1 FROM 1 BY 1 
                                      UNTIL WS-P1 > TB-CANTPROD
                                 OR SI-ENCONTRO
              IF TB-PRODUCTO(WS-P1) = LIB070R-PRODUCTO AND 
                 TB-SUBPRODU(WS-P1) = LIB070R-SUBPRODU
                 MOVE WS-P1 TO IND-PROD
                 DISPLAY "ENCONTRO PRODUCTO,SUBPRODUCTO INDICE"
                 DISPLAY TB-PRODUCTO(IND-PROD) " " 
                         TB-SUBPRODU(IND-PROD) " "
                         IND-PROD
                 SET SI-ENCONTRO TO TRUE
              END-IF
           END-PERFORM.
           IF SI-ENCONTRO
              SET NO-ENCONTRO TO TRUE
              PERFORM VARYING WS-P1 FROM 1 BY 1
                    UNTIL WS-P1 > TB-CANTLIN(IND-PROD)
                          OR SI-ENCONTRO
                 IF TB-LINEA(IND-PROD, WS-P1) = LIB610-LINEA
                 
                   MOVE WS-P1 TO IND-LIN
                   DISPLAY "ENCONTRO LINEA, INDICE"
                   DISPLAY TB-LINEA (IND-PROD, IND-LIN) " " 
                           IND-LIN 

                   SET SI-ENCONTRO TO TRUE
                END-IF
              END-PERFORM
           END-IF.
           IF SI-ENCONTRO
              SET NO-ENCONTRO TO TRUE
              PERFORM VARYING WS-P1 FROM 1 BY 1
                    UNTIL WS-P1 > TB-CANTCC(IND-PROD,IND-LIN)
                          OR SI-ENCONTRO
                 IF TB-CODTIPC(IND-PROD, IND-LIN, WS-P1) = 
                                       VAR-CODTIPC                 
                   MOVE WS-P1 TO IND-TIPC
                   DISPLAY "ENCONTRO CODTIPC, INDICE"
                   DISPLAY TB-CODTIPC (IND-PROD, IND-LIN, IND-TIPC) " "
                           IND-TIPC 

                   SET SI-ENCONTRO TO TRUE
                END-IF
              END-PERFORM
           END-IF.

           IF IND-PROD = 0
              MOVE CT-ERROR-BUSCAR-PROD   TO WS-MENSAJE-ATOMICO
              MOVE 99999                  TO LIB610-CODIGO-RETORNO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
           
           IF IND-LIN = 0
              MOVE CT-ERROR-BUSCAR-LINEA  TO WS-MENSAJE-ATOMICO
              MOVE 99999                  TO LIB610-CODIGO-RETORNO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.

           IF IND-TIPC = 0
              MOVE CT-ERROR-BUSCAR-TIPOCC TO WS-MENSAJE-ATOMICO
              MOVE 99999                  TO LIB610-CODIGO-RETORNO
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
           		  
            
      * BUSCAR-VENCIMIENTO-DIF.
      *----------------------
      *     INITIALIZE  WS-ATVTODIF.
      *     MOVE LIB070R-CODENT               TO ATVTODIF-CODENT.
      *     MOVE LIB070R-CENTALTA             TO ATVTODIF-CENTALTA.
      *     MOVE LIB070R-CUENTA               TO ATVTODIF-CUENTA.
      *     MOVE SPACES                       TO ATVTODIF-PAN.
      *     MOVE LIB610-LINEA                 TO ATVTODIF-LINEA.
      *     MOVE WS-FECHA-SYS                 TO ATVTODIF-FECHCOM.
      *LRO_E&Y_INI1       
      *     MOVE SPACES                       TO ATVTODIF-FECHVTO.
RDC   *     MOVE ATVTODIF-LIQ-CUOTA(1)        TO ATVTODIF-FECHVTO.
RDC   *     MOVE WS-FECHA-AMD-VCTO            TO ATVTODIF-FECHVTO.
      *LRO_E&Y_INI1     
      *     MOVE "C"                          TO ATVTODIF-INDLIQCAR.
      *     MOVE WS-CANMES                    TO ATVTODIF-MES-CAREN.
      *     MOVE 00   TO ATVTODIF-CODRET.
      *
      *     MOVE CT-RUTINA                    TO MQCOPY-PROGRAMA.
      *     MOVE WS-ATVTODIF                  TO MQCOPY-MENSAJE.
      *     MOVE "00"                         TO MQCOPY-RETORNO.
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "I"                       TO INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATE568                 TO CODIGO_RUTINA OF MPMLOG
      *        MOVE WS-ATVTODIF               TO MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     CALL  CT-ATE568                USING ATVTODIF.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "O"                       TO INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATE568                 TO CODIGO_RUTINA OF MPMLOG
      *        MOVE SPACES TO MENSAJE_COPY OF MPMLOG
      *        MOVE WS-ATVTODIF               TO MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     IF  LIB610-MESES-CARENCIA > 0
      *         MOVE  ATVTODIF-FECHVTO        TO WS-FEC-EDT
      *         MOVE CORRESPONDING WS-FEC-EDT TO WS-DIF-AAAAMMDD
      *     ELSE
      *         MOVE "00010101"                 TO WS-DIF-AAAAMMDD
      *     END-IF.


	  
       BUSCAR-DESDE-PARAMETROS.
      *------------------------
      *
           PERFORM LLENAR-MQCOPY
           

           INITIALIZE MPM0473
           PERFORM MOVER-DATOS-ATE470
           PERFORM LLAMADA-A-ATE470
SCT        IF SW-LIGHT = CT-CERO 
RDC           OR LIB610-COD-OFICINA = '0039'
              PERFORM CARGAR-TABLA-PLAZOS
           ELSE              
              MOVE 1  TO TB-CANT-CUOTAS-ARR
SCT        END-IF.
                
       LLENAR-MQCOPY.
      *--------------
           MOVE LIB610-ENTIDAD         TO MQCOPY-ENTIDAD
           MOVE LIB610-CODIGO-CANAL    TO MQCOPY-TIPO-TERMINAL
           MOVE LIB610-COD-USUARIO     TO MQCOPY-USUARIO
           MOVE LIB610-COD-OFICINA     TO MQCOPY-OFICINA
           MOVE LIB610-TERM-FISICO     TO MQCOPY-TERM-FISICO
           MOVE WS-FECHA-SYS           TO MQCOPY-FECHA-OPE
           MOVE WS-FECHA-SYS           TO MQCOPY-FECHA-CONTA
           MOVE WS-HORA                TO MQCOPY-HORA-OPE
           MOVE LIB610-DOMINIO-PAIS    TO MQCOPY-PAIS.

       
       MOVER-DATOS-ATE470.
      *--------------------
           MOVE 0                      TO MP473-PLAZO-COM
           MOVE LIB610-CODENT          TO MP473-CODENT    
           MOVE LIB610-CENTALTA        TO MP473-CENTALTA 
           MOVE LIB610-CUENTA          TO MP473-CUENTA
           MOVE LIB610-COD-COMERCIO    TO MP473-CODCOMSUG
           MOVE LIB610-COD-OFICINA     TO WS-OFI-04
RDC        IF WS-OFI-04 = 0000
RDC           MOVE 0090                TO WS-OFI-04
RDC        END-IF
           MOVE WS-OFI-04              TO WS-OFI-15
           MOVE WS-OFI-15              TO MP473-SUCURSALSUG
           MOVE WS-LINEA-NUM           TO MP473-LINEASUG
           MOVE LIB610-IMP-TRX         TO MP473-IMPFACSUG

           MOVE LIB610-COD-TRX         TO MP473-CODTRANSUG
           MOVE LIB610-COD-MONEDA      TO MP473-CLAMONSUG
           MOVE ZEROES                 TO MP473-CODDEPSUG
           MOVE WS-P                   TO MP473-ALT-CONECO.

           MOVE LIB610-COD-IDENT-RED   TO MP473-TIPFRAN
           
           IF LIB610-COD-TRX = 0008 OR 0300
              MOVE 1200                TO MP473-TIPOMSGON
              MOVE 340000              TO MP473-CODPROON
           ELSE
              MOVE 1200                TO MP473-TIPOMSGON
              MOVE 040000              TO MP473-CODPROON
           END-IF.
 
           MOVE LIB610-COD-ACT-ORI     TO MP473-CODACT
           MOVE LIB610-COD-PAIS        TO MP473-CODPAIS
           MOVE WO-GRUPO-COMISION      TO MP473-COD-COMI.
           

           

       LLAMADA-A-ATE470.
      *----------------
           MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA.
           MOVE MPM0473                TO  MQCOPY-MENSAJE.
           MOVE "00"                   TO  MQCOPY-RETORNO.

           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE470           TO  CODIGO_RUTINA OF MPMLOG 
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATE470   USING  WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE470           TO  CODIGO_RUTINA OF MPMLOG 
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           MOVE MQCOPY-MENSAJE         TO  MPM0473

         
           EVALUATE MQCOPY-RETORNO
               WHEN CT-CORRECTO
                    CONTINUE
               WHEN CT-INFOR
                    CONTINUE
      *        WHEN CT-AVISO
      *             MOVE 030     TO  LIB610-CODIGO-RETORNO
      *             MOVE MQCOPY-MENS-AVISO-ERROR 
      *                          TO  LIB610-DESCRIP-ERROR
      *             PERFORM 999999-ERROR-PROGRAMA
      *        WHEN OTHER
      *             MOVE 030     TO  LIB610-CODIGO-RETORNO
      *             MOVE MQCOPY-TEXT1-AVISO1  TO LIB610-DESCRIP-ERROR
      *             PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.
       MOVER-A-STCOPY1.
      *----------------
           INITIALIZE REGISTRO-INVOCACION1.
           MOVE ZEROS                      TO STCOPY1-COD-RESPUESTA
           MOVE CT-SFISERS470C             TO STCOPY1-NOMBRE-SERVICIO
           MOVE ZEROS                      TO STCOPY1-LARGO-MENSAJE
           MOVE SPACES                     TO STCOPY1-PAGINACION
           MOVE LIB610-ENTIDAD             TO STCOPY1-COD-ENTIDAD   
           MOVE LIB610-CODIGO-CANAL        TO STCOPY1-TIPO-TERMINAL
           MOVE LIB610-COD-USUARIO         TO STCOPY1-COD-USUARIO   
           MOVE LIB610-COD-OFICINA         TO STCOPY1-COD-OFICINA   
           MOVE LIB610-TERM-FISICO         TO STCOPY1-TERM-FISICO   

           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-OPE-AAAA-G 
           MOVE WS-FECCOM-MM               TO WS-FECHA-OPE-MM-G   
           MOVE WS-FECCOM-DD               TO WS-FECHA-OPE-DD-G 

           MOVE WS-FECHA-OPE-GUION         TO STCOPY1-FECHA-CONTA             
           MOVE SPACES                     TO STCOPY1-COD-APLICACION
           MOVE LIB610-DOMINIO-PAIS        TO STCOPY1-COD-PAIS
           MOVE "S"                        TO STCOPY1-IND-COMMIT.
           
           
       MOVER-DATOS-SFISERS470C.
      *------------------------
           MOVE SPACES TO WS-LIB470C
           MOVE LIB610-CODENT              TO L470C-CODENT     
           MOVE LIB610-CENTALTA            TO L470C-CENTALTA   
           MOVE LIB610-CUENTA              TO L470C-CUENTA     
           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA  
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-EDT-AAAA 
           MOVE WS-FECCOM-MM               TO WS-FECHA-EDT-MM   
           MOVE WS-FECCOM-DD               TO WS-FECHA-EDT-DD   
           MOVE WS-FECHA-EDITADA           TO L470C-FECHA     
           MOVE LIB610-COD-TRX             TO L470C-CODTRX     
           MOVE LIB610-COD-MONEDA          TO L470C-CLAMON     
           MOVE LIB610-IMP-TRX             TO L470C-IMPCAPITAL 
           MOVE WS-NUM-CUOTA               TO L470C-TOTCUOTAS  
           MOVE LIB610-MESES-CARENCIA      TO L470C-NUMMESCAR  
           MOVE "SSSSSSSSSSSS"             TO L470C-NUMMESFIN  
           MOVE WS-TASA_COMERCIAL          TO L470C-PORINT     
           MOVE WS-G1                      TO L470C-PORINGSIC  
           MOVE WS-TASA_CARENCIA           TO L470C-PORINTCAR  
           MOVE WS-G2                      TO L470C-PLAZO-G2   
           MOVE WS-GRUPO-COMISION          TO L470C-GRPCOMIS   
           MOVE WS-IND-PLAZO               TO L470C-INDPLACOMIS
           MOVE LIB610-COD-PAIS            TO L470C-CODPAIS    
           MOVE LIB610-COD-IDENT-RED       TO L470C-TIPFRAN    
           MOVE LIB610-COD-COMERCIO        TO L470C-CODCOM.     

       LLAMADA-SFISERS470C.
      *-------------------
           MOVE LIB470C                TO STCOPY1-MENSAJE.
           MOVE STCOPY1                TO INV-PARAMETROS1.

           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-SFISERS470C      TO  CODIGO_RUTINA OF MPMLOG
              MOVE STCOPY1             TO  MENSAJE_COPY  OF MPMLOG 
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF
  
           CALL  CT-SFISERS470C USING REGISTRO-INVOCACION1. 
   
 
           MOVE INV-PARAMETROS1 TO STCOPY1.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-SFISERS470C      TO  CODIGO_RUTINA OF MPMLOG
              MOVE STCOPY1             TO  MENSAJE_COPY  OF MPMLOG       
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

          
           MOVE STCOPY1-MENSAJE  TO LIB470C
 
           EVALUATE STCOPY1-COD-RESPUESTA 
               WHEN CT-CORRECTO-OK
                    CONTINUE 
               WHEN CT-INFOR-OK
                    CONTINUE
               WHEN OTHER
                    MOVE STCOPY1-COD-RESPUESTA TO LIB610-CODIGO-RETORNO
                    MOVE L470C-MENSAJE-ERROR   TO WS-MENSAJE-ATOMICO
                    PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE. 

       CARGAR-TABLA-PLAZOS.
      *--------------------
           MOVE ZEROES                  TO TB-ARREGLO-CUOTAS
           MOVE 1                       TO I
           MOVE ZEROS                   TO TB-CANT-CUOTAS-ARR
           PERFORM UNTIL I > 50
             IF   MP473-NUMMESCUOSUG(I) NOT EQUAL 0
RDC               MOVE MP473-MESCARCUOSUG(I) TO TB-NRO-CAREN(I)
                  MOVE MP473-NUMMESCUOSUG(I) TO TB-NRO-CUOTA(I)
                  MOVE MP473-NUMMESCUOSUG(I) TO LIB610-NRO-CUOTA(I)
                  MOVE MP473-IMPCUOTASUG(I)  TO LIB610-MTO-CUOTA(I)

                  MOVE I                     TO TB-CANT-CUOTAS-ARR
             END-IF
             
             IF MP473-INDCONTINUAR(I) = "@"
                ADD 50                  TO I
             ELSE
                ADD 1                    TO I
             END-IF
           END-PERFORM.
           
      * MOVER-DATOS-ATPC042.
      **--------------------
      *     INITIALIZE MPM0042.
      *     MOVE LIB610-CODENT  TO MP042-CODENT
      *     MOVE WS-LINEA-NUM   TO MP042-LINEA.
      *
      * LLAMADA-A-ATPC042.
      **----------------
      *     MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA.
      *     MOVE MPM0042                TO  MQCOPY-MENSAJE.
      *     MOVE "00"                   TO  MQCOPY-RETORNO.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC042          TO  CODIGO_RUTINA OF MPMLOG 
      *        MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     CALL  CT-ATPC042   USING  WS-MQCOPY.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC042          TO  CODIGO_RUTINA OF MPMLOG 
      *        MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     MOVE MQCOPY-MENSAJE         TO  MPM0042
      *
      *     EVALUATE MQCOPY-RETORNO
      *        WHEN CT-CORRECTO
      *             CONTINUE
      *        WHEN CT-INFOR
      *             CONTINUE
      *        WHEN CT-AVISO
      *             MOVE 165  TO  LIB610-CODIGO-RETORNO
      *             MOVE MQCOPY-MENS-AVISO-ERROR 
      *                                        TO WS-MENSAJE-ATOMICO
      *             PERFORM 999999-ERROR-PROGRAMA
      *        WHEN OTHER
      *           MOVE 165     TO  LIB610-CODIGO-RETORNO
      *           MOVE MQCOPY-MENS-AVISO-ERROR TO WS-MENSAJE-ATOMICO
      *           PERFORM 999999-ERROR-PROGRAMA
      *     END-EVALUATE.

      * CONSULTA-DATOS-BASICO-TARJETA.
      **------------------------------
      *     PERFORM MOVER-DATOS-MPM0405.
      *     PERFORM LLAMADA-A-ATD405.
      *
      * MOVER-DATOS-MPM0405.
      **--------------------
      *     INITIALIZE MPM0405.
      *     MOVE LIB610-PAN             TO  MP405-PAN.
      *
      * LLAMADA-A-ATD405.
      **----------------
      *     MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA.
      *     MOVE MPM0405                TO  MQCOPY-MENSAJE.
      *     MOVE "00"                   TO  MQCOPY-RETORNO.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATD405           TO  CODIGO_RUTINA OF MPMLOG 
      *        MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     CALL  CT-ATD405   USING  WS-MQCOPY.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATD405           TO  CODIGO_RUTINA OF MPMLOG 
      *        MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     MOVE MQCOPY-MENSAJE         TO  MPM0405.
      *
      *     EVALUATE MQCOPY-RETORNO
      *        WHEN CT-CORRECTO
      *             CONTINUE
      *        WHEN CT-INFOR
      *             CONTINUE
      *        WHEN CT-AVISO
      *             MOVE 99999      TO  LIB610-CODIGO-RETORNO
      *             MOVE MQCOPY-MENS-AVISO-ERROR 
      *                                      TO WS-MENSAJE-ATOMICO
      *             PERFORM 999999-ERROR-PROGRAMA
      *        WHEN OTHER
      *             MOVE 99999     TO  LIB610-CODIGO-RETORNO
      *             MOVE MQCOPY-MENS-AVISO-ERROR 
      *                                      TO WS-MENSAJE-ATOMICO
      *             PERFORM 999999-ERROR-PROGRAMA
      *     END-EVALUATE
      *     
      *     MOVE MP405-CODMAR            TO LIB610-MARCA
      *     MOVE MP405-INDTIPT           TO LIB610-TIPO
      *     MOVE MP405-CODENT            TO LIB610-CODENT
      *     MOVE MP405-CENTALTA          TO LIB610-CENTALTA
      *     MOVE MP405-CUENTA            TO LIB610-CUENTA.
      *      
       CONSULTA-CONTRATO.
      *------------------
           PERFORM MOVER-DATOS-LIB070R.
           PERFORM LLAMADA-A-ISER070.
      
       MOVER-DATOS-LIB070R.
      *--------------------
           INITIALIZE LIB070R.
           MOVE LIB610-CODENT          TO  LIB070R-CODENT.
           MOVE LIB610-CENTALTA        TO  LIB070R-CENTALTA.
           MOVE LIB610-CUENTA          TO  LIB070R-CUENTA.
      
       LLAMADA-A-ISER070.
      *-----------------
           MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA.
           MOVE LIB070R                TO  MQCOPY-MENSAJE.
           MOVE "00"                   TO  MQCOPY-RETORNO.
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ISER070          TO  CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ISER070   USING  WS-MQCOPY.
      
           IF SI-LOGGEA-SERVICIO
	      MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ISER070          TO  CODIGO_RUTINA OF MPMLOG 
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.
      
           MOVE MQCOPY-MENSAJE         TO  LIB070R.
      
           EVALUATE MQCOPY-RETORNO
              WHEN CT-CORRECTO
                   CONTINUE
              WHEN CT-INFOR
                   CONTINUE
              WHEN CT-AVISO 
                   MOVE 99999      TO  LIB610-CODIGO-RETORNO
                   MOVE MQCOPY-MENS-AVISO-ERROR 
                                            TO WS-MENSAJE-ATOMICO
                   PERFORM 999999-ERROR-PROGRAMA
              WHEN OTHER
                   MOVE 99999      TO  LIB610-CODIGO-RETORNO
                   MOVE MQCOPY-MENS-AVISO-ERROR 
                                            TO WS-MENSAJE-ATOMICO
                   PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.
           
           MOVE LIB070R-GRUPOLIQ        TO LIB610-GRUPOLIQ
           MOVE LIB070R-PRODUCTO        TO LIB610-PRODUCTO
           MOVE LIB070R-SUBPRODU        TO LIB610-SUBPRODU.
           
       CONSULTA-TARJETA-CONTRATO.
      *--------------------------
           PERFORM MOVER-ATDATTAS.
           PERFORM LLAMADA-ATE950.

       MOVER-ATDATTAS.
      *---------------
           INITIALIZE ATDATTAS.
           MOVE LIB610-PAN             TO  ATDATTAS-PAN.
           MOVE LIB610-CODENT          TO  ATDATTAS-CODENT  
           MOVE LIB610-CENTALTA        TO  ATDATTAS-CENTALTA
           MOVE LIB610-CUENTA          TO  ATDATTAS-CUENTA.  

       LLAMADA-ATE950.
      *---------------

           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE950           TO  CODIGO_RUTINA OF MPMLOG 
              MOVE ATDATTAS            TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATE950             USING  WS-ATDATTAS.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE950           TO  CODIGO_RUTINA OF MPMLOG 
              MOVE ATDATTAS            TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           EVALUATE ATDATTAS-CODRET
              WHEN 00
                   CONTINUE
              WHEN OTHER
                   MOVE 99999           TO  LIB610-CODIGO-RETORNO
                   MOVE ATDATTAS-VAR1-ERROR1 
                                        TO WS-MENSAJE-ATOMICO
                   PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.
           MOVE ATDATTAS-CODENT-SAL     TO LIB610-CODENT  
           MOVE ATDATTAS-CENTALTA-SAL   TO LIB610-CENTALTA
           MOVE ATDATTAS-CUENTA-SAL     TO LIB610-CUENTA
           MOVE ATDATTAS-PAN            TO LIB610-PAN.
           MOVE ATDATTAS-MARCA-SAL      TO LIB610-MARCA
           MOVE ATDATTAS-TIPO-SAL       TO LIB610-TIPO

           PERFORM CONSULTA-CONTRATO
           .           
      
       LLAMADA-SIMULACION-CC.
      *---------------------- 
           IF WS-SIMULACION = 'S'
              PERFORM SIMULA-COMPRA-CUOTAS
           ELSE
              PERFORM SIMULA-CUOTA-SUGERIDA
           END-IF.
           
       SIMULA-COMPRA-CUOTAS.
      *---------------------  
                   
           IF  TB-NRO-CUOTA(1) > ZEROS
           AND TB-NRO-CUOTA(1) IS NUMERIC
               PERFORM OPERACION-EN-CUOTA-PREVIO
               PERFORM  LLAMAR-A-TASAS               
SCT   *        PERFORM  MOVER-DATOS-A-PL-TASAS
SCT   *        PERFORM  LLAMADA-A-TASAS
               MOVE ZEROS TO MP544-IMPCUOTA
               PERFORM CALCULAR-TIPO-CC
      *LRO-TECNOCOM-E&Y1-I                           
               IF LIB610-MESES-CARENCIA > 0
                  PERFORM CALCULAR-MESES-CARENCIA
               END-IF
      *LRO-TECNOCOM-E&Y1-F                             
               PERFORM MOVER-DATOS-MPM0544
               PERFORM LLAMADA-A-ATD544
           END-IF.

       SIMULA-CUOTA-SUGERIDA.
      *----------------------
           MOVE 1                          TO I
SCT        IF SW-LIGHT = CT-CERO
RDC           OR LIB610-COD-OFICINA = '0039'
            PERFORM UNTIL I > 50
              IF  TB-NRO-CUOTA(I) > ZEROS
              AND TB-NRO-CUOTA(I) IS NUMERIC
                  PERFORM OPERACION-EN-CUOTA-PREVIO
                  PERFORM  LLAMAR-A-TASAS               
SCT   *           PERFORM  MOVER-DATOS-A-PL-TASAS
SCT   *           PERFORM  LLAMADA-A-TASAS
                  IF WO-STATUS-CODIGO = ZEROES
                     MOVE WO-TASA_COMERCIAL 
                                           TO MP473-INT-PLAN(I)
SCT                                           TB-TASA_COMERCIAL(I)                                           
                     MOVE WO-TASA_CARENCIA TO MP473-INT-CAREN(I) 
SCT                                           TB-TASA_CARENCIA(I)                      
                     MOVE WO-G1            TO MP473-INT-GSIC(I)
SCT                                           TB-G1(I)
SCT                  MOVE WO-G2            TO TB-G2(I)   	                     
                     MOVE TB-NRO-CUOTA(I)  TO MP473-NUMMESCUOSUG(I)
SCT                                           TB-NUM-CUOTAS(I)                     
RDC   *              MOVE LIB610-MESES-CARENCIA
RDC                  MOVE TB-NRO-CAREN(I)
                                           TO MP473-MESCARCUOSUG(I)
SCT                  MOVE WO-GRUPO-COMISION TO TB-GRUPO-COMISION(I)
SCT                  MOVE WO-IND-PLAZO      TO TB-IND-PLAZO(I)
                  END-IF
                  ADD 1                    TO I
              ELSE
                  MOVE 51                  TO I
              END-IF
            END-PERFORM
SCT        ELSE
SCT          MOVE 0  TO TB-CANT-CUOTAS-ARR
SCT        END-IF

      *    PERFORM LLENAR-MQCOPY          
      *    PERFORM MOVER-DATOS-ATE470
      *    MOVE LIB610-IMP-TRX             TO MP473-IMPFACSUG
           MOVE WS-T                       TO MP473-ALT-CONECO 
           MOVE WO-GRUPO-COMISION          TO MP473-COD-COMI
           
SCT        IF SW-LIGHT = CT-CERO
RDC           OR LIB610-COD-OFICINA = '0039'
              PERFORM LLAMADA-A-ATE470
              PERFORM CALCULAR-TIPO-CC
              PERFORM OBT-DIFERIDOS
           END-IF.
      *LRO-TECNOCOM-E&Y1-I                           
           IF LIB610-MESES-CARENCIA > 0
              PERFORM CALCULAR-MESES-CARENCIA
           END-IF.
      *LRO-TECNOCOM-E&Y1-F                             

        MOVER-SALIDA.
      *-------------
           IF WS-SIMULACION = 'S'
SCT   *       MOVE MP544-IMPCUOTA     TO LIB610-MTO-CUOTA(1) 
SCT           MOVE WS-IMPCUOTA        TO LIB610-MTO-CUOTA(1) 
              MOVE WS-TOTAL-COMISION  TO LIB610-IMP-COMISION
              MOVE LIB610-NRO-CUOTAS  TO LIB610-NRO-CUOTA(1)
              MOVE 1                  TO LIB610-CANT-CUOTAS-ARR
               
      *INI-SERNAC             
SCT   *       MOVE MP544-IMPTOTAL      TO LIB610-MTO-CTOTOT (1)
SCT   *       MOVE MP544-IMPUESTO      TO LIB610-ITE(1)  
SCT   *                                   WS-ITE 
SCT           MOVE WS-IMPTOTAL         TO LIB610-MTO-CTOTOT (1)
SCT           MOVE WS-IMPUESTO         TO LIB610-ITE(1)  
SCT                                       WS-ITE 
              MOVE LIB610-NRO-CUOTA(1) TO SF-NUM-CUO
              MOVE LIB610-MTO-CUOTA(1) TO SF-MTO-CUO
              
              PERFORM CALCULA-COSTO-TOTAL
              
              MOVE WS-CTO-TOTAL        TO LIB610-MTO-CTOTOT(1)
              
      *       COMPUTE LIB610-MTO-CUOTN(1) = (MP544-IMPTOTAL - 
SCT   *       COMPUTE WS-VALOR-CUOTA-N = (MP544-IMPTOTAL - 
SCT   *                               MP544-IMPCUOTA) / (SF-NUM-CUO - 1)
              COMPUTE WS-VALOR-CUOTA-N = (WS-IMPTOTAL - 
                                      WS-IMPCUOTA) / (SF-NUM-CUO - 1)
                      ON SIZE ERROR MOVE 0 TO WS-VALOR-CUOTA-N
              END-COMPUTE
                                      
              ADD WS-CUOTA-COMISION     TO WS-VALOR-CUOTA-N
              MOVE WS-VALOR-CUOTA-N     TO  LIB610-MTO-CUOTN(1)
      * INI-CAE
              IF LIB610-NRO-CUOTA(1) > 1    
                 PERFORM CALCULA-CAE
                 DISPLAY "WS413R-TASACAE " WS413R-TASACAE
                 MOVE WS413R-TASACAE TO LIB610-CAE(1)
RDC   *           SUBTRACT WS-CUOTA-COMISION FROM LIB610-MTO-CUOTA(1)
RDC   *           SUBTRACT WS-CUOTA-COMISION FROM LIB610-MTO-CUOTN(1)
              END-IF
              
             
      *        DISPLAY "WS-SIMULACION = 'S'..."
SCT   *       DISPLAY "MP544-IMPCUOTA... :  " MP544-IMPCUOTA
SCT   *       DISPLAY "MP544-IMPTOTAL... :  " MP544-IMPTOTAL
SCT   *        DISPLAY "WS-IMPCUOTA...... :  " WS-IMPCUOTA
SCT   *        DISPLAY "WS-IMPTOTAL...... :  " WS-IMPTOTAL
      *        DISPLAY "LIB610-NRO-CUOTAS :  " LIB610-NRO-CUOTAS
SCT   *       DISPLAY "MP544-IMPUESTO... :  " MP544-IMPUESTO
SCT   *        DISPLAY "WS-IMPUESTO...... :  " WS-IMPUESTO
      *        DISPLAY "WS-TOTAL-COMISION :  " WS-TOTAL-COMISION
      *        DISPLAY "WS-CUOTA-COMISION :  " WS-CUOTA-COMISION
      *        DISPLAY "WS-VALOR-CUOTA-N  :  " WS-VALOR-CUOTA-N
      *        DISPLAY "LIB610-MTO-CUOTN(1): " LIB610-MTO-CUOTN(1)
      *       DISPLAY "WS-CTO-TOTAL..... :  " WS-CTO-TOTAL
      *       DISPLAY "WS-ITE............:  " WS-ITE

      * FIN-CAE               
                         
      * FIN-SERNAC
           ELSE
              INITIALIZE LIB610-ARREGLO-CUOTAS
              MOVE 0                       TO LIB610-CANT-CUOTAS-ARR
              MOVE 1                       TO I
              MOVE 1                       TO J
              MOVE MP473-IMPCOMISION(1)    TO LIB610-IMP-COMISION

              IF LIB610-COD-OFICINA         = WX-SUCURSAL AND 
                 LIB610-COD-COMERCIO        = WX-COMERCIO
                 
                 IF WS-INDCREDITO = 2
                    MOVE 0                 TO LIB610-NRO-CUOTA(1)
                    MOVE 0                 TO LIB610-MTO-CUOTA(1)
                    MOVE 1                 TO I
                    MOVE 2                 TO J
                    MOVE 1                 TO LIB610-CANT-CUOTAS-ARR
                 END-IF
              END-IF
                    
              PERFORM UNTIL I > 10
                IF MP473-IMPCUOTASUG(I) > 0
                   MOVE J                     TO LIB610-CANT-CUOTAS-ARR
                   MOVE MP473-NUMMESCUOSUG(I) TO LIB610-NRO-CUOTA(J)
RDC   *            MOVE MP473-IMPCUOTASUG(I)  TO LIB610-MTO-CUOTA(J)
                   IF WO-GRUPO-COMISION = '00000' 
                                       OR '     '  
                                       OR '0    '
                      MOVE WS-SWINDPLZ        TO WO-IND-PLAZO
                   END-IF

                   IF WO-IND-PLAZO = CT-CUOTIZADA
                      DIVIDE MP473-IMPCOMISION(I) 
                          BY MP473-NUMMESCUOSUG(I)
                               GIVING WS-CUOTA-COMISION ROUNDED
                        ON SIZE ERROR MOVE 0 TO WS-CUOTA-COMISION
                      END-DIVIDE
                      ADD WS-CUOTA-COMISION TO LIB610-MTO-CUOTA(J)
                   END-IF

      *INI-SERNAC             
                   PERFORM MOVER-DATOS-MPM0544-CUO
                   PERFORM LLAMADA-A-ATD544                   
      *             IF MQCOPY-RETORNO = CT-CORRECTO OR
      *                MQCOPY-RETORNO = CT-INFOR
                   MOVE MP544-IMPTOTAL  TO LIB610-MTO-CTOTOT(J)
             
      *             END-IF

                   MOVE MP544-IMPUESTO      TO LIB610-ITE (J)
                                               WS-ITE                 
RDC                MOVE MP544-IMPCUOTA      TO LIB610-MTO-CUOTA(J)
                   MOVE LIB610-NRO-CUOTA(J) TO SF-NUM-CUO
                   MOVE LIB610-MTO-CUOTA(J) TO SF-MTO-CUO
                   DISPLAY "LLAMA CALCULA-COSTO-TOTAL"
                   DISPLAY "DESDE MOVER-SALIDA"

                   PERFORM CALCULA-COSTO-TOTAL

                   MOVE WS-CTO-TOTAL TO LIB610-MTO-CTOTOT(J)


                   COMPUTE WS-VALOR-CUOTA-N = (MP544-IMPTOTAL -
                                MP544-IMPCUOTA) / (SF-NUM-CUO - 1)
                           ON SIZE ERROR MOVE 0 TO WS-VALOR-CUOTA-N
                   END-COMPUTE

                   ADD WS-CUOTA-COMISION TO WS-VALOR-CUOTA-N
                   MOVE WS-VALOR-CUOTA-N TO LIB610-MTO-CUOTN(J)

      *        DISPLAY "WS-SIMULACION = 'S'..."
      *        DISPLAY "MP544-IMPCUOTA... :  " MP544-IMPCUOTA
      *        DISPLAY "MP544-IMPTOTAL... :  " MP544-IMPTOTAL
      *        DISPLAY "LIB610-NRO-CUOTAS :  " LIB610-NRO-CUOTAS
      *        DISPLAY "MP544-IMPUESTO... :  " MP544-IMPUESTO
      *        DISPLAY "WS-TOTAL-COMISION :  " WS-TOTAL-COMISION
      *        DISPLAY "WS-CUOTA-COMISION :  " WS-CUOTA-COMISION
      *        DISPLAY "WS-VALOR-CUOTA-N  :  " WS-VALOR-CUOTA-N
      *        DISPLAY "LIB610-MTO-CUOTN(J): " LIB610-MTO-CUOTN(J)
      *        DISPLAY "WS-CTO-TOTAL..... :  " WS-CTO-TOTAL

              DISPLAY "WS-ITE .......... :  " WS-ITE


      * INI-CAE
                   IF LIB610-NRO-CUOTA(J) > 1      
                      PERFORM CALCULA-CAE
                      DISPLAY "WS413R-TASACAE " WS413R-TASACAE
                      MOVE WS413R-TASACAE TO LIB610-CAE(J)
                      DISPLAY "LIB610-CAE(J) " j " " LIB610-CAE(J) 
RDC   *                SUBTRACT WS-CUOTA-COMISION 
RDC   *                                  FROM LIB610-MTO-CUOTA(J)
RDC   *                SUBTRACT WS-CUOTA-COMISION 
RDC   *                                  FROM LIB610-MTO-CUOTN(J)
                   END-IF
     
      * FIN-CAE  
      *FIN-SERNAC  
                             
                   ADD 1 TO J
                ELSE
      *            Inicio SCT    
                   IF MP473-NUMMESCUOSUG(I) >0
                      MOVE TB-NUM-CUOTAS(I)     TO WS-NUM-CUOTA
                      MOVE TB-TASA_COMERCIAL(I) TO WS-TASA_COMERCIAL
                      MOVE TB-G1(I)             TO WS-G1 
                      MOVE TB-TASA_CARENCIA(I)  TO WS-TASA_CARENCIA
                      MOVE TB-G2(I)             TO WS-G2
                      MOVE TB-GRUPO-COMISION(I) TO WS-GRUPO-COMISION
                      MOVE TB-IND-PLAZO(I)      TO WS-IND-PLAZO


      *                PERFORM MOVER-DATOS-SFISERS470C
      *                PERFORM LLAMADA-SFISERS470C
                      PERFORM OBTENER-IMPORTES-S470C


                      MOVE J                 TO LIB610-CANT-CUOTAS-ARR
                      MOVE WS-NUM-CUOTA      TO LIB610-NRO-CUOTA(J)
                      MOVE WS-IMPCUOTA       TO LIB610-MTO-CUOTA(J)
                      IF WO-GRUPO-COMISION = '00000' 
                                       OR '     '  
                                       OR '0    '
                         MOVE WS-SWINDPLZ        TO WO-IND-PLAZO
                      END-IF
                   
                      IF WO-IND-PLAZO = CT-CUOTIZADA
                         DIVIDE L470C-IMP-COMISION
                             BY WS-NUM-CUOTA
                                 GIVING WS-CUOTA-COMISION ROUNDED
                          ON SIZE ERROR MOVE 0 TO WS-CUOTA-COMISION
                         END-DIVIDE
                         ADD WS-CUOTA-COMISION TO LIB610-MTO-CUOTA(J)
                      END-IF

      *INI-SERNAC             
                      MOVE WS-IMPTOTAL         TO LIB610-MTO-CTOTOT(J)
                      MOVE WS-IMPUESTO         TO LIB610-ITE (J)
                                                  WS-ITE                 
                      MOVE LIB610-NRO-CUOTA(J) TO SF-NUM-CUO
                      MOVE LIB610-MTO-CUOTA(J) TO SF-MTO-CUO

                      PERFORM CALCULA-COSTO-TOTAL

                      MOVE WS-CTO-TOTAL TO LIB610-MTO-CTOTOT(J)


      *                COMPUTE WS-VALOR-CUOTA-N = (L470C-IMPTOTAL -
      *                          L470C-IMPCUOTA) / (SF-NUM-CUO - 1)
      *                     ON SIZE ERROR MOVE 0 TO WS-VALOR-CUOTA-N
      *                END-COMPUTE
                      COMPUTE WS-VALOR-CUOTA-N = (WS-IMPTOTAL -
                                WS-IMPCUOTA) / (SF-NUM-CUO - 1)
                           ON SIZE ERROR MOVE 0 TO WS-VALOR-CUOTA-N
                      END-COMPUTE

                      ADD WS-CUOTA-COMISION TO WS-VALOR-CUOTA-N
                      MOVE WS-VALOR-CUOTA-N TO LIB610-MTO-CUOTN(J)

                      IF LIB610-NRO-CUOTA(J) > 1      
                         PERFORM CALCULA-CAE
                         MOVE WS413R-TASACAE TO LIB610-CAE(J)
RDC   *                   SUBTRACT WS-CUOTA-COMISION 
RDC   *                                  FROM LIB610-MTO-CUOTA(J)
RDC   *                   SUBTRACT WS-CUOTA-COMISION 
RDC   *                                  FROM LIB610-MTO-CUOTN(J)                         
                      END-IF
                   ADD 1 TO J
                  END-IF
                END-IF
      *     FIN SCT                    
                ADD 1    TO I
              END-PERFORM
           END-IF
           .
           


*****************************************


      *----> MLG 08/02/2010, INI  
       BUSCAR-IND-RIESGO.
      *------------------
           PERFORM LLENAR-MQCOPY
           MOVE SPACES                 TO  IND-PAGINACION

           INITIALIZE MPML049

           MOVE LIB610-CODENT          TO  ML049-CODENT
           MOVE LIB610-PRODUCTO        TO  ML049-PRODUCTO(1)
           MOVE LIB610-SUBPRODU        TO  ML049-SUBPRODU(1)
           MOVE CT-152                 TO  ML049-CLAMON(1)
           MOVE CT-E                   TO  ML049-VERTIENTE           
           MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA
           MOVE MPML049                TO  MQCOPY-MENSAJE
           MOVE 0                      TO  WS-ERROR-RIESGO
                      
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE SPACES              TO  NOMBRE_RUTINA OF MPMLOG
              MOVE CT-ATPC049          TO  CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           CALL CT-ATPC049 USING WS-MQCOPY

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE SPACES              TO  NOMBRE_RUTINA OF MPMLOG
              MOVE CT-ATPC049          TO  CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY              TO  MENSAJE_COPY  OF MPMLOG

              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           EVALUATE MQCOPY-RETORNO
              WHEN  CT-MQCOPY-CORRECTO
                    CONTINUE
              WHEN  CT-MQCOPY-INFOR
                    CONTINUE
              WHEN  OTHER
                    MOVE 1 TO WS-ERROR-RIESGO
           END-EVALUATE

           MOVE MQCOPY-MENSAJE         TO  MPML049

      *==> ADDSYSTEM 19/05/2011 FVC-I
	  
           MOVE 2 TO WS-INDCREDITO.
	       MOVE 2 TO LIB610-INDCREDITO.
           DISPLAY "LIB610-INDCREDITO: " LIB610-INDCREDITO
           DISPLAY "ANTES DE LLAMAR A ATPC053"
      *==> ADDSYSTEM 19/05/2011 FVC-F
           
           IF WS-ERROR-RIESGO = 0
             PERFORM VARYING WS-IND FROM 1 BY 1 UNTIL WS-IND > 36
                IF ML049-CODCONECO(WS-IND) = 10
                   PERFORM LLAMADA-A-ATPC053
                   ADD  36 TO WS-IND
                END-IF
             END-PERFORM
           END-IF.

       LLAMADA-A-ATPC053.
      *------------------
           INITIALIZE MPM0053
           
           MOVE ML049-CODENT           TO MP053-CODENT
           MOVE ML049-PRODUCTO(WS-IND) TO MP053-PRODUCTO
           MOVE ML049-SUBPRODU(WS-IND) TO MP053-SUBPRODU
           MOVE ML049-CONPROD(WS-IND)  TO MP053-CONPROD
           MOVE ML049-DESCONP(WS-IND)  TO MP053-DESCONP
           MOVE CT-E                   TO MP053-VERTIENTE
           MOVE ML049-CODCONECO(WS-IND) TO MP053-CODCONECO(1)

           MOVE CT-RUTINA              TO MQCOPY-PROGRAMA
           MOVE MPM0053                TO MQCOPY-MENSAJE
           MOVE 0                      TO WS-ERROR-RIESGO
           
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO INDICADOR_I-O OF MPMLOG
              MOVE SPACES              TO NOMBRE_RUTINA OF MPMLOG
              MOVE CT-ATPC053          TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY              TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           CALL CT-ATPC053 USING WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO INDICADOR_I-O OF MPMLOG
              MOVE SPACES              TO NOMBRE_RUTINA OF MPMLOG
              MOVE CT-ATPC053          TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY              TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           EVALUATE MQCOPY-RETORNO
              WHEN  CT-MQCOPY-CORRECTO
                    CONTINUE
              WHEN  CT-MQCOPY-INFOR
                    CONTINUE
              WHEN  OTHER
                    MOVE 1 TO WS-ERROR-RIESGO
           END-EVALUATE
           
           IF WS-ERROR-RIESGO = 0
             MOVE MQCOPY-MENSAJE         TO  MPM0053
      *==> ADDSYSTEM 19/05/2011 FVC-I
	  
             MOVE 2 TO  WS-INDCREDITO
	         MOVE 2 TO LIB610-INDCREDITO
			 
      *==> ADDSYSTEM 19/05/2011 FVC-F
             IF MP053-PORTRAMO(WS-IND) =  CT-100
			 
      *==> ADDSYSTEM 19/05/2011 FVC-I

               MOVE 1 TO  WS-INDCREDITO
	           MOVE 1 TO LIB610-INDCREDITO
			   
      *==> ADDSYSTEM 19/05/2011 FVC-F
             END-IF
           END-IF
		     DISPLAY "EL RESULTADO DE ATPC053"
		     DISPLAY "LIB610-INDCREDITO: " LIB610-INDCREDITO.
      *----> MLG 08/02/2010, FIN


       OPERACION-EN-CUOTA-PREVIO.
      *--------------------------
           MOVE ZEROS                  TO WS-MESES-CARENCIA.
           INITIALIZE WS-TAB-CARENCIA.
           PERFORM PRIMER-VCTO-CON-NUMMESCOMPL.
           PERFORM LLENAR-VENCIMIENTOS-TASAS.
           PERFORM CALCULAR-DESFASE.
RDC        MOVE ATVTODIF-LIQ-CUOTA(1) TO WS-FECHA-AMD-VCTO
           MOVE 2                     TO WS-FECAREN 
           PERFORM VARYING WS-CAREVTO FROM 1 BY 1 UNTIL
                WS-CAREVTO >  CT-VALOR-90     
                MOVE ATVTODIF-LIQ-CUOTA(WS-FECAREN)  TO
                                  WS-FECCAREN(WS-CAREVTO)      
               ADD  1     TO  WS-FECAREN
               
           END-PERFORM.           
           
      ***   IF MP021-NUMMESCOMPL > ZEROS
      *     IF MP042-INDAPLDESF = "S"
      *       PERFORM PRIMER-VCTO-NUMMESCOMPL-IGUAL0
      *        MOVE ATVTODIF-FECHCOM(1:4) TO WS-FEC-COM-AAAA
      *        MOVE ATVTODIF-FECHCOM(6:2) TO WS-FEC-COM-MM
      *        MOVE ATVTODIF-FECHCOM(9:2) TO WS-FEC-COM-DD
      *        MOVE ATVTODIF-LIQ-CUOTA (1) TO WS-VTO-CUOTA
      *        MOVE WS-VTO-CUOTA(1:4)     TO WS-FEC-VTO-AAAA
      *        MOVE WS-VTO-CUOTA(6:2)     TO WS-FEC-VTO-MM
      *        MOVE WS-VTO-CUOTA(9:2)     TO WS-FEC-VTO-DD
      *        IF FECHVTO > 0
      *           PERFORM RESCATA-DIAS-DESFASE
      *           MOVE SQLCODE TO ATSQLERR
      *           IF NOT ACCESO-CORRECTO-BD
      *              MOVE ZEROS           TO  DIASDESFASE
      *           END-IF
      *        END-IF  
      *     ELSE
      *        MOVE ZEROS                 TO  DIASDESFASE
      *     END-IF.

       CALCULAR-DESFASE.
      *------------------
           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA.
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-EDT-AAAA.
           MOVE WS-FECCOM-MM               TO WS-FECHA-EDT-MM.
           MOVE WS-FECCOM-DD               TO WS-FECHA-EDT-DD.

           SET NO-PROCESAR-ISER325     TO TRUE

           IF L325R-CODENT = ZEROES OR SPACES OR 
              L325R-CODENT <> ATDATTAS-CODENT-SAL
              SET SI-PROCESAR-ISER325 TO TRUE
           END-IF

           IF L325R-CENTALTA = ZEROES OR SPACES OR 
              L325R-CENTALTA <> ATDATTAS-CENTALTA-SAL
              SET SI-PROCESAR-ISER325 TO TRUE
           END-IF

           IF L325R-CUENTA = ZEROES OR SPACES OR 
              L325R-CUENTA <> ATDATTAS-CUENTA-SAL
              SET SI-PROCESAR-ISER325 TO TRUE
           END-IF

           IF L325R-PAN = ZEROES
              SET SI-PROCESAR-ISER325 TO TRUE
           END-IF

           IF L325R-FECFAC = ZEROES OR SPACES OR 
              L325R-FECFAC <> WS-FECHA-EDITADA
              SET SI-PROCESAR-ISER325 TO TRUE
           END-IF

           IF L325R-LINEA = ZEROES OR SPACES OR 
              L325R-LINEA <> WS-LINEA-NUM
              SET SI-PROCESAR-ISER325 TO TRUE
           END-IF

           IF SI-PROCESAR-ISER325

              INITIALIZE WS-LIB325R
              MOVE ATDATTAS-CODENT-SAL        TO L325R-CODENT
              MOVE ATDATTAS-CENTALTA-SAL      TO L325R-CENTALTA
              MOVE ATDATTAS-CUENTA-SAL        TO L325R-CUENTA
              MOVE SPACES                     TO L325R-PAN
              MOVE WS-FECHA-EDITADA           TO L325R-FECFAC
              MOVE WS-LINEA-NUM               TO L325R-LINEA
 
              IF SI-LOGGEA-SERVICIO
                 MOVE "I"                TO INDICADOR_I-O OF MPMLOG
                 MOVE "325"              TO CODIGO_RUTINA OF MPMLOG
                 MOVE SPACES             TO NOMBRE_RUTINA OF MPMLOG
                 MOVE WS-LIB325R         TO MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
              END-IF
 
              CALL CT-ISER325                 USING WS-LIB325R
 
              IF SI-LOGGEA-SERVICIO
                 MOVE "O"                TO INDICADOR_I-O OF MPMLOG
                 MOVE "325"              TO CODIGO_RUTINA OF MPMLOG
                 MOVE SPACES             TO NOMBRE_RUTINA OF MPMLOG
                 MOVE WS-LIB325R         TO MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
              END-IF
 
              EVALUATE L325R-COD-RETORNO
                 WHEN  00
                       MOVE L325R-DIASDESFASE TO DIASDESFASE
                 WHEN OTHER
                       MOVE 00                TO DIASDESFASE
              END-EVALUATE

           END-IF
           .

       MOVER-DATOS-MPM0544.
      *-------------------
           INITIALIZE MPM0544.
RDC  *     MOVE 0001                     TO MP544-TIPFRAN.
           MOVE LIB610-COD-IDENT-RED     TO MP544-TIPFRAN.
           
           PERFORM BUSCAR-CODIGO-ACTIVIDAD
           MOVE  MP856-CODACT            TO MP544-CODACT

           IF LIB610-COD-TRX = 0008 OR 0300
              MOVE 1200                  TO MP544-TIPMSGON
              MOVE 340000                TO MP544-CODPROON
           ELSE                          
              MOVE 1200                  TO MP544-TIPMSGON
              MOVE 040000                TO MP544-CODPROON
           END-IF.
           MOVE LIB610-COD-PAIS          TO MP544-CODPAIS
           MOVE WO-GRUPO-COMISION        TO MP544-COD-COMI
           
           IF WO-GRUPO-COMISION = '00000' OR '     '  OR '0    '
              MOVE WS-SWINDPLZ   TO WO-IND-PLAZO
           END-IF
           
           
      *     MOVE MP405-CODENT             TO MP544-CODENT.
      *     MOVE MP405-CENTALTA           TO MP544-CENTALTA.
      *     MOVE MP405-CUENTA             TO MP544-CUENTA.
           MOVE ATDATTAS-CODENT-SAL      TO MP544-CODENT.
           MOVE ATDATTAS-CENTALTA-SAL    TO MP544-CENTALTA.
           MOVE ATDATTAS-CUENTA-SAL      TO MP544-CUENTA.

           MOVE LIB610-COD-COMERCIO      TO MP544-CODCOM.
           MOVE WS-LINEA-NUM             TO MP544-LINEA.
           MOVE LIB610-PAN               TO MP544-PAN.
           MOVE LIB610-COD-MONEDA        TO MP544-CLAMON.
           MOVE LIB610-IMP-TRX           TO MP544-IMPFAC.
           MOVE TB-NRO-CUOTA (1)         TO MP544-TOTCUOTAS.
           MOVE LIB610-MESES-CARENCIA    TO MP544-MESCARENCIA.
           
           MOVE ATRUTTCC-CODTIPC         TO MP544-CODTIPC
           MOVE CT-U                     TO MP544-ALT-CONECO.
           MOVE WO-TASA_COMERCIAL        TO MP544-PORINT.
           MOVE WO-TASA_CARENCIA         TO MP544-INTCARENCIA.
           MOVE ZEROS                    TO MP544-IMPUESTO.
           MOVE WO-G1                    TO MP544-TASA-GSIC.
           MOVE TB-NRO-CUOTA(1)          TO MP544-PLAZO-GSIC2.
           MOVE DIASDESFASE              TO MP544-DIAS-DESFAS.
           MOVE LIB610-COD-TRX           TO MP544-CODTRAN
           MOVE "SSSSSSSSSSSS"           TO MP544-NUMMESFIN.
           MOVE WO-IND-PLAZO             TO MP544-PLAZO-COM-E.
RDC        MOVE WS-FECHA-SYS             TO MP544-FECALTA.

       BUSCAR-CODIGO-ACTIVIDAD.
      *------------------------
           INITIALIZE MPM0856.
      *     MOVE MP405-CODENT             TO MP856-CODENT.
           MOVE ATDATTAS-CODENT-SAL      TO MP856-CODENT.
           MOVE LIB610-COD-COMERCIO      TO MP856-CODCOM.

           MOVE CT-RUTINA                TO MQCOPY-PROGRAMA.
           MOVE MPM0856                  TO MQCOPY-MENSAJE.
           MOVE CT-U                     TO IND-PAGINACION.
           MOVE "00"                     TO MQCOPY-RETORNO.

           IF SI-LOGGEA-SERVICIO
              MOVE "I"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE856             TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATE856               USING WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE856             TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           MOVE MQCOPY-MENSAJE           TO MPM0856.

           EVALUATE MQCOPY-RETORNO
              WHEN  CT-CORRECTO
                    CONTINUE
              WHEN  CT-INFOR
                    CONTINUE
              WHEN OTHER
                   MOVE 180             TO  LIB610-CODIGO-RETORNO
                   STRING 
                      MQCOPY-TEXT1-AVISO1
                      MQCOPY-TEXT2-AVISO1
                      MQCOPY-TEXT1-AVISO2
                      MQCOPY-TEXT2-AVISO2
                      DELIMITED BY SIZE
                      INTO WS-MENSAJE-ATOMICO
                   END-STRING
                   PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.


       CALCULAR-TIPO-CC.
      *------------------
           DISPLAY "INICIO TIPO CC".
           MOVE LIB610-CODENT              TO WS-CODENT.
           MOVE LIB610-COD-IDENT-RED(8:4)  TO WS-TIPFRAN.
           IF LIB610-COD-TRX = 0008 OR 0300
              MOVE 1200                 TO WS-TIPOMSGON
              MOVE 340000               TO WS-CODPROON 
           ELSE
              MOVE 1200                 TO WS-TIPOMSGON
              MOVE 040000               TO WS-CODPROON 
           END-IF.

           MOVE LIB610-COD-ACT-ORI         TO WS-CAMPO1.
           MOVE LIB610-COD-MONEDA          TO WS-CAMPO2.
           MOVE LIB610-COD-PAIS            TO WS-CAMPO3.

           MOVE LIB610-CODENT              TO WS-CODENT-ADQ.
           MOVE WS-CODENT-ADQ              TO WS-COD-ID-ADQ.
           MOVE WS-COD-ID-ADQ              TO WS-CAMPO4.

           MOVE LIB610-COD-COMERCIO        TO WS-CAMPO5.
           MOVE "00"                       TO WS-CAMPO6.
           MOVE LIB610-COD-TRX             TO WS-CAMPO7.

           PERFORM BUSCA-INDICADOR-OPERATIVIDAD
           
      *    MOVE WO-IND-PLAZO               TO WS-CAMPO8.           
           MOVE WS-INDDEBCRE               TO WS-CAMPO8.           
           MOVE WO-GRUPO-COMISION          TO WS-CAMPO9.

           MOVE WS-ENTRADA                 TO ATUSCOM-E-DATOS.
           
           DISPLAY "CALCULANDO TIPO FACTURA"
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                     TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR740               TO  CODIGO_RUTINA OF MPMLOG 
              MOVE ATUSCOM                 TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.
           
           CALL CT-ATR740                  USING ATUSCOM.
           
           DISPLAY "SALIO DE TIPO FACTURA "
           IF SI-LOGGEA-SERVICIO
              MOVE "O"                     TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR740               TO  CODIGO_RUTINA OF MPMLOG 
              MOVE ATUSCOM                 TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.
           DISPLAY "ATUSCOM-RETORNO: "
           DISPLAY ATUSCOM-S-RETORNO
           IF ATUSCOM-S-RETORNO = '00'
              MOVE ATUSCOM-S-DATOS        TO WS-SALIDA
              DISPLAY "TIPO FACTURA :"
              DISPLAY WS-TIPO-FAC-SAL
           ELSE
              INITIALIZE WS-SALIDA
              MOVE 30                     TO L310R-RETORNO
              MOVE "ERROR AL OBTENER TIPOFAC (ATR740)"
                                          TO L310R-GLOSA-SALIDA
           END-IF.
           DISPLAY "WS-TIPO-FAC-SAL: " WS-TIPO-FAC-SAL
           INITIALIZE ATRUTTCC
                   REPLACING NUMERIC DATA BY ZEROES
                          ALPHANUMERIC DATA BY SPACES
           SET ATRUTTCC-SI-RECARGA        TO TRUE

           
           MOVE LIB610-CODENT             TO ATRUTTCC-CODENT
           MOVE WS-TIPO-FAC-SAL           TO ATRUTTCC-TIPOFAC
           IF WO-TASA_COMERCIAL EQUAL ZEROES
              MOVE CT-NO                  TO ATRUTTCC-INDFINAN
           ELSE
              MOVE CT-SI                  TO ATRUTTCC-INDFINAN
           END-IF
           MOVE SPACES                    TO ATRUTTCC-CONDICION
           MOVE SPACES                    TO ATRUTTCC-FECHA
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                    TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR545              TO  CODIGO_RUTINA OF MPMLOG 
              MOVE ATRUTTCC               TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.
           DISPLAY "LLAMA ATR545"
           CALL CT-ATR545                 USING ATRUTTCC

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                    TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR545              TO  CODIGO_RUTINA OF MPMLOG 
              MOVE ATRUTTCC               TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.
           
           IF NOT ATRUTTCC-CODRET-OK
              MOVE 30                     TO LIB610-CODIGO-RETORNO
              MOVE "ERROR AL OBTENER TIPO COMPRA CUOTA (ATR545)"
                                          TO LIB610-DESCRIP-ERROR
           END-IF.
           
           MOVE ATRUTTCC-CODTIPC  TO VAR-CODTIPC.
           
       BUSCA-INDICADOR-OPERATIVIDAD.
      *-----------------------------
           MOVE 1         TO WS-INDDEBCRE.
           MOVE "N"       TO WS-ENCONTRO-OPERATIVIDAD.
           
           PERFORM VARYING WS-IO FROM 1 BY 1 UNTIL WS-IO > 13
                           OR WS-ENCONTRO-OPERATIVIDAD = "S"
                           
      *          IF  MP025-CODMAR(WS-IO) = MP405-CODMAR AND
      *              MP025-INDTIPT(WS-IO) = MP405-INDTIPT
                IF  MP025-CODMAR(WS-IO) = ATDATTAS-MARCA-SAL AND
                    MP025-INDTIPT(WS-IO) = ATDATTAS-TIPO-SAL
                    MOVE MP025-INDDEBCRE(WS-IO) TO WS-INDDEBCRE
                    MOVE "S" TO WS-ENCONTRO-OPERATIVIDAD
                END-IF
           END-PERFORM.

       LLAMADA-A-ATD544.
      *----------------
           MOVE CT-RUTINA                TO MQCOPY-PROGRAMA.
           MOVE MPM0544                  TO MQCOPY-MENSAJE.
           MOVE "00"                     TO MQCOPY-RETORNO.
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATD544             TO CODIGO_RUTINA OF MPMLOG 
              MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATD544            USING WS-MQCOPY.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATD544             TO CODIGO_RUTINA OF MPMLOG 
              MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           MOVE MQCOPY-MENSAJE           TO MPM0544.

           IF SI-LOGGEA-SERVICIO
             MOVE "O"                    TO INDICADOR_I-O OF MPMLOG
             MOVE "CUOTA-544"            TO CODIGO_RUTINA OF MPMLOG 
             MOVE MPM0544                TO MENSAJE_COPY  OF MPMLOG
             PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

      *----------------
SCT        MOVE 0   TO SW-ERROR-DISPONIBLE
           IF LIB610-NRO-CUOTAS > 0 
              IF MQCOPY-COD-ERROR = 'MPA0614' OR
      *  ERROR DE DISPONIBLE ENTREGADO POR SAT      
                 MQCOPY-COD-ERROR = 'MPE0739'
      *NBV por ERROR de Codigo de Bloqueo
                 MOVE 1   TO SW-ERROR-DISPONIBLE
              ELSE        
               IF MQCOPY-ERROR OR MQCOPY-ERROR-DB2 
                  OR MQCOPY-ROLLBACK OR MQCOPY-CICS-IMS
                STRING 
                      MQCOPY-TEXT1-AVISO1
                      MQCOPY-TEXT2-AVISO1
                      MQCOPY-TEXT1-AVISO2
                      MQCOPY-TEXT2-AVISO2
                      DELIMITED BY SIZE
                      INTO WS-MENSAJE-ATOMICO
                 END-STRING
                MOVE 99999 TO  LIB610-CODIGO-RETORNO
                PERFORM 999999-ERROR-PROGRAMA
               ELSE 
                IF MQCOPY-AVISO
                   STRING 
                         MQCOPY-TEXT1-AVISO1
                         MQCOPY-TEXT2-AVISO1
                         MQCOPY-TEXT1-AVISO2
                         MQCOPY-TEXT2-AVISO2
                      DELIMITED BY SIZE
                      INTO WS-MENSAJE-ATOMICO
                     END-STRING
                  MOVE 99999 TO  LIB610-CODIGO-RETORNO
                  PERFORM 999999-ERROR-PROGRAMA
                END-IF
                END-IF
              END-IF
           END-IF.
                            
           MOVE 0 TO WS-TOTAL-COMISION
SCT        MOVE 0 TO WS-IMPCUOTA 
SCT                  WS-IMPTOTAL
SCT                  WS-IMPUESTO
      *     IF MP544-PLAZO-COM1 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO1 > 0
      *        SUBTRACT MP544-IMPBONECO1 FROM 
      *                 MP544-IMPBRUECO1 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM2 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO2 > 0
      *        SUBTRACT MP544-IMPBONECO2 FROM 
      *                 MP544-IMPBRUECO2 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM3 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO3 > 0
      *        SUBTRACT MP544-IMPBONECO3 FROM 
      *                 MP544-IMPBRUECO3 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM4 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO4 > 0
      *        SUBTRACT MP544-IMPBONECO4 FROM 
      *                 MP544-IMPBRUECO4 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM5 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO5 > 0
      *        SUBTRACT MP544-IMPBONECO5 FROM 
      *                 MP544-IMPBRUECO5 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM1 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO6 > 0
      *        SUBTRACT MP544-IMPBONECO6 FROM 
      *                 MP544-IMPBRUECO6 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM7 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO7 > 0
      *        SUBTRACT MP544-IMPBONECO7 FROM 
      *                 MP544-IMPBRUECO7 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM8 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO8 > 0
      *        SUBTRACT MP544-IMPBONECO8 FROM 
      *                 MP544-IMPBRUECO8 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM9 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO9 > 0
      *        SUBTRACT MP544-IMPBONECO9 FROM 
      *                 MP544-IMPBRUECO9 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF
      *
      *     IF MP544-PLAZO-COM10 = CT-CUOTIZADA AND 
      *        MP544-IMPBRUECO10 > 0
      *        SUBTRACT MP544-IMPBONECO10 FROM 
      *                 MP544-IMPBRUECO10 GIVING WS-MONTO-COMISION
      *        ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
      *     END-IF

SCT        IF SW-ERROR-DISPONIBLE = 1
SCT           MOVE LIB610-NRO-CUOTAS TO WS-NUM-CUOTA
SCT           MOVE WO-TASA_COMERCIAL TO WS-TASA_COMERCIAL
SCT           MOVE WO-G1             TO WS-G1
SCT           MOVE WO-TASA_CARENCIA  TO WS-TASA_CARENCIA
SCT           MOVE WO-G2             TO WS-G2
SCT           MOVE WO-GRUPO-COMISION TO WS-GRUPO-COMISION
SCT           MOVE WO-IND-PLAZO      TO WS-IND-PLAZO

SCT   *        PERFORM MOVER-DATOS-SFISERS470C
SCT   *        PERFORM LLAMADA-SFISERS470C
              PERFORM OBTENER-IMPORTES-S470C

SCT        ELSE
	           IF MP544-IMPBRUECO1 > 0
	              SUBTRACT MP544-IMPBONECO1 FROM 
	                       MP544-IMPBRUECO1 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO2 > 0
	              SUBTRACT MP544-IMPBONECO2 FROM 
	                       MP544-IMPBRUECO2 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO3 > 0
	              SUBTRACT MP544-IMPBONECO3 FROM 
	                       MP544-IMPBRUECO3 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO4 > 0
	              SUBTRACT MP544-IMPBONECO4 FROM 
	                       MP544-IMPBRUECO4 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO5 > 0
	              SUBTRACT MP544-IMPBONECO5 FROM 
	                       MP544-IMPBRUECO5 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO6 > 0
	              SUBTRACT MP544-IMPBONECO6 FROM 
	                       MP544-IMPBRUECO6 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO7 > 0
	              SUBTRACT MP544-IMPBONECO7 FROM 
	                       MP544-IMPBRUECO7 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO8 > 0
	              SUBTRACT MP544-IMPBONECO8 FROM 
	                       MP544-IMPBRUECO8 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO9 > 0
	              SUBTRACT MP544-IMPBONECO9 FROM 
	                       MP544-IMPBRUECO9 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-IMPBRUECO10 > 0
	              SUBTRACT MP544-IMPBONECO10 FROM 
	                     MP544-IMPBRUECO10 GIVING WS-MONTO-COMISION
	              ADD WS-MONTO-COMISION TO WS-TOTAL-COMISION
	           END-IF
	
	           IF MP544-PLAZO-COM1  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM2  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM3  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM4  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM5  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM6  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM7  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM8  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM9  = CT-CUOTIZADA OR
	              MP544-PLAZO-COM10 = CT-CUOTIZADA
	
	              IF WS-TOTAL-COMISION > 0 
	                 DIVIDE WS-TOTAL-COMISION BY 
	                     MP544-TOTCUOTAS
	                      GIVING WS-CUOTA-COMISION ROUNDED
	                      ON SIZE ERROR MOVE 0 TO WS-CUOTA-COMISION
	                 END-DIVIDE
	                 ADD WS-CUOTA-COMISION TO MP544-IMPCUOTA
	              END-IF
	           END-IF
SCT          MOVE MP544-IMPCUOTA     TO WS-IMPCUOTA
SCT          MOVE MP544-IMPTOTAL     TO WS-IMPTOTAL
SCT          MOVE MP544-IMPUESTO     TO WS-IMPUESTO
           END-IF.

           
      * INFORMACION-DESFASE-ENTIDAD.
      **----------------------------
      *     PERFORM MOVER-DATOS-MPM0021.
      *     PERFORM LLAMADA-A-ATPC021.

      * MOVER-DATOS-MPM0021.
      **--------------------
      *     INITIALIZE MPM0021.
      **     MOVE MP405-CODENT             TO MP021-CODENT.
      *     MOVE ATDATTAS-CODENT-SAL      TO MP021-CODENT.
      *
      * LLAMADA-A-ATPC021.
      **------------------
      *     MOVE CT-RUTINA                TO MQCOPY-PROGRAMA.
      *     MOVE MPM0021                  TO MQCOPY-MENSAJE.
      *     MOVE CT-U                     TO IND-PAGINACION.
      *     MOVE "00"                     TO MQCOPY-RETORNO.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "I"                   TO INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC021            TO CODIGO_RUTINA OF MPMLOG
      *        MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     CALL  CT-ATPC021           USING WS-MQCOPY.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "O"                   TO INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC021            TO CODIGO_RUTINA OF MPMLOG
      *        MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF.
      *
      *     MOVE MQCOPY-MENSAJE           TO MPM0021.
      *
      *     EVALUATE MQCOPY-RETORNO
      *        WHEN  CT-CORRECTO
      *              CONTINUE
      *        WHEN  CT-INFOR
      *              CONTINUE
      *        WHEN CT-AVISO 
      *             MOVE 180             TO  LIB610-CODIGO-RETORNO
      *             STRING 
      *                MQCOPY-TEXT1-AVISO1
      *                MQCOPY-TEXT2-AVISO1
      *                MQCOPY-TEXT1-AVISO2
      *                MQCOPY-TEXT2-AVISO2
      *                DELIMITED BY SIZE
      *                INTO WS-MENSAJE-ATOMICO
      *             END-STRING
      *             PERFORM 999999-ERROR-PROGRAMA
      *        WHEN OTHER
      *             MOVE 180             TO  LIB610-CODIGO-RETORNO
      *             STRING 
      *                MQCOPY-TEXT1-AVISO1
      *                MQCOPY-TEXT2-AVISO1
      *                MQCOPY-TEXT1-AVISO2
      *                MQCOPY-TEXT2-AVISO2
      *                DELIMITED BY SIZE
      *                INTO WS-MENSAJE-ATOMICO
      *             END-STRING
      *             PERFORM 999999-ERROR-PROGRAMA
      *     END-EVALUATE.

       PRIMER-VCTO-CON-NUMMESCOMPL.
      *----------------------------
           PERFORM VALIDAR-PROCESAR-ATE568
           IF SI-PROCESAR-ATE568
              PERFORM MOVER-DATOS-ATVTODIF
              PERFORM LLAMADA-A-ATE568
           END-IF
           .

       VALIDAR-PROCESAR-ATE568.
           SET NO-PROCESAR-ATE568 TO TRUE
           IF ATVTODIF-CODENT = ZEROES OR SPACES OR 
              ATVTODIF-CODENT <> ATDATTAS-CODENT-SAL
              SET SI-PROCESAR-ATE568 TO TRUE
           END-IF

           IF ATVTODIF-PAN = ZEROES OR SPACES OR 
              ATVTODIF-PAN <> ATDATTAS-PAN
              SET SI-PROCESAR-ATE568 TO TRUE
           END-IF

           IF ATVTODIF-LINEA = ZEROES OR SPACES OR 
              ATVTODIF-LINEA <> WS-LINEA-NUM
              SET SI-PROCESAR-ATE568 TO TRUE
           END-IF
           
           IF ATVTODIF-FECHCOM = ZEROES OR SPACES OR 
              ATVTODIF-FECHCOM <> WS-FECHA-SYS
              SET SI-PROCESAR-ATE568 TO TRUE
           END-IF
           
           IF ATVTODIF-FECHVTO = ZEROES OR 
              ATVTODIF-FECHVTO <> SPACES
              SET SI-PROCESAR-ATE568 TO TRUE
           END-IF
           
           IF ATVTODIF-INDLIQCAR = ZEROES OR SPACES OR 
              ATVTODIF-INDLIQCAR <> CT-PRIMER-VTO-DES
              SET SI-PROCESAR-ATE568 TO TRUE
           END-IF
           
           IF ATVTODIF-MES-CAREN = SPACES OR 
              ATVTODIF-MES-CAREN <> WS-MESES-CARENCIA
              SET SI-PROCESAR-ATE568 TO TRUE
           END-IF
           .


      * PRIMER-VCTO-NUMMESCOMPL-IGUAL0.
      **-------------------------------
      *     MOVE ZEROS                  TO  MP021-NUMMESCOMPL.
      *     PERFORM MOVER-DATOS-ATVTODIF.
      *     PERFORM LLAMADA-A-ATE568.

       MOVER-DATOS-ATVTODIF.
      *---------------------
           INITIALIZE  ATVTODIF.
      *     MOVE MP405-CODENT           TO  ATVTODIF-CODENT.
      *     MOVE MP405-PAN              TO  ATVTODIF-PAN.
           MOVE ATDATTAS-CODENT-SAL    TO  ATVTODIF-CODENT.
           MOVE ATDATTAS-PAN           TO  ATVTODIF-PAN.
           MOVE WS-LINEA-NUM           TO  ATVTODIF-LINEA.
           MOVE WS-FECHA-SYS           TO  ATVTODIF-FECHCOM.
           MOVE SPACES                 TO  ATVTODIF-FECHVTO.
      *LRO-TECNOCOM-DESFASE-INI           
      *     MOVE CT-PRIMER-VTO          TO  ATVTODIF-INDLIQCAR.
           MOVE CT-PRIMER-VTO-DES      TO  ATVTODIF-INDLIQCAR.
      *LRO-TECNOCOM-DESFASE-INI           
           MOVE WS-MESES-CARENCIA      TO  ATVTODIF-MES-CAREN.

       LLAMADA-A-ATE568.
      *-----------------
           MOVE CT-RUTINA              TO  MQCOPY-PROGRAMA.
           MOVE WS-ATVTODIF            TO  MQCOPY-MENSAJE.
           MOVE "00"                   TO  MQCOPY-RETORNO.
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE568           TO  CODIGO_RUTINA OF MPMLOG 
              MOVE WS-ATVTODIF         TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATE568   USING  ATVTODIF.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ATE568           TO  CODIGO_RUTINA OF MPMLOG 
              MOVE WS-ATVTODIF         TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           EVALUATE ATVTODIF-CODRET
              WHEN CT-CORRECTO-OK
                   CONTINUE
              WHEN CT-INFOR-BD
                   CONTINUE
              WHEN OTHER
                   MOVE 173                 TO LIB610-CODIGO-RETORNO
                   MOVE SPACES TO WS-MENSAJE-ATOMICO
                   PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.

      *INI-CAE           
           MOVE 1                     TO WS-FEC1V   
      * 2013-02-13        
NBV   *    IF  WS-MESES-CARENCIA > 0
NBV   *        ADD WS-MESES-CARENCIA  TO WS-FEC1V
           IF   LIB610-MESES-CARENCIA > 0
               ADD  LIB610-MESES-CARENCIA  TO WS-FEC1V
           END-IF
           MOVE ATVTODIF-LIQ-CUOTA(WS-FEC1V)  
                                       TO WS-VTO-CUOTA          
           MOVE WS-VTO-CUOTA(1:4)     TO WS-FECHA-A-CAE
           MOVE WS-VTO-CUOTA(6:2)     TO WS-FECHA-M-CAE
           MOVE WS-VTO-CUOTA(9:2)     TO WS-FECHA-D-CAE.

      *FIN-CAE


       LLAMAR-A-TASAS.
      *---------------
           IF LIB610-IMP-PIE > 0 AND LIB610-CANT-ARTICULOS > 0
SCT           PERFORM PRORRATEAR-MONTO-CAPITAL
              COMPUTE WS-TOPE-ART = WSAAT-CANT-ARTICULOS * CT-38
           ELSE
SCT   *       IF LIB610-CANT-ARTICULOS = ZEROES
SCT           IF LIB610-CANT-ARTICULOS > 0              
SCT   *          MOVE LIB610-IMP-TRX      TO LIB610-MONTO-CAPITAL(1)
SCT   *          MOVE CT-14 TO WS-TOPE-ART
SCT   *       ELSE
                 COMPUTE WS-TOPE-ART = WSAAT-CANT-ARTICULOS * CT-38
              END-IF
           END-IF.

           PERFORM SOLICITUD-TASAS-FINANCIAMIENTO.

       PRORRATEAR-MONTO-CAPITAL.
      *-------------------------
SCT   *    MOVE ZEROS TO WS-ACUM-CAPITAL.
SCT        MOVE ZEROS TO I-IND.
SCT        IF LIB610-CANT-ARTICULOS > 0
SCT           PERFORM VARYING WS-AAT FROM 1 BY 1 UNTIL WS-AAT > 40
SCT                               OR WS-AAT > LIB610-CANT-ARTICULOS
SCT              IF LIB610-MONTO-CAPITAL(WS-AAT) > 0
SCT                 ADD 1         TO I-IND
SCT                 MOVE LIB610-MONTO-CAPITAL(WS-AAT) TO  
SCT                           WSAAT-MONTO-CAPITAL(I-IND)
SCT              END-IF
SCT           END-PERFORM
SCT        END-IF.
           
           ADD LIB610-IMP-TRX TO LIB610-IMP-PIE GIVING WS-IMP-TOT-TRX.
           PERFORM VARYING I-IND FROM 1 BY 1 
SCT   *                  UNTIL I-IND = LIB610-CANT-ARTICULOS
SCT                      UNTIL I-IND > WSAAT-CANT-ARTICULOS
               COMPUTE WS-MONTO-ENTERO ROUNDED =
      *          (LIB610-MONTO-CAPITAL(I-IND) * LIB610-IMP-TRX) 
SCT              (WSAAT-MONTO-CAPITAL(I-IND) * LIB610-IMP-TRX)                  
                 / WS-IMP-TOT-TRX
                 ON SIZE ERROR MOVE 0 TO WS-MONTO-ENTERO
               END-COMPUTE
SCT   *        MOVE WS-MONTO-ENTERO TO LIB610-MONTO-CAPITAL(I-IND)
SCT   *        ADD LIB610-MONTO-CAPITAL(I-IND) TO WS-ACUM-CAPITAL
               MOVE WS-MONTO-ENTERO TO WSAAT-MONTO-CAPITAL(I-IND)
SCT   *        ADD WSAAT-MONTO-CAPITAL(I-IND) TO WS-ACUM-CAPITAL               
           END-PERFORM.

SCT   *       SUBTRACT WS-ACUM-CAPITAL FROM LIB610-IMP-TRX 
SCT   *                         GIVING LIB610-MONTO-CAPITAL(I-IND). 
SCT   *                         GIVING WSAAT-MONTO-CAPITAL(I-IND).

       SOLICITUD-TASAS-FINANCIAMIENTO.
      *-------------------------------
           PERFORM MOVER-DATOS-A-PL-TASAS.
           PERFORM LLAMADA-A-TASAS.



       MOVER-DATOS-A-PL-TASAS.
      *-----------------------
      *     MOVE MP405-CODENT TO WO-ENTIDAD.
           MOVE ATDATTAS-CODENT-SAL      TO WO-ENTIDAD.

           MOVE LIB610-COD-IDENT-RED     TO WO-IDENTIFICADOR
           MOVE LIB610-COD-PAIS          TO WO-PAIS
           MOVE CT-01                    TO WO-OPERACION
           MOVE ZEROS                    TO WO-FECHA-OPERACION
           MOVE ZEROS                    TO WO-HORA-OPERACION

           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WO-FECHA-OPERACION
           MOVE LIB610-FECHA-HORA-TRX(9:6) TO WO-HORA-OPERACION

           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WO-FECHA-TRANSACCION
           MOVE LIB610-FECHA-HORA-TRX(9:6) TO WO-HORA-TRANSACCION

           MOVE LIB610-PRODUCTO          TO WS-PRODUCTO
           MOVE LIB610-SUBPRODU          TO WS-SUBPRODU
           MOVE WS-PRODSUBPROD           TO WO-PRODUCTO-SUBP
           MOVE LIB610-MARCA             TO WS-MARCA
           MOVE LIB610-TIPO              TO WS-TIPO
           MOVE WS-MARCATIPO             TO WO-MARCA-TIPO
           MOVE SPACES                   TO WO-INDUSTRIA
           MOVE SPACES                   TO WO-RUBRO
           MOVE SPACES                   TO WO-MARCA-COMERCIAL
           MOVE LIB610-COD-COMERCIO      TO WO-COMERCIO
           MOVE LIB610-COD-OFICINA       TO WO-SUCURSAL
           MOVE SPACES                   TO WO-GRUPO-PLAZO
           MOVE TB-NRO-CUOTA (I)         TO WO-CUOTAS
           MOVE LIB610-MESES-CARENCIA    TO WO-CARENCIA
           MOVE LIB610-COD-MONEDA        TO WO-MONEDA
           MOVE DIASDESFASE              TO WO-DESFASE.

           IF LIB610-CANT-ARTICULOS = 0
              MOVE LIB610-IMP-TRX        TO WS-MONTO
              MOVE ZEROES                TO WS-RESTO
              MOVE WS-ART-ENT            TO WO-ARTICULOS_ENTRADA
              MOVE 1                     TO WO-OCURRENCIAS
           ELSE
              COMPUTE WS-TOPE-ART = WSAAT-CANT-ARTICULOS * CT-38
              MOVE WSAAT-ARTICULOS-ENTRADA(1:WS-TOPE-ART)
                                         TO WO-ARTICULOS_ENTRADA           
              MOVE WSAAT-CANT-ARTICULOS TO WO-OCURRENCIAS
           END-IF.

      *     STRING MP405-CODENT    DELIMITED BY SIZE
      *            MP405-CENTALTA  DELIMITED BY SIZE
      *            MP405-CUENTA    DELIMITED BY SIZE
           STRING  ATDATTAS-CODENT-SAL   DELIMITED BY SIZE
                   ATDATTAS-CENTALTA-SAL DELIMITED BY SIZE
                   ATDATTAS-CUENTA-SAL   DELIMITED BY SIZE
                                         INTO WO-CONTRATO
           MOVE LIB610-COD-TRX           TO WO-COD-TRX.


       LLENAR-VENCIMIENTOS-TASAS.
      *--------------------------
           MOVE 1 TO WS-IND-PV
           MOVE SPACES TO WS-STRING-VCTOS .

      *    IF LIB610-MESES-CARENCIA > 0
      *        MOVE 0 TO WS-IND-PV
      *        MOVE 0 TO WS-CANT-MESES-CARENCIA
      *        PERFORM VARYING I-IND FROM 1 BY 1 UNTIL I-IND > 
      *                                  CT-TOPE-ATE568
      *                                  OR WS-IND-PV > 0
      *         MOVE ATVTODIF-LIQ-CUOTA(I-IND)
      *                         TO WS-FECHA-EDITADA
      *         IF WS-FECHA-EDT-MM = LIB610-MESES-CARENCIA
      *            MOVE I-IND TO WS-IND-PV
      *            MOVE WS-CANT-MESES-CARENCIA 
      *                             TO LIB610-MESES-CARENCIA                   
      *         ELSE
      *            ADD 1 TO WS-CANT-MESES-CARENCIA
      *         END-IF
      *        END-PERFORM
      *     END-IF

           MOVE 1 TO CANT-CUOTAS                
           MOVE ATVTODIF-LIQ-CUOTA(WS-IND-PV)  
                                       TO WS-FECHA-EDITADA
           MOVE WS-FECHA-EDT-AAAA      TO WS-FECHA-A
           MOVE WS-FECHA-EDT-MM        TO WS-FECHA-M
           MOVE WS-FECHA-EDT-DD        TO WS-FECHA-D
           MOVE WS-FECHA-VCTO          TO
                                       WS-VCTO-FECHA(CANT-CUOTAS) 
           ADD 1 TO WS-IND-PV 
           SUBTRACT 1 FROM TB-NRO-CUOTA (I) GIVING WS-TOPE-VCTO

           PERFORM VARYING I-IND FROM WS-IND-PV
                               BY 1 UNTIL I-IND > CT-TOPE-ATE568
                                        OR
                                CANT-CUOTAS = TB-NRO-CUOTA (I)
               ADD 1 TO CANT-CUOTAS
               MOVE ATVTODIF-LIQ-CUOTA(I-IND) TO WS-FECHA-EDITADA
               MOVE WS-FECHA-EDT-AAAA  TO WS-FECHA-A
               MOVE WS-FECHA-EDT-MM    TO WS-FECHA-M
               MOVE WS-FECHA-EDT-DD    TO WS-FECHA-D
               MOVE WS-FECHA-VCTO      TO WS-VCTO-FECHA(CANT-CUOTAS) 
           END-PERFORM.

           MOVE WS-STRING-VCTOS  TO WO-FECHAS_VENCIMIENTO.

      * RESCATA-DIAS-DESFASE.
      **---------------------
      *     EXEC SQL
      *         SELECT (TO_DATE(:FECHVTO, 'YYYYMMDD')
      *         - TO_DATE(:FECHCOM, 'YYYY-MM-DD'))
      *         INTO  :DIASDESFASE
      *         FROM   DUAL
      *     END-EXEC.
      *
      *     MOVE SQLCODE                TO  ATSQLERR   WS-SQLCODE.
      *
      *     IF NOT ACCESO-CORRECTO-BD
      *        MOVE CT-CORRECTO         TO  MQCOPY-RETORNO
      *        MOVE CT-BD-TASAS         TO  MQCOPY-NOMBRE-BD
      *        MOVE CT-PL-TASAS         TO  MQCOPY-NOMBRE-TABLA
      *        MOVE CT-EXECUTE          TO  MQCOPY-OPERACION
      *        MOVE SQLCODE             TO  MQCOPY-SQLCODE
      *        IF SI-LOGGEA-SERVICIO
      *           MOVE "O"              TO  INDICADOR_I-O OF MPMLOG
      *           MOVE MQCOPY           TO  MENSAJE_COPY  OF MPMLOG
      *           PERFORM 888888-LOGGEAR-TRANSACCION
      *        END-IF
      *     END-IF.

       LLAMADA-A-TASAS.
      *----------------
           IF SI-LOGGEA-SERVICIO
               MOVE SPACES TO MENSAJE_COPY OF MPMLOG
               MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
               MOVE "TASAS"             TO  CODIGO_RUTINA OF MPMLOG 
               MOVE WO-ENTSAL-TASAS     TO  MENSAJE_COPY OF MPMLOG
               PERFORM 888888-LOGGEAR-TRANSACCION



               MOVE SPACES TO MENSAJE_COPY OF MPMLOG
                 STRING
                    "IDENTIFICADOR: " 
                     WO-IDENTIFICADOR
                    "OPERACION: "
                     WO-OPERACION
                    "FECHA TRX "
                     WO-FECHA-TRANSACCION
                    "ENTIDAD: "
                     WO-ENTIDAD
                    "PRODUCTO/SUB "
                     WO-PRODUCTO-SUBP
                    "MARCA TIPO "
                     WO-MARCA-TIPO
      *             "LINEA CREDITO: "
      *              WO-LINEA-CREDITO
      *             "TIPO OPERACION: "
      *              WO-TIPO-OPERACION
                    "COMERCIO:  "
                     WO-COMERCIO
                    "SUCURSAL:   "
                     WO-SUCURSAL

                    "CUOTAS:  "
                     WO-CUOTAS
                    "FECHAS VENCIMIENTO:  "
                     WO-FECHAS_VENCIMIENTO
                          DELIMITED BY SIZE
                     INTO MENSAJE_COPY OF MPMLOG
                 END-STRING
                 PERFORM 888888-LOGGEAR-TRANSACCION

           END-IF

           EXEC SQL
            EXECUTE
             BEGIN
                SFTASA_ADM.SFTASA_PKC_ITF_COS_TSA.SFTASA_PRC_COS_COD_FNM
                                   (TO_NUMBER(:WO-IDENTIFICADOR),
                                    TO_NUMBER(:WO-PAIS),
                                    TRIM(:WO-CONTRATO),
                                    TO_NUMBER(:WO-OPERACION),
                                    TO_NUMBER(:WO-FECHA-OPERACION),
                                    TO_NUMBER(:WO-HORA-OPERACION),
                                    TO_NUMBER(:WO-FECHA-TRANSACCION),
                                    TO_NUMBER(:WO-HORA-TRANSACCION),
                                    TRIM(:WO-ENTIDAD),
                                    TRIM(:WO-PRODUCTO-SUBP),
                                    TO_NUMBER(:WO-MARCA-TIPO),
                                    TO_NUMBER(:WO-COD-TRX),
                                    TRIM(:WO-INDUSTRIA),
                                    TRIM(:WO-RUBRO),
                                    TRIM(:WO-MARCA-COMERCIAL),
                                    TRIM(:WO-COMERCIO),
                                    TRIM(:WO-SUCURSAL),
                                    TRIM(:WO-GRUPO-PLAZO),
                                    TO_NUMBER(:WO-CUOTAS),
                                    TO_NUMBER(:WO-CARENCIA),
                                    TO_NUMBER(:WO-MONEDA),
                                    TO_NUMBER(:WO-DESFASE),
                                    TRIM(:WO-FECHAS_VENCIMIENTO),
                                    TO_NUMBER(:WO-OCURRENCIAS),
                                    TRIM(:WO-ARTICULOS_ENTRADA),
                                         :WO-IDENTIFICADOR_SAL,
                                         :WO-TASA_EFECTIVA,
                                         :WO-TASA_COMERCIAL,
                                         :WO-TASA_CARENCIA,
                                         :WO-G1,
                                         :WO-G2,
                                         :WO-G3,
                                         :WO-CAPITAL,
                                         :WO-TASAS_ARTICULOS,
                                         :WO-STATUS-CODIGO,
                                         :WO-STATUS-GLOSA,
                                         :WO-NIVEL,
                                         :WO-TIEMPO-SEG,
                                         :WO-FLAG_TMC,
                                         :WO-GRUPO-COMISION,
                                         :WO-IND-PLAZO);
              END;
           END-EXEC.
      ** VARIABLES DEBEN SER INCORPORADAS EN EL PACKAGE
      **                                 :WO-GRUPO-COMISION	
      **                                 :WO-IND-PLAZO

           MOVE SQLCODE                TO  ATSQLERR   WS-SQLCODE.
RDC   * OJO ARREGLO MOMENTANEO POR ERROR 1405
           IF NOT ACCESO-CORRECTO-BD
RDC   *       INITIALIZE WO-SAL-TASAS
RDC   *
RDC   *       MOVE 01  TO WO-STATUS-CODIGO
RDC           MOVE CT-CORRECTO         TO  MQCOPY-RETORNO
RDC           MOVE CT-BD-TASAS         TO  MQCOPY-NOMBRE-BD
RDC           MOVE CT-PL-TASAS         TO  MQCOPY-NOMBRE-TABLA
RDC           MOVE CT-EXECUTE          TO  MQCOPY-OPERACION
RDC           MOVE SQLCODE             TO  MQCOPY-SQLCODE
RDC           PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.


SCT        IF WS-SQLCODE NOT = 0
SCT           MOVE SPACES TO MENSAJE_COPY OF MPMLOG
SCT           STRING WO-STATUS-CODIGO, 
SCT                  WO-STATUS-GLOSA
SCT                  DELIMITED BY SIZE
SCT                  INTO MENSAJE_COPY OF MPMLOG
SCT           END-STRING
SCT           PERFORM 888888-LOGGEAR-TRANSACCION

              MOVE SPACES TO LIB610-CAMPOS-LIBRES
              MOVE SPACES TO WS-MENSAJE-ATOMICO
SCT          STRING "ERROR EN MODULO TASAS...COD_ERROR : " 
SCT                  WS-SQLCODE 
RDC                  DELIMITED BY SIZE
RDC             INTO WS-MENSAJE-ATOMICO
RDC          END-STRING
SCT           MOVE 99999           TO LIB610-CODIGO-RETORNO
SCT           PERFORM 999999-ERROR-PROGRAMA
SCT	   END-IF

           IF WO-STATUS-CODIGO = ZEROES
              MOVE WO-TASAS_ARTICULOS TO WS-ARR-TASAS-ARTICULOS
              IF SI-LOGGEA-SERVICIO
                 MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
                 MOVE "TASAS"             TO  CODIGO_RUTINA OF MPMLOG 
                 MOVE WO-ENTSAL-TASAS     TO  MENSAJE_COPY OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
              
                 MOVE WO-TASA_COMERCIAL TO WOE-TASA_COMERCIAL
                 MOVE WO-TASA_EFECTIVA TO WOE-TASA_EFECTIVA
                 MOVE WO-TASA_CARENCIA TO WOE-TASA_CARENCIA
                 MOVE WO-G1  TO WOE-G1
                 MOVE WO-G2  TO WOE-G2
                 MOVE WOE-TASA_COMERCIAL TO WOS-TASA_COMERCIAL
                 MOVE WOE-TASA_EFECTIVA TO WOS-TASA_EFECTIVA
                 MOVE WOE-TASA_CARENCIA TO WOS-TASA_CARENCIA
                 MOVE WOE-G1 TO WOS-G1
                 MOVE WOE-G2 TO WOS-G2
                 MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
                 MOVE "TASAS"             TO  CODIGO_RUTINA OF MPMLOG 
                 STRING
                    "TASA COMERCIAL: " 
                     WOS-TASA_COMERCIAL
                    " TASA EFECTIVA: "
                     WOS-TASA_EFECTIVA
                    " TASA GESIC 1: "
                     WOS-G1
                    " TASA CARENCIA : "
                     WOS-TASA_CARENCIA
                    " GESIC 2 : "
                     WOS-G2  DELIMITED BY SIZE
                     INTO MENSAJE_COPY OF MPMLOG
                 END-STRING
                 PERFORM 888888-LOGGEAR-TRANSACCION
              END-IF
            ELSE
              MOVE SPACES TO MENSAJE_COPY OF MPMLOG
              STRING WO-STATUS-CODIGO, 
                    WO-STATUS-GLOSA
                    DELIMITED BY SIZE
                     INTO MENSAJE_COPY OF MPMLOG
              END-STRING
              PERFORM 888888-LOGGEAR-TRANSACCION

RDC   *       INITIALIZE WO-SAL-TASAS
RDC   *       MOVE 002,9450            TO WO-TASA_EFECTIVA
RDC   *       MOVE 002,9450            TO WO-TASA_COMERCIAL
RDC   *       MOVE 003,0000            TO WO-TASA_CARENCIA
RDC   *       MOVE 000,5000            TO WO-G1
RDC   *       MOVE 1                   TO WO-G2
RDC   *       MOVE 0                   TO WO-G3
RDC           STRING "ERROR BUSQUEDA TASA:" 
                     WO-STATUS-CODIGO
RDC                  WO-STATUS-GLOSA
RDC                  DELIMITED BY SIZE
RDC             INTO WS-MENSAJE-ATOMICO
RDC           END-STRING
RDC           MOVE 136                  TO LIB610-CODIGO-RETORNO
RDC           PERFORM 999999-ERROR-PROGRAMA
           END-IF.

       CARGAR-BOTGEN-ENC-PAR-DOM.
      *------------------------
           MOVE 'N'         TO WS-FIN-PAG-BOTGEN.
           MOVE 1           TO WS-BOTGEN-INI
           PERFORM LLAMAR-BOTGEN-PAGINABLE UNTIL
                            WS-FIN-PAG-BOTGEN = 'S'.
   
       LLAMAR-BOTGEN-PAGINABLE.
      *------------------------
           PERFORM LLENAR-TRN-MACRODOM.
           PERFORM LLAMAR-TRN-MACRODOM.
           
       LLENAR-TRN-MACRODOM.
      *--------------------
           MOVE LIB610-COD-PAIS        TO MCD_ENUM_COD_PAI.
           MOVE 799                    TO MCD_ENUM_COD_MAC_DOM.
           MOVE 99999                  TO MCD_ENUM_COD_MOV_DOM.
           MOVE "VACIO"                TO MCD_EVC2_GLS_MOV_DOM.
           MOVE 1                      TO MCD_ENUM_COD_APP.
           MOVE 1                      TO MCD_ENUM_COD_PRO_APP.
           MOVE "test"                 TO MCD_EVC2_NOM_RSP.
           MOVE 2                      TO MCD_ENUM_TIP_SAL.
           MOVE WS-BOTGEN-INI          TO MCD_ENUM_NRO_REG_INC.
           MOVE 35                     TO MCD_ENUM_TOT_REG_PGN.
                 

       LLAMAR-TRN-MACRODOM.
      *--------------------
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                 TO INDICADOR_I-O OF MPMLOG
              MOVE "PL-MCD "           TO CODIGO_RUTINA OF MPMLOG
              MOVE PARAM-MACDOM        TO MENSAJE_COPY OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           EXEC SQL
                ALLOCATE :WO_SCLB_VAR_MCD
           END-EXEC.

           EXEC SQL
                ALLOCATE :SCUR_CUR_MCD
           END-EXEC.

           IF SQLCODE NOT = ZEROS
              EXEC SQL
                   CLOSE :SCUR_CUR_MCD
              END-EXEC
              EXEC SQL
                   FREE :SCUR_CUR_MCD
              END-EXEC
           END-IF.


           EXEC SQL EXECUTE
                BEGIN
                  BOTGEN_ADM.BOTGEN_PRC_ENC_PAR_DOM
                                   (TO_NUMBER(:MCD_ENUM_COD_PAI),
                                    TO_NUMBER(:MCD_ENUM_COD_MAC_DOM),
                                    TO_NUMBER(:MCD_ENUM_COD_MOV_DOM),
                                    TRIM(:MCD_EVC2_GLS_MOV_DOM),
                                    TO_NUMBER(:MCD_ENUM_COD_APP),
                                    TO_NUMBER(:MCD_ENUM_COD_PRO_APP),
                                    TRIM(:MCD_EVC2_NOM_RSP),
                                    TO_NUMBER(:MCD_ENUM_TIP_SAL),
                                    TO_NUMBER(:MCD_ENUM_NRO_REG_INC),
                                    TO_NUMBER(:MCD_ENUM_TOT_REG_PGN),
                                    :WO_SCLB_VAR_MCD,
                                    :MCD_SAL_NRO_MSJ,
                                    :MCD_SAL_GLS_MSJ,
                                    :SCUR_CUR_MCD );
                END;
           END-EXEC.

           MOVE SQLCODE                TO ATSQLERR, WS-SQLCODE.
           
           IF SQLCODE = ZEROS AND
              ( MCD_SAL_NRO_MSJ = ZEROS OR MCD_SAL_NRO_MSJ = 10 )
              IF MCD_SAL_NRO_MSJ = 10
                 ADD  35  TO WS-BOTGEN-INI
                 MOVE 'N' TO WS-FIN-PAG-BOTGEN
              ELSE
                 MOVE 'S' TO WS-FIN-PAG-BOTGEN
              END-IF
              MOVE 0      TO WS-CONTA-BOTGEN
              PERFORM LEE-CURSOR-MCD 
              PERFORM CICLO-CURSOR-MCD
                      UNTIL SQLCODE NOT = ZEROS 
              IF WS-CONTA-BOTGEN < 35
                 MOVE 'S' TO WS-FIN-PAG-BOTGEN
              END-IF
           ELSE
              MOVE 'S'    TO WS-FIN-PAG-BOTGEN
           END-IF.

           EXEC SQL
                CLOSE :SCUR_CUR_MCD
           END-EXEC.
           EXEC SQL
                FREE :SCUR_CUR_MCD
           END-EXEC.
           
           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO INDICADOR_I-O OF MPMLOG
              MOVE "PL-MCD "           TO CODIGO_RUTINA OF MPMLOG
              MOVE PARAM-MACDOM        TO MENSAJE_COPY OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.
                 

       LEE-CURSOR-MCD.
      *---------------
           EXEC SQL
               FETCH :SCUR_CUR_MCD
               INTO  :MCD_TGMPA_COD_PAI,
                     :MCD_TGMPA_GLS_PAI,
                     :MCD_TGMMD_COD_MAC_DOM,
                     :MCD_TGMMD_GLS_MAC_DOM,
                     :MCD_TGMDO_COD_DOM,
                     :MCD_TGMDO_COC_DOM,
                     :MCD_TGMDO_GLS_DOM,
                     :MCD_TGMDO_MRC_VIG     
           END-EXEC.
           
       CICLO-CURSOR-MCD.
      *-----------------
           ADD 1 TO TB-CANT-BOTGEN-ARR.
           ADD 1 TO WS-CONTA-BOTGEN.

           MOVE MCD_TGMPA_COD_PAI      
                             TO TB-TGMPA-COD-PAI(TB-CANT-BOTGEN-ARR).
           MOVE MCD_TGMPA_GLS_PAI      
                             TO TB-TGMPA-GLS-PAI(TB-CANT-BOTGEN-ARR).
           MOVE MCD_TGMMD_COD_MAC_DOM  
                             TO TB-TGMMD-COD-MAC-DOM(TB-CANT-BOTGEN-ARR).
           MOVE MCD_TGMMD_GLS_MAC_DOM  
                             TO TB-TGMMD-GLS-MAC-DOM(TB-CANT-BOTGEN-ARR).
           MOVE MCD_TGMDO_COD_DOM      
                             TO TB-TGMDO-COD-DOM(TB-CANT-BOTGEN-ARR).
           MOVE MCD_TGMDO_COC_DOM      
                             TO TB-TGMDO-COC-DOM(TB-CANT-BOTGEN-ARR).
           MOVE MCD_TGMDO_GLS_DOM      
                             TO TB-TGMDO-GLS-DOM(TB-CANT-BOTGEN-ARR).
           MOVE MCD_TGMDO_MRC_VIG     
                             TO TB-TGMDO-MRC-VIG(TB-CANT-BOTGEN-ARR).  
           PERFORM LEE-CURSOR-MCD.

       BUSCAR-TRANSAC-BOTGEN.
      *-----------------------           
           SET   NO-ENCONTRO-LINEA    TO TRUE

           PERFORM VARYING I FROM 1 BY 1 UNTIL I > TB-CANT-BOTGEN-ARR 
                        OR SI-ENCONTRO-LINEA
              IF TB-TGMDO-COD-DOM(I) = LIB610-COD-TRX 
                    MOVE  TB-TGMDO-COC-DOM(I)  TO WS-LINEA
                    SET   SI-ENCONTRO-LINEA    TO TRUE   
              END-IF
           END-PERFORM.
      
      
       LLAMAR-OBTENER-TIPOFAC-LINEA.
      *-----------------------------
RDC        INITIALIZE  WS-LIB311R.
           MOVE LIB610-COD-USUARIO      TO L311R-COD-USUARIO.   
           MOVE LIB610-CODENT           TO L311R-CODENT.        
           MOVE LIB610-COD-IDENT-RED    TO L311R-COD-IDENT-RED. 
           IF LIB610-COD-TRX = 0008 OR 0300
              MOVE 1200                 TO L311R-COD-MENSAJE
              MOVE 340000               TO L311R-COD-PROCESO
           ELSE
              MOVE 1200                 TO L311R-COD-MENSAJE
              MOVE 040000               TO L311R-COD-PROCESO
           END-IF.
           MOVE LIB610-COD-ACT-ORI      TO L311R-COD-ACT-ORI.  
           MOVE LIB610-COD-MONEDA       TO L311R-COD-MONEDA.   
           MOVE LIB610-COD-PAIS         TO L311R-COD-PAIS.     
           MOVE LIB610-COD-TRX          TO L311R-COD-TRX.      
           MOVE LIB610-PRODUCTO         TO L311R-PRODUCTO.     
           MOVE LIB610-SUBPRODU         TO L311R-SUBPRODU.     
           MOVE LIB610-MARCA            TO L311R-MARCA-TARJETA.
           MOVE LIB610-TIPO             TO L311R-TIPO-TARJETA. 
           MOVE LIB610-COD-COMERCIO     TO L311R-COMERCIO.             
           MOVE LIB610-COD-DEPTO(1)     TO L311R-COD-DEPTO.
           
  
           CALL CT-ISER311   USING WS-LIB311R.

           EVALUATE L311R-RETORNO
              WHEN  00
                    MOVE L311R-LINEA     TO WS-LINEA-NUM
              WHEN OTHER
                   MOVE 030              TO LIB610-CODIGO-RETORNO
                   MOVE "ERROR AL OBTENER TIPOFAC" 
                                         TO LIB610-DESCRIP-ERROR
                DISPLAY "LIB610-DESCRIP-ERROR: " LIB610-DESCRIP-ERROR
                   PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.
        

******************************************************************
********* NUEVA MODIFICACIÓN PARA CAE Y COSTO TOTAL
******************************************************************
       CALCULA-COSTO-TOTAL.
      *--------------------
        DISPLAY "CALCULO COSTO TOTAL..."  
        MOVE ZEROS TO WS-IMPTO-CRED
        MOVE ZEROS TO SF-MTO-CAP
        MOVE ZEROS TO WS-PLAZO
         
        IF LIB610-NRO-CUOTAS > 0
          
          MOVE LIB610-NRO-CUOTAS    TO SF-NUM-CUO
          MOVE LIB610-IMP-TRX       TO SF-MTO-CAP
          DISPLAY "SF-NUM-CUO.... :  " SF-NUM-CUO
          DISPLAY "SF-MTO-CAP.....:  " SF-MTO-CAP
          DISPLAY "WS-ITE COSTO-TOT: " WS-ITE
      * CALCULA IMPUESTO AL CREDITO
          DISPLAY "LIB610-MESES-CARENCIA.. :  " 
                             LIB610-MESES-CARENCIA      
          COMPUTE WS-PLAZO = SF-NUM-CUO + LIB610-MESES-CARENCIA
          IF WS-PLAZO > 12
            MOVE CT-NUM-CUO-MAX TO WS-PLAZO
          END-IF
          DISPLAY " WS-PLAZO.. : "  WS-PLAZO 
          MOVE WS-ITE     TO WS-IMPTO-CRED

      * CALCULA COSTO TOTAL
          DISPLAY "SF-MTO-CUO... :  " SF-MTO-CUO      
          IF LIB610-NRO-CUOTAS > 12
             MOVE LIB610-NRO-CUOTAS TO SF-NUM-CUO
          END-IF      
          MULTIPLY SF-NUM-CUO BY SF-MTO-CUO 
                          GIVING WS-CTO-TOTAL
          ADD WS-IMPTO-CRED TO WS-CTO-TOTAL
          IF WO-IND-PLAZO NOT = CT-CUOTIZADA
SCT          ADD LIB610-IMP-COMISION TO WS-CTO-TOTAL
          END-IF
          DISPLAY "WS-CTO-TOTAL...  :  " WS-CTO-TOTAL
          IF LIB610-NRO-CUOTAS = 1 OR 
             LIB610-NRO-CUOTAS = 0
             MOVE LIB610-IMP-TRX TO WS-CTO-TOTAL
          END-IF
         
        ELSE
          DISPLAY " CALCULO-B COSTO TOTAL..."
           MOVE LIB610-IMP-TRX    TO SF-MTO-CAP

          DISPLAY "SF-NUM-CUO.... :  " SF-NUM-CUO
          DISPLAY "SF-MTO-CAP.....:  " SF-MTO-CAP
      * CALCULA IMPUESTO AL CREDITO
          DISPLAY "LIB610-MESES-CARENCIA.. :  "
 
      * CALCULA IMPUESTO AL CREDITO
          COMPUTE WS-PLAZO = SF-NUM-CUO + LIB610-MESES-CARENCIA
          IF WS-PLAZO > 12
            MOVE CT-NUM-CUO-MAX TO WS-PLAZO
          END-IF

          DISPLAY " WS-PLAZO.. : "  WS-PLAZO

          MOVE WS-ITE           TO WS-IMPTO-CRED
         
      * CALCULA COSTO TOTAL
      
        MULTIPLY SF-NUM-CUO BY SF-MTO-CUO 
                          GIVING WS-CTO-TOTAL
          ADD WS-IMPTO-CRED TO WS-CTO-TOTAL
          IF WO-IND-PLAZO NOT = CT-CUOTIZADA
SCT          ADD LIB610-IMP-COMISION TO WS-CTO-TOTAL
          END-IF          
          DISPLAY "WS-CTO-TOTAL...  :  " WS-CTO-TOTAL

         IF LIB610-COD-OFICINA = 0099 AND 
            LIB610-TERM-FISICO = 2000 AND
            LIB610-NRO-CUOTAS  = 0
            MOVE LIB610-IMP-TRX TO WS-CTO-TOTAL
          DISPLAY "WS-CTO-TOTAL...  :  " WS-CTO-TOTAL

         END-IF
        END-IF.


      * INI-CAE
       CALCULA-CAE.
      *-----------
           INITIALIZE WS-LIB413R.
           DISPLAY "LLAMA RUTINA ISER413 CALCULO CAE"
           MOVE SF-NUM-CUO                 TO WS413R-NCUOTAS
           MOVE LIB610-IMP-TRX 	           TO WS413R-CAPITAL
           MOVE SF-MTO-CUO                 TO WS413R-VALCUOTA1
           ADD WS-IMPTO-CRED               TO WS413R-VALCUOTA1
           MOVE SF-MTO-CUO                 TO WS413R-VALCUOTAN
           MOVE CT-VALOR-30                TO WS413R-NITERA
           MOVE CT-VALOR-100               TO WS413R-MERROR
RDC   *INI SATI error calculo cae con diferido                                                          
           MOVE 1                          TO WS-FEC1V   
           IF   LIB610-MESES-CARENCIA > 0
               ADD  LIB610-MESES-CARENCIA  TO WS-FEC1V
           END-IF
           MOVE ATVTODIF-LIQ-CUOTA(WS-FEC1V) TO WS-FECVCTO-CAE-1 
RDC   *FIN SATI error calculo cae con diferido                                                           
      *LRO-TECNOCOM-E&Y1-I                                                           
RDC   *    MOVE ATVTODIF-LIQ-CUOTA(1)      TO WS-FECVCTO-CAE-1
           MOVE WS-FECVCTO-CAE-1(1:4)      TO WS-FECVCTO-CAE(1:4)
           MOVE WS-FECVCTO-CAE-1(6:2)      TO WS-FECVCTO-CAE(5:2)
           MOVE WS-FECVCTO-CAE-1(9:2)      TO WS-FECVCTO-CAE(7:2)
      *LRO-TECNOCOM-E&Y1-F                                                                  
           MOVE WS-FECVCTO-CAE             TO WS413R-FCH-PV
           
           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS413R-FCH-FC
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                     TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ISER413              TO  CODIGO_RUTINA OF MPMLOG 
              MOVE WS-LIB413R              TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL CT-ISER413 USING WS-LIB413R 

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-ISER413          TO  CODIGO_RUTINA OF MPMLOG 
              MOVE WS-LIB413R          TO  MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           EVALUATE WS413R-CODERROR 
               WHEN 0      CONTINUE
               WHEN OTHER 
                   MOVE 0 TO WS413R-TIRMENSUAL 
                   MOVE 0 TO WS413R-TASACAE
           END-EVALUATE.
      * FIN-CAE

        
*************************************************


            
       MOVER-DATOS-MPM0544-CUO.
      *------------------------
           INITIALIZE MPM0544.
           MOVE LIB610-COD-IDENT-RED     TO MP544-TIPFRAN.
           
           MOVE  LIB610-COD-ACT-ORI      TO MP544-CODACT

           IF LIB610-COD-TRX = 0008 OR 0300
              MOVE 1200                  TO MP544-TIPMSGON
              MOVE 340000                TO MP544-CODPROON
           ELSE                          
              MOVE 1200                  TO MP544-TIPMSGON
              MOVE 040000                TO MP544-CODPROON
           END-IF.
           MOVE LIB610-COD-PAIS          TO MP544-CODPAIS
           MOVE WO-GRUPO-COMISION        TO MP544-COD-COMI
           IF WO-GRUPO-COMISION = '00000' OR '     '  
                                OR '0    '
              MOVE WS-SWINDPLZ   TO WO-IND-PLAZO
           END-IF
           
           MOVE ATDATTAS-CODENT-SAL      TO MP544-CODENT.
           MOVE ATDATTAS-CENTALTA-SAL    TO MP544-CENTALTA.
           MOVE ATDATTAS-CUENTA-SAL      TO MP544-CUENTA.

           MOVE LIB610-COD-COMERCIO      TO MP544-CODCOM.
           MOVE WS-LINEA-NUM             TO MP544-LINEA.
           MOVE LIB610-PAN               TO MP544-PAN.
           MOVE LIB610-COD-MONEDA        TO MP544-CLAMON.
           MOVE LIB610-IMP-TRX           TO MP544-IMPFAC.
           MOVE LIB610-NRO-CUOTA(J)      TO MP544-TOTCUOTAS.
           MOVE LIB610-MESES-CARENCIA    TO MP544-MESCARENCIA.
           
           MOVE ATRUTTCC-CODTIPC         TO MP544-CODTIPC
           MOVE CT-U                     TO MP544-ALT-CONECO.
           MOVE WO-TASA_COMERCIAL        TO MP544-PORINT.
           MOVE WO-TASA_CARENCIA         TO MP544-INTCARENCIA.
           MOVE ZEROS                    TO MP544-IMPUESTO.
           MOVE WO-G1                    TO MP544-TASA-GSIC.
           MOVE LIB610-NRO-CUOTA(J)      TO MP544-PLAZO-GSIC2.
           MOVE DIASDESFASE              TO MP544-DIAS-DESFAS.
           MOVE LIB610-COD-TRX           TO MP544-CODTRAN
           MOVE "SSSSSSSSSSSS"           TO MP544-NUMMESFIN.
           MOVE WO-IND-PLAZO             TO MP544-PLAZO-COM-E.
RDC        MOVE WS-FECHA-SYS             TO MP544-FECALTA.


      *    Cálculo de importe total y de cuota, comisiones e impuestos
       OBTENER-IMPORTES-S470C.
HRE        DISPLAY " "
HRE        DISPLAY "---------------------------------------------------"
HRE        DISPLAY " -- --- OBTENER-IMPORTES-S470C --- --"

      *    Obtengo ATCUOTAS-IMP-CUO
           PERFORM CALCULO-VALOR-CUOTA
HRE        DISPLAY "ATCUOTAS-IMP-CUO: [" ATCUOTAS-IMP-CUO "]"

      *    Obtengo ATPLANFI-IMP-GSIC(1) y ATPLANFI-IMP-GSIC2(1)
           PERFORM DESARROLLO-PLAN.
HRE        DISPLAY "ATPLANFI-IMP-GSIC(1).: [" ATPLANFI-IMP-GSIC(1) "]"
HRE        DISPLAY "ATPLANFI-IMP-GSIC2(1): [" ATPLANFI-IMP-GSIC2(1) "]"

           ADD 1 TO LIB610-MESES-CARENCIA GIVING WS-INICIO
           PERFORM VARYING WS-CONTA-ATPLANFI 
             FROM WS-INICIO BY 1 UNTIL WS-CONTA-ATPLANFI > 70 
               IF  ATPLANFI-NUM-CUOTA (WS-CONTA-ATPLANFI) > ZEROS
                   MOVE ATPLANFI-IMP-CAPITAL(WS-CONTA-ATPLANFI) 
                     TO WS-ATPLANFI-IMP-CAPITAL
                   MOVE 71 TO WS-CONTA-ATPLANFI
               END-IF
           END-PERFORM.
HRE        DISPLAY 
HRE             "WS-ATPLANFI-IMP-CAPITAL: [" WS-ATPLANFI-IMP-CAPITAL "]"

      * ----------------------------------------------------------------
      * -- LIB610-MTO-CUOTA        (WS-IMPCUOTA)
      * ----------------------------------------------------------------
      *     El importe de cuota se obtiene del L470C-IMPCUOTA
      *     La formula empleada en el SFISERS470C es la siguiente
      *     ADD ATCUOTAS-IMP-CUO, ATPLANFI-IMP-GSIC(1),
      *         ATPLANFI-IMP-GSIC2(1) GIVING L470C-IMPCUOTA.
           ADD ATCUOTAS-IMP-CUO, ATPLANFI-IMP-GSIC(1),
               ATPLANFI-IMP-GSIC2(1) GIVING WS-IMPCUOTA.
HRE        DISPLAY "WS-IMPCUOTA: [" WS-IMPCUOTA "]".

      * ----------------------------------------------------------------
      * --  LIB610-MTO-CTOTOT(J)   (WS-IMPTOTAL)
      * ----------------------------------------------------------------
           ADD ATCUOTAS-INT-CAR, ATCUOTAS-INT-COM, ATPLANFI-IMPGASTOT,
               ATCUOTAS-INT-DES, LIB610-IMP-TRX
               GIVING WS-IMPTOTAL.
HRE        DISPLAY "WS-IMPTOTAL: [" WS-IMPTOTAL "]".
           
      * ----------------------------------------------------------------
      * --  LIB610-MTO-CUOTN(J)   (WS-VALOR-CUOTA-N)
      * ----------------------------------------------------------------
           COMPUTE WS-VALOR-CUOTA-N = (WS-IMPTOTAL -
                      WS-IMPCUOTA) / (SF-NUM-CUO - 1)
                      ON SIZE ERROR MOVE 0 TO WS-VALOR-CUOTA-N
           END-COMPUTE.
HRE        DISPLAY "WS-VALOR-CUOTA-N: [" WS-VALOR-CUOTA-N "]".



           PERFORM OBTENER-IMPUESTO-ITE.
      * ----------------------------------------------------------------
      * --  LIB610-ITE            (WS-IMPUESTO)
      * ----------------------------------------------------------------
           MOVE ATRUTITE-IMPUESTO-TOTAL TO WS-IMPUESTO.
HRE        DISPLAY "WS-IMPUESTO: [" WS-IMPUESTO "]".


      * ----------------------------------------------------------------
      * --  LIB610-IMP-COMISION   (WS-TOTAL-COMISION)
      * ----------------------------------------------------------------
           PERFORM CALCULO-COMISIONES-ONLINE.
HRE        DISPLAY "WS-TOTAL-COMISION: [" WS-TOTAL-COMISION "]".



       CALCULO-VALOR-CUOTA.
      *--------------------
           INITIALIZE WS-ATCUOTAS
           PERFORM MOVER-DATOS-ATCUOTAS
           PERFORM LLAMADA-A-ATR543
           .
   
       MOVER-DATOS-ATCUOTAS.
      *---------------------
           MOVE LIB610-CODENT              TO ATCUOTAS-CODENT.
           MOVE LIB610-CENTALTA            TO ATCUOTAS-CENTALTA.
           MOVE LIB610-CUENTA              TO ATCUOTAS-CUENTA.
           MOVE LIB610-IMP-TRX             TO ATCUOTAS-IMPORTE.
           MOVE LIB610-COD-MONEDA          TO ATCUOTAS-CLAMON.
           MOVE LIB610-MESES-CARENCIA      TO ATCUOTAS-MES-CAREN.

           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA  
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-EDT-AAAA 
           MOVE WS-FECCOM-MM               TO WS-FECHA-EDT-MM   
           MOVE WS-FECCOM-DD               TO WS-FECHA-EDT-DD   
           MOVE WS-FECHA-EDITADA           TO ATCUOTAS-FECALTA.

           MOVE ZEROS                    TO ATCUOTAS-NUMDEC
                                            ATCUOTAS-NUMOPECUO
                                            ATCUOTAS-NUMFINAN
                                            ATCUOTAS-CUO-ACTUAL.

           MOVE VAR-CODTIPC                TO ATCUOTAS-CODTIPC.

           MOVE WS-TASA_CARENCIA           TO ATCUOTAS-TASA-CARENC.
           MOVE "SSSSSSSSSSSS"             TO ATCUOTAS-NUMMESFIN.

      * NumPlazos (entrada)
           MOVE WS-NUM-CUOTA               TO ATCUOTAS-NUM-PLAZOS.
           MOVE WS-TASA_COMERCIAL          TO ATCUOTAS-TIPO-INT.


           MOVE LIB070R-RESEMIEXT          TO ATCUOTAS-RESEMIEXT.
           MOVE LIB070R-DESCPLANILLA       TO ATCUOTAS-DESCPLANILLA.

      *    MOVE ATVTODIF-LIQ-CUOTA(1)    TO ATCUOTAS-FECLIQ.

      * \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
      *    Busco el valor a asignar a ATCUOTAS-INDCAPINT
      *    MOVE MP201-INDCAPINTC(W-C) TO ATCUOTAS-INDCAPINT
      * ----------------------------------------------------------------
           PERFORM VARYING W-C FROM 1 BY 1 UNTIL W-C > 19
                                OR SI-ENCONTRO-CC
              IF LIB610-MESES-CARENCIA NOT <  MP201-MESMINCARCUO(W-C) 
                 AND 
                 LIB610-MESES-CARENCIA NOT >  MP201-MESMAXCARCUO(W-C)

      *           MOVE MP201-CODTIPC (W-C)   TO VAR-CODTIPC
      *           MOVE MP201-INDCAPINTC(W-C) TO VAR-INDCAPINTC
      *           MOVE VAR-INDCAPINTC           TO ATCUOTAS-INDCAPINT
                 MOVE MP201-INDCAPINTC(W-C) TO ATCUOTAS-INDCAPINT
                 SET SI-ENCONTRO-CC TO TRUE
              END-IF
           END-PERFORM.
           IF NO-ENCONTRO-CC 
              MOVE 0030 TO STCOPY-COD-RESPUESTA
              MOVE CT-ERROR-TC      TO LIB610-DESCRIP-ERROR
              PERFORM 999999-ERROR-PROGRAMA
           END-IF.
      *    /////////////////////////////////////////////////////////////


      * \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
      *    Busco el valor a asignar a ATCUOTAS-FORCALINT
      *    MOVE MP021-INDADMSALDO        TO ATCUOTAS-FORCALINT.
      * ----------------------------------------------------------------
           MOVE WS-ATPC021-INDADMSALDO   TO ATCUOTAS-FORCALINT.
      * ////////////////////////////////////////////////////////////////

      *    DIASDESFASE se obtiene del ISER325
ADD        MOVE DIASDESFASE              TO ATCUOTAS-DIAS-DESFAS.


      * \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
      *    Busco el valor a asignar a ATCUOTAS-FECLIQ
      *    MOVE ATVTOCAR-LIQ-CUOTA(1) TO ATCUOTAS-FECLIQ
      * ----------------------------------------------------------------
           PERFORM VALIDAR-PROCESAR-ATR541.
           IF SI-PROCESAR-ATR541
              PERFORM MOVER-DATOS-ATVTOCAR
              PERFORM LLAMADA-A-ATR541
           END-IF
ADD        MOVE ATVTOCAR-LIQ-CUOTA(1) TO ATCUOTAS-FECLIQ.
      * ////////////////////////////////////////////////////////////////


      * \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
      *    Busco el valor de WS-TIPO-INTERES (con RUTPAR)
      *    MOVE RUTPAR-CODVALOR-DET(1)   TO WS-TIPO-INTERES
      * ----------------------------------------------------------------
           PERFORM VALIDAR-PROCESAR-ATR100.
           IF SI-PROCESAR-ATR100
              PERFORM MOVER-DATOS-ATRUTPAR
              PERFORM LLAMADA-A-ATR100
           END-IF

RDC        IF WS-TIPO-INTERES = CT-D
RDC           PERFORM CARGAR-DATOS-INTERES
RDC        END-IF.
      * ////////////////////////////////////////////////////////////////

       LLAMADA-A-ATR543.
           MOVE CT-RUTINA                TO MQCOPY-PROGRAMA
           MOVE WS-ATCUOTAS              TO MQCOPY-MENSAJE
           MOVE "00"                     TO MQCOPY-RETORNO
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR543             TO CODIGO_RUTINA OF MPMLOG 
              MOVE WS-ATCUOTAS           TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           CALL  CT-ATR543   USING  ATCUOTAS.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR543             TO CODIGO_RUTINA OF MPMLOG 
              MOVE WS-ATCUOTAS           TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           EVALUATE ATCUOTAS-COD-RETORNO        
               WHEN CT-RETORNO-OK
                    CONTINUE
               WHEN OTHER
                    MOVE 0030            TO STCOPY-COD-RESPUESTA
                    MOVE CT-ERROR-VC     TO LIB610-DESCRIP-ERROR
                    PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.


      * MOVER-DATOS-MPM0021.
      **--------------------
      *     MOVE LIB610-CODENT            TO MP021-CODENT.

      * LLAMADA-A-ATPC021.
      **------------------
      *     MOVE CT-RUTINA                TO MQCOPY-PROGRAMA.
      *     MOVE MPM0021                  TO MQCOPY-MENSAJE.
      *     MOVE 'U'                      TO IND-PAGINACION.
      *     MOVE "00"                     TO MQCOPY-RETORNO.
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "I"                   TO INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC021            TO CODIGO_RUTINA OF MPMLOG
      *        MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF
      *
      *     CALL  CT-ATPC021           USING WS-MQCOPY.
      *
      *     IF SI-LOGGEA-SERVICIO
      *        MOVE "O"                   TO INDICADOR_I-O OF MPMLOG
      *        MOVE CT-ATPC021            TO CODIGO_RUTINA OF MPMLOG
      *        MOVE MQCOPY                TO MENSAJE_COPY  OF MPMLOG
      *        PERFORM 888888-LOGGEAR-TRANSACCION
      *     END-IF
      *
      *     MOVE MQCOPY-MENSAJE           TO MPM0021.
      *
      *     EVALUATE MQCOPY-RETORNO
      *         WHEN CT-RETORNO-OK
      *              CONTINUE
      *         WHEN CT-INFOR
      *              CONTINUE
      *         WHEN OTHER
      *              MOVE "I"             TO MP021-FORCALINT
RDC   *              MOVE "I"             TO MP021-INDADMSALDO
      *     END-EVALUATE.


       VALIDAR-PROCESAR-ATR541.
           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-OPE-AAAA-G 
           MOVE WS-FECCOM-MM               TO WS-FECHA-OPE-MM-G   
           MOVE WS-FECCOM-DD               TO WS-FECHA-OPE-DD-G 

           SET NO-PROCESAR-ATR541 TO TRUE

           IF ATVTOCAR-CODENT = ZEROES OR SPACES OR 
              ATVTOCAR-CODENT <> LIB610-ENTIDAD
              SET SI-PROCESAR-ATR541 TO TRUE
           END-IF

           IF ATVTOCAR-CODPROCESO = ZEROES OR SPACES OR 
              ATVTOCAR-CODPROCESO <> LIB070R-CODPROLIQ
              SET SI-PROCESAR-ATR541 TO TRUE
           END-IF

           IF ATVTOCAR-CODGRUPO = ZEROES OR SPACES OR 
              ATVTOCAR-CODGRUPO <> LIB070R-GRUPOLIQ
              SET SI-PROCESAR-ATR541 TO TRUE
           END-IF

           IF ATVTOCAR-INDLIQCAR = ZEROES OR SPACES OR 
              ATVTOCAR-INDLIQCAR <> "W"
              SET SI-PROCESAR-ATR541 TO TRUE
           END-IF

           IF ATVTOCAR-FECHLIQ = ZEROES OR SPACES OR 
              ATVTOCAR-FECHLIQ <> WS-FECHA-OPE-GUION
              SET SI-PROCESAR-ATR541 TO TRUE
           END-IF

           IF ATVTOCAR-NUMMESCOMPL = ZEROES OR SPACES OR 
              ATVTOCAR-NUMMESCOMPL <> WS-ATPC021-NUMMESCOMPL
              SET SI-PROCESAR-ATR541 TO TRUE
           END-IF

           IF ATVTOCAR-MES-CAREN = SPACES OR 
              ATVTOCAR-MES-CAREN <> LIB610-MESES-CARENCIA
              SET SI-PROCESAR-ATR541 TO TRUE
           END-IF
           .

       MOVER-DATOS-ATVTOCAR.
           INITIALIZE WS-ATVTOCAR

           MOVE LIB610-ENTIDAD             TO ATVTOCAR-CODENT

           MOVE LIB070R-CODPROLIQ          TO ATVTOCAR-CODPROCESO
           MOVE LIB070R-GRUPOLIQ           TO ATVTOCAR-CODGRUPO
      *LRO-TECNOCOM-DESFASE-INI           
           MOVE "W"                        TO ATVTOCAR-INDLIQCAR
      *LRO-TECNOCOM-DESFASE-FIN           

           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-OPE-AAAA-G 
           MOVE WS-FECCOM-MM               TO WS-FECHA-OPE-MM-G   
           MOVE WS-FECCOM-DD               TO WS-FECHA-OPE-DD-G 
           MOVE WS-FECHA-OPE-GUION         TO ATVTOCAR-FECHLIQ

           MOVE WS-ATPC021-NUMMESCOMPL     TO ATVTOCAR-NUMMESCOMPL
           MOVE LIB610-MESES-CARENCIA      TO ATVTOCAR-MES-CAREN
           .
       
       LLAMADA-A-ATR541.
           IF SI-LOGGEA-SERVICIO
              MOVE "I"           TO INDICADOR_I-O OF MPMLOG
              MOVE "ATR541  "    TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATVTOCAR   TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           CALL CT-ATR541          USING WS-ATVTOCAR

           IF SI-LOGGEA-SERVICIO
              MOVE "O"           TO INDICADOR_I-O OF MPMLOG
              MOVE "ATR541  "    TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATVTOCAR   TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

       VALIDAR-PROCESAR-ATR100.
           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA  
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-EDT-AAAA 
           MOVE WS-FECCOM-MM               TO WS-FECHA-EDT-MM   
           MOVE WS-FECCOM-DD               TO WS-FECHA-EDT-DD

           SET NO-PROCESAR-ATR100 TO TRUE

           IF RUTPAR-CODENT = ZEROES OR SPACES OR 
              RUTPAR-CODENT <> LIB610-ENTIDAD
              SET SI-PROCESAR-ATR100 TO TRUE
           END-IF

           IF RUTPAR-CODPAR = ZEROES OR SPACES OR 
              RUTPAR-CODPAR <> CT-INTERES
              SET SI-PROCESAR-ATR100 TO TRUE
           END-IF

           IF RUTPAR-CODVAR = ZEROES OR SPACES OR 
              RUTPAR-CODVAR <> CT-TIPO-INTERES
              SET SI-PROCESAR-ATR100 TO TRUE
           END-IF

           IF RUTPAR-FECHA = ZEROES OR SPACES OR 
              RUTPAR-FECHA <> WS-FECHA-EDITADA
              SET SI-PROCESAR-ATR100 TO TRUE
           END-IF
           .

       MOVER-DATOS-ATRUTPAR.
           MOVE  SPACES                TO WS-TIPO-INTERES
           MOVE  LIB610-ENTIDAD        TO RUTPAR-CODENT
           MOVE  CT-INTERES            TO RUTPAR-CODPAR
           MOVE  CT-TIPO-INTERES       TO RUTPAR-CODVAR

           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA  
           MOVE WS-FECCOM-AAAA             TO WS-FECHA-EDT-AAAA 
           MOVE WS-FECCOM-MM               TO WS-FECHA-EDT-MM   
           MOVE WS-FECCOM-DD               TO WS-FECHA-EDT-DD   
           MOVE WS-FECHA-EDITADA           TO RUTPAR-FECHA.

       LLAMADA-A-ATR100.    
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                   TO INDICADOR_I-O OF MPMLOG
              MOVE "ATR100   "           TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATRUTPAR           TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           CALL  CT-ATR100  USING WS-ATRUTPAR

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                   TO INDICADOR_I-O OF MPMLOG
              MOVE "ATR100   "           TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATRUTPAR           TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

           EVALUATE TRUE
             WHEN RUTPAR-OK
               MOVE RUTPAR-CODVALOR-DET(1)
                                  TO WS-TIPO-INTERES
             WHEN OTHER
               MOVE SPACES        TO WS-TIPO-INTERES
           END-EVALUATE. 
           

RDC    CARGAR-DATOS-INTERES.
      *---------------------
           MOVE WS-ATPC021-NUMMESCOMPL TO ATCUOTAS-NUMMESCOMPL.
           
           PERFORM 99100-R-MOVER_CUO
                   VARYING WS-I-CUO FROM 1 BY 1 
                           UNTIL WS-I-CUO = CT-VALOR-100.
    
RDC    99100-R-MOVER_CUO.
      *---------------------  
            MOVE ATVTOCAR-LIQ-CUOTA(WS-I-CUO) 
                            TO ATCUOTAS-LIQ-CUOTA(WS-I-CUO).

       DESARROLLO-PLAN.
      *----------------
           INITIALIZE WS-ATPLANFI.
           PERFORM MOVER-DATOS-ATPLANFI.
           PERFORM LLAMADA-A-ATR524.

       MOVER-DATOS-ATPLANFI.
      *---------------------
           MOVE LIB610-CODENT            TO ATPLANFI-CODENT.
           MOVE LIB610-CENTALTA          TO ATPLANFI-CENTALTA.
           MOVE LIB610-CUENTA            TO ATPLANFI-CUENTA.
           MOVE LIB610-COD-MONEDA        TO ATPLANFI-CLAMON.
           MOVE VAR-CODTIPC              TO ATPLANFI-CODTIPC.

           MOVE LIB610-FECHA-HORA-TRX(1:8) TO WS-FECHA-COMPRA  
           MOVE WS-FECCOM-AAAA           TO WS-FECHA-EDT-AAAA 
           MOVE WS-FECCOM-MM             TO WS-FECHA-EDT-MM   
           MOVE WS-FECCOM-DD             TO WS-FECHA-EDT-DD   
           MOVE WS-FECHA-EDITADA         TO ATPLANFI-FECALTCOMP
                                            ATPLANFI-FECPROCES
                                            ATPLANFI-FECFAC.

           MOVE WS-LINEA                 TO ATPLANFI-LINEA.

           IF LIB610-PAN  = SPACES  OR  LOW-VALUES  OR  ZEROS
              MOVE SPACES                TO ATPLANFI-PAN
           ELSE
              MOVE LIB610-PAN             TO ATPLANFI-PAN
           END-IF.
           
           MOVE LIB610-IMP-TRX           TO ATPLANFI-IMPFAC.

ADD        MOVE ATVTOCAR-LIQ-CUOTA(1)     TO ATPLANFI-FECLIQ.
ADD   *     MOVE "0001-01-01"             TO ATPLANFI-FECLIQ.
           MOVE "SSSSSSSSSSSS"           TO ATPLANFI-NUMMESFIN.
           MOVE LIB070R-RESEMIEXT        TO ATPLANFI-RESEMIEXT.
           MOVE LIB070R-DESCPLANILLA     TO ATPLANFI-DESCPLANILLA.
           MOVE ZEROS                    TO ATPLANFI-INTERES-COM
                                            ATPLANFI-INTERES-CAR
                                            ATPLANFI-IMPINTTOTAL
                                            ATPLANFI-IMPGASTOT
                                            ATPLANFI-IMPAMORT.
ADD        MOVE LIB610-COD-PAIS          TO ATPLANFI-CODPAIS
      * Importe total gesic2 (entrada)
ADD   *    MOVE L470C-IMPGASTO2          TO ATPLANFI-IMPTOT-GSIC2.
           MOVE WS-FECHA-EDITADA         TO ATPLANFI-FECALTA.
      * NumPlazos (entrada)
           MOVE WS-NUM-CUOTA             TO ATPLANFI-NUM-PLAZOS.
           MOVE LIB610-IMP-TRX           TO ATPLANFI-IMPORTE.
           MOVE ATCUOTAS-IMP-CUO         TO ATPLANFI-IMP-CUOTA.
           MOVE ATCUOTAS-INT-CAR         TO ATPLANFI-INTERES-CAR
ADD        ADD  ATCUOTAS-INT-DES         TO ATPLANFI-INTERES-CAR
           MOVE ATCUOTAS-INT-COM         TO ATPLANFI-INTERES-COM
ADD        MOVE ATCUOTAS-DIAS-DESFAS     TO ATPLANFI-DIAS-DESFAS
ADD        MOVE WS-G2                    TO ATPLANFI-PLAZO-GSIC2

           MOVE LIB610-MESES-CARENCIA    TO ATPLANFI-MES-CAREN.
           MOVE WS-TASA_COMERCIAL        TO ATPLANFI-TASA-COMERC.
           MOVE WS-TASA_COMERCIAL        TO ATPLANFI-TASA-CARENC.
           MOVE WS-G1                    TO ATPLANFI-TASA-GSIC.
RDC   **    MOVE MP021-FORCALINT          TO ATCUOTAS-FORCALINT.
RDC   *     MOVE MP021-INDADMSALDO        TO ATCUOTAS-FORCALINT.
           MOVE WS-ATPC021-INDADMSALDO   TO ATCUOTAS-FORCALINT.
ADD   *     MOVE MP021-NUMMESCOMPL        TO ATPLANFI-NUMMESCOMPL.
           MOVE WS-ATPC021-NUMMESCOMPL   TO ATPLANFI-NUMMESCOMPL.
           MOVE 48 TO ATPLANFI-NUM-OCCURS          
           PERFORM VARYING W-P FROM 1 BY 1 UNTIL 
                                W-P > (ATPLANFI-NUM-PLAZOS +
                                      LIB610-MESES-CARENCIA + 1)       
      *        MOVE ATVTODIF-LIQ-CUOTA(W-P)    
add            MOVE ATVTOCAR-LIQ-CUOTA(W-P)          
                                TO ATPLANFI-VTO-CUOTA(W-P)
           END-PERFORM.

           
       LLAMADA-A-ATR524.
      *-----------------
           MOVE CT-RUTINA                TO MQCOPY-PROGRAMA
           MOVE WS-ATPLANFI              TO MQCOPY-MENSAJE
           MOVE "00"                     TO MQCOPY-RETORNO
           IF SI-LOGGEA-SERVICIO
              MOVE "I"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR524             TO CODIGO_RUTINA OF MPMLOG 
              MOVE WS-ATPLANFI           TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           CALL  CT-ATR524            USING ATPLANFI.

           IF SI-LOGGEA-SERVICIO
              MOVE "O"                   TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR524             TO CODIGO_RUTINA OF MPMLOG 
              MOVE WS-ATPLANFI           TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           EVALUATE ATPLANFI-COD-RETORNO        
               WHEN CT-RETORNO-OK
                    CONTINUE
               WHEN OTHER
                    MOVE 0030            TO STCOPY-COD-RESPUESTA
                    MOVE CT-ERROR-DPF    TO LIB610-DESCRIP-ERROR
                    PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.


       OBTENER-IMPUESTO-ITE.
      *----------------------.
           INITIALIZE WS-ATRUTITE.
           MOVE 0 TO WS-ITE.
                      
           MOVE LIB610-CODENT          TO ATRUTITE-CODENT
           MOVE LIB610-IMP-TRX         TO ATRUTITE-IMPORTE
           MOVE LIB610-COD-MONEDA      TO ATRUTITE-CLAMON
           MOVE LIB610-MESES-CARENCIA  TO ATRUTITE-NUMCUOTAS-DIFER

           MOVE WS-FECHA-EDT-AAAA      TO ATRUTITE-FEC-AAAA
           MOVE WS-FECHA-EDT-MM        TO ATRUTITE-FEC-MM
           MOVE WS-FECHA-EDT-DD        TO ATRUTITE-FEC-DD

           MOVE 'E'                    TO ATRUTITE-VERTIENTE
           MOVE "SSSSSSSSSSSS"         TO ATRUTITE-NUMMESFIN
           MOVE ZEROS                  TO ATRUTITE-NUMIMPTO

           MOVE WS-NUM-CUOTA           TO ATRUTITE-NUMCUOTAS

           MOVE LIB070R-CODREGIMEN     TO ATRUTITE-CODREGIMEN
           MOVE LIB070R-RESEMIEXT      TO ATRUTITE-RESEMIEXT
           MOVE LIB070R-TIPBON         TO ATRUTITE-BONIFICACION
           MOVE LIB070R-PRODUCTO       TO ATRUTITE-PRODUCTO
           MOVE LIB070R-SUBPRODU       TO ATRUTITE-SUBPRODU
           MOVE LIB070R-CONPROD        TO ATRUTITE-CONPROD

           IF  WS-TASA_COMERCIAL > 0
                MOVE 'S'               TO ATRUTITE-IND-ITE
           ELSE
                MOVE 'N'               TO ATRUTITE-IND-ITE
           END-IF

           INITIALIZE WS-ATPC044
           MOVE LIB610-CODENT        TO WS-ATPC044-CODENT
           MOVE WS-TIPO-FAC-SAL      TO WS-ATPC044-TIPOFAC
           MOVE WS-INDNORCOR         TO WS-ATPC044-INDNORCOR
           PERFORM ATPC044-BUSCAR-EN-ARREGLO
           MOVE WS-ATPC044-CODIMPTO  TO ATRUTITE-CODIMPTO

      *    Muevo fechas de vencimiento
           PERFORM VARYING WS-FF FROM 1 BY 1 UNTIL WS-FF > 99
              MOVE ATVTOCAR-LIQ-CUOTA(WS-FF) TO
                        ATRUTITE-VTO-CUOTA(WS-FF)
           END-PERFORM
           
           IF SI-LOGGEA-SERVICIO
              MOVE "I"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR056     TO CODIGO_RUTINA OF MPMLOG
              MOVE ATRUTITE      TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           CALL CT-ATR056              USING ATRUTITE
           
           IF SI-LOGGEA-SERVICIO
              MOVE "O"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR056     TO CODIGO_RUTINA OF MPMLOG
              MOVE ATRUTITE      TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           EVALUATE TRUE
               WHEN ATRUTITE-CODRET-OK
                    MOVE ATRUTITE-IMPUESTO-TOTAL TO WS-ITE

               WHEN OTHER 
                    MOVE 0030            TO STCOPY-COD-RESPUESTA
                    MOVE "ERROR EN CALCULO DE ITE"
                                         TO LIB610-DESCRIP-ERROR
                    PERFORM 999999-ERROR-PROGRAMA
           END-EVALUATE.


       CALCULO-COMISIONES-ONLINE.
      *--------------------------
           MOVE 0                TO WS-COMISION-ONLINE
                                    WS-COMISION

           INITIALIZE WS-ATPC059
           MOVE "O"                TO WS-ATPC059-INDAPLCON
           MOVE "1"                TO WS-ATPC059-INDAPLDEBCRE
           MOVE WS-TIPO-FAC-SAL    TO WS-ATPC059-TIPOFAC
           MOVE WS-INDNORCOR       TO WS-ATPC059-INDNORCOR
           PERFORM ATPC059-BUSCAR-EN-ARREGLO

           EVALUATE TRUE
               WHEN WS-ATPC059-RETORNO-OK
                    INITIALIZE WS-ATPC052
                    MOVE WS-ATPC059-CODENT     TO WS-ATPC052-CODENT
                    MOVE WS-ATPC059-CODCONECO  TO WS-ATPC052-CODCONECO
                    MOVE "E"                   TO WS-ATPC052-INDVERT
                    MOVE "TA"                  TO WS-ATPC052-INDNIVAPL
                    PERFORM ATPC052-BUSCAR-EN-ARREGLO

                    IF WS-ATPC052-RETORNO-OK
                       IF  WS-ATPC052-VERTIENTE = "E" AND
                           WS-ATPC052-TIPCONECO = "C" AND
                           L470C-FECHA >= WS-ATPC052-FECINI AND
                           L470C-FECHA <= WS-ATPC052-FECFIN
                      
                           PERFORM CALCULO-COMISIONES
                           PERFORM VALIDA-TOPE
                        END-IF
                    END-IF 

               WHEN WS-ATPC059-RETORNO-ERROR
      *              MOVE "I"     TO MP021-FORCALINT
RDC   *              MOVE "I"     TO MP021-INDADMSALDO
                    MOVE "I"     TO WS-ATPC021-FORCALINT
                    MOVE "I"     TO WS-ATPC021-INDADMSALDO
           END-EVALUATE.

       CALCULO-COMISIONES.
      *-------------------
            INITIALIZE WS-ATRUTCOM.
            MOVE LIB610-CODENT           TO ATRUTCOM-CODENT
            MOVE LIB610-CENTALTA         TO ATRUTCOM-CENTALTA
            MOVE LIB610-CUENTA           TO ATRUTCOM-CUENTA
            MOVE CT-1                    TO ATRUTCOM-DEBCRE
            MOVE WS-INDNORCOR            TO ATRUTCOM-INDNORCOR
            MOVE WS-TIPO-FAC-SAL         TO ATRUTCOM-TIPOFAC
            MOVE LIB610-COD-MONEDA       TO ATRUTCOM-CLAMON
            MOVE LIB070R-PRODUCTO        TO ATRUTCOM-PRODUCTO
            MOVE LIB070R-SUBPRODU        TO ATRUTCOM-SUBPRODU
            MOVE LIB070R-CONPROD         TO ATRUTCOM-CONPROD
            MOVE WS-ATPC059-CODCONECO    TO ATRUTCOM-CODCONECO
            MOVE WS-ATPC052-NIVAPLICA    TO ATRUTCOM-NIVAPLICA
            MOVE WS-ATPC052-INDAPLICA    TO ATRUTCOM-INDAPLICA
            MOVE WS-ATPC021-INDUF        TO ATRUTCOM-INDUF 
            MOVE WS-ATPC021-CLAMONUF     TO ATRUTCOM-CLAMONUF
            MOVE LIB070R-TIPBON          TO ATRUTCOM-TIPBON  
            MOVE LIB610-IMP-TRX          TO ATRUTCOM-IMPORTE

            PERFORM BUSCAR-MARCA-TIPO
            MOVE MP466-CODMAR(1)         TO ATRUTCOM-CODMAR
            MOVE MP466-INDTIPT(1)        TO ATRUTCOM-INDTIPT
            MOVE WS-ATPC052-INDPORTRAMO
                                         TO ATRUTCOM-INDPORTRAMO
            MOVE WS-ATPC052-INDBONOPE
                                         TO ATRUTCOM-INDBONOPE
            MOVE WS-FECHA-SYS            TO ATRUTCOM-FECHASYS
            MOVE WS-ATPC052-PORREF
                                         TO ATRUTCOM-PORREF
           IF SI-LOGGEA-SERVICIO
              MOVE "I"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR034     TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATRUTCOM   TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

            CALL CT-ATR034 USING WS-ATRUTCOM
 
           IF SI-LOGGEA-SERVICIO
              MOVE "O"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR034     TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATRUTCOM   TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

            IF ATRUTCOM-CODRET-NOOK
               MOVE 0 TO ATRUTCOM-IMPBONIF
               MOVE 0 TO ATRUTCOM-IMPBRUCOM
            END-IF
 
            SUBTRACT ATRUTCOM-IMPBONIF FROM ATRUTCOM-IMPBRUCOM GIVING
                                WS-COMISION ROUNDED
    
            IF  WS-COMISION NOT EQUAL ZEROS
            AND LIB070R-CODCAM NOT EQUAL CT-000000-ALF
                PERFORM BONIFICA-CAMPANAS
            END-IF.

       BUSCAR-MARCA-TIPO.
      *------------------
           INITIALIZE WS-MPM0466
           MOVE LIB610-CODENT    TO MP466-CODENT
           MOVE LIB610-CENTALTA  TO MP466-CENTALTA
           MOVE LIB610-CUENTA    TO MP466-CUENTA
           MOVE SPACES           TO IND-PAGINACION
           MOVE WS-MPM0466       TO MQCOPY-MENSAJE
           IF SI-LOGGEA-SERVICIO
              MOVE "I"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATD466     TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY        TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF

           CALL CT-ATD466      USING WS-MQCOPY
           IF SI-LOGGEA-SERVICIO
              MOVE "O"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATD466     TO CODIGO_RUTINA OF MPMLOG
              MOVE MQCOPY        TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF
           
           MOVE MQCOPY-MENSAJE TO WS-MPM0466
           
           IF MQCOPY-RETORNO = CT-RETORNO-OK
              CONTINUE
           ELSE
              MOVE 0030        TO STCOPY-COD-RESPUESTA
              MOVE "ERROR AL MARCA - TIPO"
                               TO LIB610-DESCRIP-ERROR
              PERFORM 999999-ERROR-PROGRAMA
           END-IF
           .

       BONIFICA-CAMPANAS.
      *------------------
            INITIALIZE WS-ATRUTCAM
            MOVE LIB610-CODENT               TO ATRUTCAM-CODENT
            MOVE LIB610-CENTALTA             TO ATRUTCAM-CENTALTA
            MOVE LIB610-CUENTA               TO ATRUTCAM-CUENTA
            MOVE WS-ATPC059-CODCONECO        TO ATRUTCAM-CODCONECO
            MOVE WS-COMISION                 TO ATRUTCAM-IMPORTE 
            IF SI-LOGGEA-SERVICIO
              MOVE "I"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR610     TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATRUTCAM   TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
            END-IF

            CALL CT-ATR610 USING WS-ATRUTCAM

            IF SI-LOGGEA-SERVICIO
              MOVE "O"           TO INDICADOR_I-O OF MPMLOG
              MOVE CT-ATR610     TO CODIGO_RUTINA OF MPMLOG
              MOVE WS-ATRUTCAM   TO MENSAJE_COPY  OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
            END-IF
 
            IF ATRUTCAM-RETORNO-OK
ADD   *        MOVE L470C-CLAMON      TO WS-COD-MONEDA
               PERFORM 9999-CALCULO-DE-DECIMALES
               IF ATMONDEC-NUMDEC EQUAL ZEROS      
                  COMPUTE WS-IMPBONIF-SIN ROUNDED =
                                         ATRUTCAM-IMPBONIF * 1  
                  MOVE WS-IMPBONIF-SIN TO ATRUTCAM-IMPBONIF
               END-IF
               ADD ATRUTCAM-IMPBONIF   TO ATRUTCOM-IMPBONIF                    
               SUBTRACT ATRUTCOM-IMPBONIF FROM ATRUTCOM-IMPBRUCOM          
                        GIVING WS-COMISION ROUNDED
            END-IF.

      *-------------------------*                                               
       9999-CALCULO-DE-DECIMALES.                                               
      *-------------------------*                                               
      * ACCEDEMOS A LA TABLA CORPORATIVA DE MONEDAS PARA OBTENER EL             
      * NUMERO DE DECIMALES ASOCIADOS A LA MONEDA Y ASI FORMATEAR E             
      * IMPORTE                                                                 
           INITIALIZE ATMONDEC
           MOVE LIB610-COD-MONEDA   TO ATMONDEC-CLAMONDIV
           CALL CT-ATR069  USING ATMONDEC
           IF NOT ATMONDEC-CODRET-OK
              MOVE 0030        TO STCOPY-COD-RESPUESTA
              MOVE "ERROR RUTINA ATR069"
                               TO LIB610-DESCRIP-ERROR
              PERFORM 999999-ERROR-PROGRAMA
           END-IF
                                                                                
      * CALCULAMOS EL EXPONENTE DE 10 POR EL QUE HAY QUE DIVIDIR EL             
      * IMPORTE, DEPENDIENDO DEL NUMERO DE DECIMALES QUE TENGA.                 
           MOVE ATMONDEC-NUMDEC              TO WS-DECIMALES.

       VALIDA-TOPE.
      *------------
           INITIALIZE WS-ATVALTOP
           IF WS-ATPC052-INDTOPE = "S" AND
              ATRUTCOM-IMPBRUCOM > ZEROES
     
               MOVE LIB610-CODENT           TO ATVALTOP-CODENT
               MOVE LIB610-CENTALTA         TO ATVALTOP-CENTALTA
               MOVE LIB610-CUENTA           TO ATVALTOP-CUENTA
               MOVE LIB610-COD-MONEDA       TO ATVALTOP-CLAMON
               MOVE LIB070R-PRODUCTO        TO ATVALTOP-PRODUCTO
               MOVE LIB070R-SUBPRODU        TO ATVALTOP-SUBPRODU
               MOVE WS-ATPC059-CODCONECO    TO ATVALTOP-CODCONECO
               MOVE WS-ATPC021-INDUF        TO ATVALTOP-INDUF
               MOVE WS-ATPC021-CLAMONUF     TO ATVALTOP-CLAMONUF
               MOVE WS-FECHA-SYS            TO ATVALTOP-FECHASYS

      *         MOVE L470C-IMP-CAPITAL(1)    TO ATVALTOP-IMPORTE
               MOVE WS-ATPLANFI-IMP-CAPITAL TO ATVALTOP-IMPORTE


               MOVE ATRUTCOM-IMPBRUCOM TO ATVALTOP-IMPBRUCOM
               MOVE ATRUTCOM-IMPBONIF  TO ATVALTOP-IMPBONIF
               MOVE 0                  TO ATVALTOP-IMPIMPTO
               MOVE WS-ATPC052-PORCOMTOP
                                       TO ATVALTOP-PORCOMTOP
               MOVE 1                  TO ATVALTOP-NUMCUOTAS

               IF SI-LOGGEA-SERVICIO
                 MOVE "I"           TO INDICADOR_I-O OF MPMLOG
                 MOVE "ATR022  "    TO CODIGO_RUTINA OF MPMLOG
                 MOVE WS-ATVALTOP   TO MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
               END-IF
               
               CALL  CT-ATR022  USING  WS-ATVALTOP

               IF SI-LOGGEA-SERVICIO
                 MOVE "O"           TO INDICADOR_I-O OF MPMLOG
                 MOVE "ATR022  "    TO CODIGO_RUTINA OF MPMLOG
                 MOVE WS-ATVALTOP   TO MENSAJE_COPY  OF MPMLOG
                 PERFORM 888888-LOGGEAR-TRANSACCION
               END-IF
               
               IF ATVALTOP-CODRET  NOT  EQUAL  CT-VALOR-00
                  MOVE 0 TO ATRUTCOM-IMPBRUCOM
                  MOVE 0 TO ATRUTCOM-IMPBONIF
               ELSE
                  MOVE ATVALTOP-IMPBRUCOM TO ATRUTCOM-IMPBRUCOM
                  MOVE ATVALTOP-IMPBONIF  TO ATRUTCOM-IMPBONIF
               END-IF
               
               SUBTRACT ATRUTCOM-IMPBONIF FROM ATRUTCOM-IMPBRUCOM
                          GIVING WS-COMISION ROUNDED
           END-IF
           
           ADD WS-COMISION       TO WS-COMISION-ONLINE
           .


       888888-LOGGEAR-TRANSACCION.
      *--------------------------
           ACCEPT WS-HORA-SYS FROM TIME.
           MOVE WS-HORA-SYS               TO HORA_TRANSACCION OF MPMLOG.
           MOVE CT-CODIGO-SERVICIO        TO CODIGO_SERVICIO  OF MPMLOG.
           MOVE CT-RUTINA                 TO NOMBRE_RUTINA    OF MPMLOG.   
           ADD  1                         TO WS-NUM-SECUENCIA.
           MOVE WS-NUM-SECUENCIA          TO SECU_SERVICIO    OF MPMLOG.
           MOVE MPMLOG TO LINEA-ARCHIVO.

           WRITE REG-ARCHIVO.


       999999-ERROR-PROGRAMA.
      *----------------------
      
           IF LIB610-CODIGO-RETORNO = 99999
              MOVE WS-MENSAJE-ATOMICO TO LIB610-DESCRIP-ERROR
           ELSE
           
             MOVE LIB610-CODIGO-RETORNO     TO  LERR-COD-ERROR
             MOVE LIB610-COD-PAIS           TO  LERR-COD-PAIS
             MOVE CT-SERVICIO               TO  LERR-NOM-SERVICIO
             MOVE SPACES                    TO  LERR-MENSAJE-ERROR
           
             CALL CT-SFISERSERR USING WS-LIBERR
           
             IF WS-MENSAJE-ATOMICO = SPACES
               MOVE LERR-MENSAJE-ERROR        
                                         TO  LIB610-DESCRIP-ERROR
             ELSE
               STRING 
                   LERR-MENSAJE-ERROR
                   '-' 
                   WS-MENSAJE-ATOMICO
                   INTO LIB610-DESCRIP-ERROR
               END-STRING
             END-IF
           END-IF.
                
           PERFORM 300000-FINAL.

       300000-FINAL.
      *-------------
           IF SI-LOGGEA-ERROR AND LIB610-CODIGO-RETORNO NOT = 0
              MOVE "I"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-SERVICIO         TO  CODIGO_RUTINA OF MPMLOG
              MOVE INV-PARAMETROS      TO  MENSAJE_COPY OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.
           
           MOVE CT-LARGO-MENSAJE       TO LIB610-LARGO-MENSAJE
           MOVE LIB610-CODIGO-RETORNO  TO INV-COD-RETORNO.
           MOVE LIB610-LARGO-MENSAJE   TO INV-LARGO-MENSAJE.
           MOVE LIB611C                TO INV-PARAMETROS.     
      
           IF SI-LOGGEA-SERVICIO OR 
              SI-LOGGEA-ENTSAL   OR
              ( SI-LOGGEA-ERROR  AND 
                LIB610-CODIGO-RETORNO NOT = 0 )
              MOVE "O"                 TO  INDICADOR_I-O OF MPMLOG
              MOVE CT-SERVICIO         TO  CODIGO_RUTINA OF MPMLOG
              MOVE INV-PARAMETROS      TO  MENSAJE_COPY OF MPMLOG
              PERFORM 888888-LOGGEAR-TRANSACCION
           END-IF.

RDC   *     IF LIB610-CODIGO-RETORNO = CT-CORRECTO-COMMIT
RDC   *        EXEC SQL
RDC   *             COMMIT
RDC   *        END-EXEC
RDC   *     ELSE
RDC   *        EXEC SQL
RDC   *             ROLLBACK
RDC   *        END-EXEC
RDC   *     END-IF.
RDC        EXEC SQL
RDC             ROLLBACK
RDC        END-EXEC

           IF SI-LOGGEA-SERVICIO OR 
              SI-LOGGEA-ENTSAL   OR
              SI-LOGGEA-ERROR
              CLOSE ARCHIVO
           END-IF.

RDC        IF SW-0088 = CT-0088
PRCF          MOVE SW-LIGHT-PASO   TO  SW-LIGHT
RDC        END-IF.
           GOBACK.

       300000-FINAL-STOP.
      *-----------------
           MOVE WS-SQLCODE TO STCOPY-COD-RESPUESTA
           MOVE STCOPY-COD-RESPUESTA TO INV-COD-RETORNO
           MOVE  LIB611C                 TO INV-PARAMETROS
           DISPLAY "ERROR DE CONEXION A SFISER_MAE_CAG_SVC"
           DISPLAY "--------------------------------------"
           DISPLAY "ERROR ENCONTRADO: " WS-SQLCODE
           STOP RUN.


           COPY "ATPC021-PR.cpy".
           COPY "ATPC044-PR.cpy".
           COPY "ATPC052-PR.cpy".
           COPY "ATPC059-PR.cpy".
           
      *****************************************************************

      **         H A S T A   A Q U I   E L   P R O G R A M A         **

      *****************************************************************
